{"crc":-148348898, "lines":["WARNING - THIS EPISODE CONTAINS SUBJECT MATTER OF A SEXUAL NATURE.","Do you wish to continue?","*choice","  #Yes","    *goto sexualEncounter","  #No","    *set instantaneous true","    *finish","*label sexualEncounter","There is a concert in the Student Center, and you have made arrangements to go with your friend, Barb, and her new boyfriend, Larry. You are supposed to meet them in Barb's dorm room, then go with them to pick up your date. You arrive","on time, but notice that Barb and Larry are a bit rumpled in appearance. It seems you have interrupted a romantic interlude.","*page_break","Barb excuses herself so that she can shower and get ready for the concert. Larry is still glassy-eyed from tumbling around the room with Barb. There is a moment of uncomfortable silence after Barb walks down the hall to the showers.","Larry moves close to you and tells you that you have a bad sense of timing.","*page_break","He leans toward you and inquires if you would like to \"finish what Barb started?\"","","","Select an action:","","*choice","  #FINISH WHAT BARB STARTED","    *goto A1","  #TELL HIM THAT YOU COULDN'T DO THAT TO A FRIEND","    *goto A2","*label A1","Larry gives you a long, sensuous kiss and pushes you down on the bed. The door creaks open. The showers were being used and Barb had to wait a while before using them. When she sees the two of you, she kicks you both out. Do you want","to start seeing this guy regularly?","","","Select an action:","","*choice","  #YES","    *goto B1","  #NO","    *goto B2","*label B1","*set CN%-10","The next time you make arrangements to see him, you arrive only to be greeted by a happy-looking blonde who is walking out of his room. He has decided you are too \"mellow\" for him and doesn't want to see you again. You've been \"tossed.\"","*finish","*label B2","*set TH%+20","*set IN%+10","He might be a bit too wild, even for a party animal like you.","*finish","*label A2","*set TH%+10","*set TR%+20","*set IN%+20","Larry accuses you of being \"overly mellow.\" You wonder if Barb knows what she has gotten herself into.","*finish","",""], "labels":{"sexualencounter":8,"a1":25,"b1":37,"b2":41,"a2":46}}