{"crc":742560724, "lines":["You have just returned from your yearly physical checkup. After your examination you are told that you have begun your menopause. Even though it was something you expected might happen soon, when the news is delivered you feel a terrible","sinking feeling in your stomach.","*page_break","During a quiet time you begin to reflect on your life, your family and the people around you to whom you have formed attachments. You have lived a great part of your life, and now seems as good a time as any to take inventory.","*page_break","As you look around, you find that there are those much younger than you who have accomplished more. You have friends who have beautiful homes and vacation in Europe twice a year. There are other friends who seem to have achieved a great","deal more in other ways, too.","*page_break","The reality of losing the ability to produce children strikes you in a funny way. A part of you is relieved not to have to worry about taking precautions to avoid pregnancy. You will look forward to not having to bother with your period","every month, too.","*page_break","Another part of you feels a loss. You may feel a peculiar sense of uselessness. Intellectually, you know that you are still important and vital to many people, but emotionally, you have been conditioned to society's expectations and roles.","*choice mood action","  #DEPRESSED","    #SEEK GUIDANCE","      *goto A11","    #REMAIN AS YOU ARE","      *goto A12","  #CONTENT/RELIEVED","    *selectable_if (false) #SEEK GUIDANCE","      *finish","    #REMAIN AS YOU ARE","      *goto A22","*label A11","Is there something specific that you are depressed about?","","","Select an action:","","*choice","  #YES","    *goto B1","  #NO","    *goto B2","*label B2","*set HP%-30","This is not at all unusual in this phase of life.","*goto MID","*label B1","Do any of these reflect the reasons for your depression?","","","Select an action:","","*choice","  #\"I AM DISSATISFIED WITH MY FAMILY LIFE.\"","    *goto C1","  #\"I AM DISSATISFIED WITH WHAT I HAVE EARNED OR ACCOMPLISHED.\"","    *goto C2","  #\"I HAVE AN UNSATISFYING SOCIAL LIFE.\"","    *goto C3","  #\"I HATE MY JOB.\"","    *goto C4","  #\"I FEEL THAT I AM VERY UNSTABLE EMOTIONALLY.\"","    *goto C5","*label C1","*if FM<50","  *goto D.T","*else","  *goto D.F","*label D.T","I can see why you feel this way. So far your experiences with your family have not been very rewarding. Some of this may have to do with your own attitudes, and some of it may be completely out of your control.","*page_break","One thing is certain, however: there is always the possibility of reconciliation. It may mean swallowing some of your pride and facing some anger and resentment from those around you, but it can get better. You have some fine qualities.","Don't be afraid to let your family see them.","*finish","*label D.F","I can't understand why you feel this way. You have had some very positive family experiences. Perhaps you are expecting too much. This can be a very trying time in a woman's life. If you are not feeling well about aging, this can cast a","negative and gloomy impression on everything you have done, despite all the positives. Be careful of this.","*finish","*label C2","You are not alone. Some people look at their earnings and acquisitions as \"success points.\" If they have not achieved enough of them by a certain age, they label themselves failures. This is the trap set by people who are externally","motivated.","*page_break","It may sound corny, but real success comes from within and affects everything you do. There is always a bigger house, a new fur or a cruise to somewhere. These markers of success stop being satisfying soon after they are acquired,","because when too many people get them, they no longer function as symbols of success.","*finish","*label C3","One of the simplest keys to improving one's social life is variety. People who complain about their social lives are usually in a rut -- seeing the same people, doing the same things, year after year. Traveling outside your usual social","circles will bring you into contact with different kinds of people, some of whom you will like, and some of whom you will dislike.","*page_break","Doing this involves a certain amount of risk -- the risk of exposing yourself to others, which can hold you back. The chance is well worth it, provided you can avoid stereotyping individuals or groups.","*finish","*label C4","*if EM>0","  *goto Q.T","*else","  *goto Q.F","*label Q.F","What job?","*finish","*label Q.T","This is a common complaint from people your age, and it is quite a dilemma. You can't just pick up and move, can you? I must point out that complaining about things that are extremely difficult to change can become a handy excuse for","ignoring other things that are difficult to own up to.","*page_break","If you REALLY wanted to, you could do many things about your job. You could go back to college, learn some new skills or start your own business. All of these things might be difficult, but not IMPOSSIBLE, because people do them all the","time.","*page_break","One of the key things to consider is the difference between WISHING and WANTING. You can spend the rest of your life WISHING for something magical to happen that will change your unsatisfying situation. If you WANT something badly","enough, you do whatever is necessary to make it happen, even if it is difficult.","*finish","*label C5","Join the club.","*label MID","This is a time of life when mixed emotions prevail. You can feel terrific one day and blue the next, for no reason at all. You are trying to adjust to a phase of life that some people mistakenly associate with \"winding down\" or","\"finishing up,\" even \"preparing for death.\" This is one of the causes of the infamous mid-life crisis.","*page_break","Instead of numbering your days, stop feeling sorry for yourself. This is a period when you should be able to sit back and enjoy some of your new freedom from responsibilities. Use your time and energy learning to live, instead of","preparing to die.","*finish","*label A22","You must be either quite healthy, or you are resistant to facing some of the typical worries associated with this time of life. In case you are interested, some of your friends are finding themselves terribly ambivalent about their","lives right about now. They are experiencing mood swings, bouts of guilt, shame and anxiety, even panic.","*page_break","Since you are not experiencing any of these, it would be inappropriate to offer words of encouragement. I hope your outlook remains this positive throughout the rest of your life!","*finish","*label A12","*set HP%-40","*set CA%-20","Your apathy is disturbing. Your lack of action during this critical \"mid-life\" time may only drive you further into depression.","*finish","",""], "labels":{"a11":23,"b2":34,"b1":38,"c1":55,"d.t":60,"d.f":66,"c2":70,"c3":77,"c4":83,"q.f":88,"q.t":91,"c5":101,"mid":103,"a22":110,"a12":116}}