{"crc":-1616873248, "lines":["Russel Martin is one of those friends who never acted like a \"stupid guy.\" Even though you are a girl and he is a boy, you've always gotten along great. You have listened to each other's problems and told each other secrets that no one","else even knows.","*page_break","Next week is the annual \"Sadie Hawkins\" dance at school. All of the girls have to ask guys to be their dates. You would have a great time with Russ. There's only one problem: Russel is about five inches shorter than you.","*choice mood action","  #SELF-CONSCIOUS","    #ASK HIM TO THE DANCE","      *goto A11","    #DON'T ASK HIM TO THE DANCE","      *goto A12","  #SELF-ASSURED","    #ASK HIM TO THE DANCE","      *goto A21","    *selectable_if (false) #DON'T ASK HIM TO THE DANCE","      *finish","*label A11","*set SC%+30","Against your better judgment, you ask him to the dance. He is extremely flattered. How does this make you feel?","","","Select a mood:","","*choice","  #BETTER","    *goto B1","  #STILL SELF-CONSCIOUS","    *goto B2","*label B1","*set SC%+10","You realize that friendship is much more important than having people point at you and laugh (which they do). The two of you have a terrific time together.","*finish","*label B2","*set SC%-10","You worry about how you look so much, that you wind up having a lousy time at the dance. You and Russel go home early and decide not to go on any more dates until he grows. Too bad; he really is a nice person. How do you feel now?","*label GUILTY","","","Select a mood:","","*choice","  #GUILTY","    *goto C1","  #NOT GUILTY","    *goto C2","*label C1","Then stop being so concerned about what people think of you and have a good time!","*finish","*label C2","*set SC%-10","Five years from now Russel becomes a handsome six-foot six-inch dream. The next time you want him to be your date, be prepared to be rejected!","*finish","*label A12","You know, he was really hoping that you would go together. He wouldn't have gone with anyone else. The day after the dance, you walk over to him in the hall. When you say hello, you notice that he looks upset, even though he says that","nothing's bothering him. You know exactly why he's upset. Do you feel:","*goto GUILTY","*label A21","Of course, you have a fantastic time. You make fun of everyone who is stupid enough to comment on the difference in your size. Five years after the dance, Russel becomes a six-foot six-inch dream!","*finish","",""], "labels":{"a11":15,"b1":27,"b2":31,"guilty":34,"c1":44,"c2":47,"a12":51,"a21":55}}