{"crc":-221641931, "lines":["On the night that you have a date with ${loverName}, your best friend from high school, Loretta, has arrived in town unexpectedly. ${loverName} tells you to feel free to bring her along.","","","Select an action:","","*choice","  #TAKE LORETTA ALONG","    *goto A1","  #POSTPONE THE DATE UNTIL LORETTA LEAVES","    *goto A2","*label A2","*set CN%+10","Suit yourself. ${loverName} says he'll see you around sometime. He is mad because you broke your date.","*finish","*label A1","*set SC%+30","Loretta is the domineering type. She takes control of the evening almost immediately after the introductions are made. You and ${loverName} want to go to dinner at a Chinese restaurant. Loretta prefers Italian. In order to appease your","friend, ${loverName} convinces you that Italian would be best.","*page_break","During the meal you would like to order white wine, but Loretta jumps in and orders a very expensive bottle of red wine. Loretta also orders three main courses, truffles for dessert, and enough after-dinner drinks to anesthetize a horse.","*page_break","Throughout the evening, the conversation is monopolized by Loretta, who is fond of disagreeing with ${loverName}, then whispering snide comments to you. All in all, this makes the entire evening quite uncomfortable. When the waiter arrives","with the check, you can:","","","Select an action:","","*choice","  #OFFER TO PICK UP THE TAB","    *goto B1","  #SAY NOTHING","    *goto B2","  #ANNOUNCE THAT EVERYONE IS GOING \"DUTCH\"","    *goto B3","*label B1","*set SC%+30","That is very kind of you. ${loverName} insists on paying for everyone.","","","Select an action:","","*choice","  #ACCEPT THE OFFER","    *goto C1","  #REJECT THE OFFER POLITELY","    *goto C2","*label C1","You offered once, right? After ${loverName} picks up the check, Loretta says in a loud stage whisper, \"He's loaded. Maybe he's in the MOB!\"","*finish","*label C2","Loretta thanks ${loverName}, but mentions that it is difficult to find really good Italian food anywhere these days.","*finish","*label B2","*set GN%-10","${loverName} assumes that everyone is paying for his and her own portion. \"Hrrrrrmph,\" Loretta snorts. \"You told me that he was kind and generous. What a CHEAPSKATE,\" she sneers.","","","Select an action:","","*choice","  #GIVE HER A PIECE OF YOUR MIND","    *goto D1","  #IGNORE HER","    *goto D2","*label D2","*if TR<70","  *goto E.T","*else","  *goto E.F","*label E.T","You don't have the impulse control necessary to do that.","*label D1","*set GN%-20","Now you recall why you haven't seen her for so long. She nearly ruined your evening with ${loverName}. But don't worry; he seems to have taken it in stride.","*if MS>0","  *goto F.T","*else","  *goto F.F","*label F.T","You should have stayed home with your husband tonight.","*label F.F","*finish","*label E.F","This is extremely difficult to do, but you have the impulse control necessary to accomplish it. You are a true lady. Later in the evening, after you send Miss Manners home, you get a telephone call from ${loverName}. He understands that","you're nothing like your friend.","*finish","*label B3","*set GN%-10","That's fine with ${loverName}. He's had his fill of food and Loretta. At least now he can't be angry about having to pay for her dinner after taking such abuse.","*if MS>0","  *goto G.T","*else","  *goto G.F","*label G.T","*page_break","You should have stayed home with your husband tonight.","*label G.F","*finish","",""], "labels":{"a2":10,"a1":14,"b1":34,"c1":46,"c2":49,"b2":52,"d2":64,"e.t":69,"d1":71,"f.t":78,"f.f":80,"e.f":82,"b3":86,"g.t":93,"g.f":96}}