{"crc":1405712399, "lines":["*if AG < 45","  Sorry, you're still too young for this experience.  Come back later.","  *set instantaneous true","  *finish","*elseif AG > 56","  Sorry, you're too old for this experience.","  *finish","While you are thinking about your life and the future, you come to a startling realization: The average life expectancy for women is only about 20 years past your current age.","*choice mood action","  #ANXIOUS","    #IGNORE THE THOUGHT","      *goto A11","    #DO SOMETHING ABOUT THE THOUGHT","      *goto A12","  #TERRIFIED","    #IGNORE THE THOUGHT","      *goto A21","    #DO SOMETHING ABOUT THE THOUGHT","      *goto A22","  #DEPRESSED","    #IGNORE THE THOUGHT","      *goto A31","    #DO SOMETHING ABOUT THE THOUGHT","      *goto A32","  #CALM","    #IGNORE THE THOUGHT","      *goto A41","    *selectable_if (false) #DO SOMETHING ABOUT THE THOUGHT","      *finish","*label A11","*set CA%-10","Ignoring the thought is a form of denial. Perhaps you would prefer to think that you are immortal.","*finish","*label A12","What would you like to do?","","","Select an action:","","*choice","  #SEARCH FOR THE FOUNTAIN OF YOUTH","    *goto B1","  #RESOLVE TO GET ALL YOU CAN OUT OF LIFE","    *goto B2","*label B1","You are too anxious. If you found it, you would probably overlook it!","*finish","*label A32","*label B2","How will you do that?","","","Select an action:","","*choice","  #DEVOTE YOUR LIFE TO HELPING OTHERS","    *goto C1","  #HAVE AS MUCH FUN AS POSSIBLE","    *goto C2","  #CONCENTRATE ON THE PRESENT AND AVOID BEING MORBID","    *goto C3","*label C1","*if GN>70","  *goto D.T","*else","  *goto D.F","*label D.T","*set SC%+30","This is a goal that is consistent with your personality. You are a kind and gentle person. Devoting your life to others can be rich and rewarding. I'm sure you will enhance the lives of many.","*finish","*label D.F","*set GN%+60","This is a noble life plan. Many would have chosen more self-serving options. Your Gentleness characteristic is beginning to blossom in your late middle years.","*finish","*label C2","I can understand why you chose this and can't really blame you. There are many ways to \"have fun,\" some more time-of-life approriate than others.","*page_break","You've seen those women who try to wear teen-age fashions to try to look youthful and have fun. They are often very disappointed with the results of their efforts.","*finish","*label C3","*set TH%+30","You have obviously become aware of the dangers of thinking too far ahead. Often times, the result of such preoccupation with the future is hopelessness (\"I'll never get out of the rut I'm in.\") and unrealistic expectations for the","future that can only result in disappointment.","*page_break","*if HP>70","  *goto E.T","*else","  *goto E.F","*label E.T","*set HP%+20","You are generally a happy person. I'm sure part of the reason for this is that you take life as it comes. This is an admirable and even enviable trait.","*finish","*label E.F","*if HP>50","  *goto F.T","*else","  *goto F.F","*label F.T","You are a moderately happy person. Perhaps a renewed emphasis on taking life one day at a time will make the rest of your life more enjoyable.","*finish","*label F.F","*set HP%+30","This is a very interesting choice, considering the fact that you are not a very happy person. Perhaps this choice represents a new outlook on life. If so, then good luck!","*finish","*label A21","*set HP%-10","*set CA%-20","Yes, this is a terrifying thought, but it is sometimes impossible to ignore. The signs of your advancing age are everywhere. You don't move as fast as you used to, there are assorted aches and pains, and you have seen more than one of","your friends pass on.","*page_break","On the other hand, things aren't THAT bad. One reason for the discomfort you are feeling is that you may be the type who thinks too far into the future. You are alive today, and chances are you will be alive tomorrow. Enjoy what you","can now, and you will be less preoccupied with your own mortality.","*finish","*label A22","*set CA%-30","As long as you are terrified, it is unlikely that you will do anything productive to get out of this frame of mind. One reason for the discomfort you are feeling is that you may be the type who thinks too far into the future. You are","alive today, and chances are you will be alive tomorrow. Enjoy what you can now, and you will be less preoccupied with your own mortality.","*finish","*label A31","*set HP%-20","If you are depressed, it is unlikely that you are able to ignore the thought. I can see why thinking about this can lead to depression. There is no telling what the world will be like 20 years from now. For all you know, it may turn out","to be the type of place that you wouldn't WANT to live in.","*page_break","On the other hand, 20 years from now medical and health sciences may find a way to prolong life. It's impossible to predict. People who get depressed have a tendency to ruminate upon the future. Look at it this way: you are here today,","and there is little reason to think that you will be gone tomorrow. Enjoy what you can now, and you will be less preoccupied with your own mortality.","*finish","*label A41","*set HP%+10","*set CA%+30","That is a pretty good trick. You must be the type of person who can completely blot unpleasant thoughts from your mind.","*page_break","It used to be believed that people who do this are unhealthy, but research is beginning to indicate that it can be healthy in some situations. It may indeed be healthy not to let yourself worry about things over which you have no control.","*finish","",""], "labels":{"a11":29,"a12":33,"b1":44,"a32":47,"b2":48,"c1":61,"d.t":66,"d.f":70,"c2":74,"c3":79,"e.t":88,"e.f":92,"f.t":97,"f.f":100,"a21":104,"a22":113,"a31":118,"a41":126}}