{"crc":-1019878111, "lines":["WARNING - THIS EPISODE CONTAINS SUBJECT MATTER OF A SEXUAL NATURE.","Do you wish to continue?","*choice","  #Yes","    *goto sexualEncounter","  #No","    *set instantaneous true","    *finish","*label sexualEncounter","You're sitting with ${loverName} in the living room. The lights are low, and the two of you are very cozy. ${loverName} begins to get VERY romantic, and you respond in kind. He explains that he would really like to make love with you, but doesn't have","any birth control. What will you do?","","","Select an action:","","*choice","  #SUGGEST THAT YOU SATISFY ONE ANOTHER WITHOUT HAVING INTERCOURSE","    *goto E1","  #TELL HIM TO RUN OUT AND GET SOME CONDOMS","    *goto E2","  #TELL HIM IT'S O.K. AS LONG AS HE PULLS OUT BEFORE EJACULATING","    *goto E3","  #TELL HIM YOU ARE SORRY BUT, \"NO.\"","    *goto E4","*label E1","*set TH%+20","*set SC%+10","That's a nice alternative. The two of you chose a safe, sensible way out of your dilemma. You have a very enjoyable time.","*finish","*label E2","*set TH%+20","After 35 minutes of searching, ${loverName} finally finds a drugstore that is open late. He purchases the condoms and rushes back. By this time, you have fallen asleep in the living room and do not answer the door!","*if LT>0","  *goto G.T","*else","  *goto G.F","*label G.T","${loverName} gets to sleep in the car tonight!","*finish","*label G.F","*set HP%-10","${loverName} drives home disappointed.","*finish","*label E3","*set TH%-30","*set SEX+1","Yes, of course -- and the moon is made of green cheese -- and one day flying pigs will break the sound barrier. Haven't you played this game long enough to know what could happen? Well, it doesn't.","*page_break","Luckily, the statistics are with you, and you don't become pregnant. In case you didn't know, pulling out is no guarantee that you will not get pregnant. This is true, by the way, regardless of which day of your menstrual cycle you are","in. There are NO 100% safe times.","*finish","*label E4","\"Here we go again,\" you think to yourself. ${loverName} tries to convince you, but you are determined.","*finish","",""], "labels":{"sexualencounter":8,"e1":24,"e2":29,"g.t":36,"g.f":39,"e3":43,"e4":51}}