{"crc":-778424707, "lines":["Mike Brady is always calling you names and stepping all over your nice shiny shoes. Today he is carrying a large bag of groceries from the store.","*choice mood action","  #MISCHIEVOUS","    #SEEK REVENGE","      *goto A11","    *selectable_if (false) #PAY NO ATTENTION TO \"STUPID BOYS\"","      *finish","  #ABSORBED IN MORE IMPORTANT THINGS","    *selectable_if (false) #SEEK REVENGE","      *finish","    #PAY NO ATTENTION TO \"STUPID BOYS\"","      *goto A22","*label A11","You think of two ways that you can get back at stupid Mike.","","","Select an action:","","*choice","  #RUN BY AND RIP THE BAG SO EVERYTHING FALLS OUT","    *goto B1","  #PUT YOUR FOOT OUT AND TRIP HIM AS HE WALKS BY","    *goto B2","*label B1","*set TH%-10","You take a big lead and start running toward him.","","*temp randomC","*rand randomC 1 2","*if randomC=1","  *goto C1","*else","  *goto C2","*label C1","*set CA%-30","Just before you get him, he moves away. You see him carefully remove an egg from the bag. Uh, oh...","*finish","*label C2","*set HP%+40","You rip open the bag and potatoes come rolling out all over the sidewalk. He is chasing them down the block. \"NICE MASHED POTATOES, BRADY!\" Revenge is sweet, but watch out. He just might have the last laugh by marrying you one day.","*finish","*label B2","*set GN%-20","*set PH%+5","THAT WAS MEAN! You could have hurt him like that. Fortunately, you didn't. He only bothers you because he has a crush on you. I know that is not important to you now, but later when he turns into a gorgeous hunk, you'll be wishing he'd","pay you some special attention.","*finish","*label A22","*set CN%+20","*set SC%+20","*set IN%+30","You have much more important things on your mind, like how to get Mom to let you join ballet, how to sneak in to see \"Friday the 13th Part 45,\" and why Mr. Johnson, the Biology teacher, wears the same set of clothes for ten days in","a row (GRODY!)","*finish","",""], "labels":{"a11":12,"b1":23,"c1":33,"c2":37,"b2":41,"a22":47}}