{"crc":1886397575, "lines":["You have just seen a fascinating movie about horses. They look so incredibly neat. Imagine just climbing up on top and riding around all day long. You could learn to jump and join competitions and shows. Or, you could just take care of it","and be its friend.","*choice mood action","  #EXCITED","    #BEG FOR A HORSE","      *goto A11","    #DROP HINTS ABOUT A HORSE","      *goto A12","    #KNOW YOU'LL NEVER GET A HORSE","      *goto A13","  #NEUTRAL","    *selectable_if (false) #BEG FOR A HORSE","      *finish","    #DROP HINTS ABOUT A HORSE","      *goto A22","    #KNOW YOU'LL NEVER GET A HORSE","      *goto A23","  #DEPRESSED","    *selectable_if (false) #BEG FOR A HORSE","      *finish","    *selectable_if (false) #DROP HINTS ABOUT A HORSE","      *finish","    #KNOW YOU'LL NEVER GET A HORSE","      *goto A33","*label A11","*set CA%-10","*set HP%+10","*if ST>0","  *goto B.T","*else","  *goto B.F","*label B.T","*set HP%-10","Your mother is the strict type. She asks you a million questions. \"Do you know how much CARE a horse requires?\"","*page_break","\"Do you know how EXPENSIVE horses are?\"","*page_break","\"Do you know how much horses eat? Haven't you ever heard the expression, 'eat like a horse'?\"","*page_break","\"Who is going to clean up after it?\"","*page_break","\"Who is going to wash it?\"","*page_break","\"The answer is NO!\"","*finish","*label B.F","*set FM%+20","*set HP%+10","*set CA%-10","*set CN%+10","You approach your mother and speak to her about owning a horse. She has always loved horses too. It's just that there is so much care that goes into owning a horse. She will have to discuss it with your father first.","*page_break","When your father returns from work, you can:","*label ASKDAD","","","Select an action:","","*choice","  #APPROACH THE SUBJECT DELICATELY","    *goto D1","  #BEG HIM","    *goto D2","  #KISS UP TO HIM","    *goto D3","*label D1","*label D2","*set SC%+10","*set CN%+10","You try the best you can to get your father into that \"let's run right out and buy a horse\" frame of mind, but he is in one of his practical moods. \"I'm sorry, Sweetheart, but if you like, we can go to Uncle Henry's farm this summer and","you can ride some of his horses.\"","*finish","*label D3","*if SC>70","  *goto E.T","*else","  *goto E.F","*label E.T","*set SC%+10","*set HP%+30","*set CN%+30","*set GN%+30","This is where those wonderful social skills really begin to pay off in a big way. Dad puts his hand under his chin and rubs it back and forth. He squeezes his cheeks together a few times. He takes out a pen, jots down a few numbers and","goes to speak to your mother.","*page_break","When he comes back, you can't tell whether or not you are getting a horse or not. He begins to speak. His eyebrows go inward towards each other. \"Guess what?\" he says.","*page_break","\"We're buying a horse!\"","*finish","*label E.F","*goto D2","*label A12","What kinds of hints would you like to drop?","","","Select an action:","","*choice","  #DRAW AND CUT OUT EVERY PICTURE OF A HORSE YOU CAN FIND AND PASTE IT ON THE WALLS","    *goto F1","  #BRING IT UP AT DINNER EVERY NIGHT","    *goto F2","  #ASK QUESTIONS ABOUT OWNING A HORSE","    *goto F3","*label F1","*set IN%+10","Very subtle. Your mother gets the hint but thinks your father is the one who should make the decision.","*goto ASKDAD","*label F2","*set GN%-10","*set FM%-10","Your mother turns to you and says, \"Can't you talk about anything else? A horse is out of the question.\"","","","Select an action:","","*choice","  #SAY,\"CAN I HAVE A PONY, THEN?\"","    *goto G1","  #SAY NOTHING","    *goto G2","*label G1","\"No, you cannot have a pony either.\"","*label G2","*finish","*label F3","*set IN%+20","At least you are going about this with intelligence. Both of your parents are willing to think about it, but it is your father's decision.","*goto ASKDAD","*label A13","*label A23","*set HP%+10","*set TH%+10","*set IN%+10","I guess DREAMING about a horse is better than nothing at all.","*finish","*label A22","By the tone in your voice, your parents don't think you are enthusiastic enough to take the responsibilities of owning a horse seriously. \"This is just another passing fad,\" they say.","*finish","*label A33","*set HP%-20","*set SC%-20","It's a shame that this is the way you have begun to approach life. You may not get everything you want, but how will you know unless you try? Would you like to change your mind and ask Dad to get you a horse?","","","Select an action:","","*choice","  #YES","    *goto K1","  #NO","    *goto K2","*label K1","*goto ASKDAD","*label K2","Suit yourself.","*finish","",""], "labels":{"a11":24,"b.t":31,"b.f":45,"askdad":53,"d1":65,"d2":66,"d3":72,"e.t":77,"e.f":89,"a12":91,"f1":104,"f2":108,"g1":121,"g2":123,"f3":125,"a13":129,"a23":130,"a22":136,"a33":139,"k1":152,"k2":154}}