{"crc":1303123050, "lines":["It's ten minutes until the bell rings for gym. Mrs. Black (otherwise known as Orca) can be such a pain with her calisthenics. Everyone is going to the mall after school, and the last thing you want to do is sweat like a horse. No","one will go near you. Imagine taking your shoes off in the shoe store and knocking out everyone in the place? Gross! This is going to take some quick thinking.","*choice mood action","  #HONEST","    #GO TO GYM CLASS","      *goto A11","    #TRY TO AVOID GOING TO GYM CLASS","      *goto A12","  #CREATIVE","    *selectable_if (false) #GO TO GYM CLASS","      *finish","    #TRY TO AVOID GOING TO GYM CLASS","      *goto A22","*label A11","*set TR%+10","*set SC%+10","As soon as you walk out onto the gym floor, you begin to sweat. It won't be long before people are looking at you and passing the word that you have B.O.","","","Select an action:","","*choice","  #TRY NOT TO DO TOO MUCH EXERCISING","    *goto B1","  #TAKE A SHOWER AFTER GYM CLASS","    *goto B2","*label B1","Mrs. Black spots you barely rocking back and forth in your place and calls you over.","*page_break","*label WEASEL","\"Whatsamatter with you?\" she says, menacingly.","","","Select an action:","","*choice","  #TELL HER THAT YOU HAVE AN INJURY","    *goto C1","  #TELL HER THAT YOU ARE HAVING YOUR PERIOD AND YOU DON'T FEEL WELL","    *goto C2","  #TELL HER THE TRUTH","    *goto C3","*label C1","\"If you have an injury, you should not have taken the class.\"","*page_break","She asks you if you have a doctor's note.","","","Select an action:","","*choice","  #LIE ABOUT THE NOTE","    *goto D1","  #TELL HER THAT YOU DON'T HAVE A NOTE","    *goto D2","*label D1","*set TR%-20","\"Is that so?\" Mrs. Black eyes you suspiciously. You're sure it must be your imagination, but you swear you can feel her hot, onion-breath breathing down your neck.","*page_break","*if TR>50","  *goto E.T","*else","  *goto E.F","*label E.T","Since you have been pretty trustworthy in the past, Mrs. Black has no reason to follow up your weak story about the note. You get away with it.","*finish","*label E.F","*set SC%-10","You have not exactly been the most trustworthy person in the past. Mrs. Black comments, \"Don't give me that. Get back in line and do fifty jumping jacks.\" By the time you are finished, you are absolutely dripping.","*finish","*label D2","*set HP%+20","\"Well next time, you had better get one. Physical education is one of the most important disciplines you are learning. Look at me. I may look a little heavy, but that's all in my genes. I am completely solid.\" (She pauses for a brief","coughing fit. Everyone KNOWS she smokes three packs of cigarettes a day.)","*page_break","You have to listen to a long-winded lecture, but by the time she's through, the bell has already rung.","*finish","*label C2","*set HP%-10","\"What's the matter with you, young lady? Don't you know that vigorous exercise is one of the best ways to get rid of those monthly cramps? Go over there and do fifty squat thrusts. You'll sweat the pain right out of you.\"","*finish","*label B2","Of course, you realize that there are no hair dryers or curling irons in the gym locker room. Do you still want to take a shower?","","","Select an action:","","*choice","  #YES","    *goto F1","  #NO","    *goto F2","*label F1","*set TR%+10","*set TH%+10","Your desire for cleanliness is admirable. You step under the shower and turn on the faucet. Three drops trickle out, and only one actually touches you.","","","Select an action:","","*choice","  #TURN THE HANDLE SOME MORE","    *goto G1","  #FORGET ABOUT IT","    *goto G2","*label G1","A stream of icicles runs right down your back, chilling you to the bone. Your skin and lips turn bright blue. You want to get out of there as soon as possible, so you quickly search for the soap.","*page_break","There is a small speck of soap that would barely clean a flea. Discouraged, you step out of the shower and begin to dry off. Just as you are about to walk back to your locker, A BIG SLIMY COCKROACH CRAWLS OUT AND WALKS RIGHT BY YOU!","*finish","*label G2","*label F2","*set CA%-20","You spend the rest of the day walking around with your head under your armpits, checking for B.O..","*finish","*label A22","*set TR%-30","You think of several excuses, but illnesses and injuries seem to be the most likely ways to get out of going to gym class. You approach Mrs. Black with a look of (false) pain and woe that she has seen a million times before.","*goto WEASEL","*label A12","*label C3","*set TR%+20","Mrs. Black looks at you in disbelief and yells, \"WHAT DO YOU MEAN YOU DON\"T WANT TO GET TOO SWEATY BECAUSE YOU HAVE TO GO SHOPPING? GET GOING!\"","*finish","",""], "labels":{"a11":13,"b1":26,"weasel":29,"c1":42,"d1":55,"e.t":63,"e.f":66,"d2":70,"c2":77,"b2":81,"f1":92,"g1":105,"g2":110,"f2":111,"a22":115,"a12":119,"c3":120}}