{"crc":-756154470, "lines":["WARNING - THIS EPISODE CONTAINS SUBJECT MATTER OF A SEXUAL NATURE.","Do you wish to continue?","*choice","  #Yes","    *goto sexualEncounter","  #No","    *set instantaneous true","    *finish","*label sexualEncounter","*if (SC>60) and (MS<1)","  *goto B.T","*else","  *goto B.F","*label B.F","This episode is not appropriate for you right now. Married folks or those with no social skills will either have to get divorced (not worth it!) or shape up to play. You can try again later.","*comment @NTQ","*set instantaneous true","*finish","*label B.T","Dave, a great-looking male friend, has asked if you would like to spend the night in his room. Are you ready for a night of romance?","","","Select an action:","","*choice","  #YES","    *goto Z1","  #NO","    *goto Z2","*label Z2","*finish","*label Z1","*comment @SEX,Dave","*comment @SEX","*set sex +1","*comment If not dating, this person becomes an ex-lover.","*if GF != 1","  *set loverName \"Dave\"","  *rand NT 20 80","  *rand NG 20 80","  *rand NC 20 80","  *rand NF 20 80","  *rand NH 20 80","  *rand NA 20 80","The last thing you remember before dozing peacefully off is, \"was it as good for you as it was for me?\" Then...","*page_break","You are awakened by a loud ring of the telephone. HIS PARENTS ARE AT THE DESK DOWN THE HALL AND THEY ARE COMING RIGHT IN!","","","Select an action:","","*choice","  #PANIC BUT TRY TO LOOK NATURAL","    *goto C1","  #PANIC AND TRY TO MAKE IT LOOK LIKE YOU ARE PREPARING BREAKFAST","    *goto C2","  #TRY TO GET DRESSED, MAKE THE BED AND LOOK LIKE YOU HAVE BEEN AWAKE FOR HOURS","    *goto C3","  #GET DRESSED BUT DON'T PANIC; LET THEM SEE YOU AS YOU ARE","    *goto C4","  #STAY IN BED","    *goto C5","*label C1","*set CA%-10","His parents come up and notice that the room has a very musky smell to it. His mom recognizes it as the smell of fulfilled desires. She narrows her glance in your direction.","","","Select an action:","","*choice","  #LIE ABOUT THE SMELL","    *goto D1","  #MENTION THAT YOU WERE AN OVERNIGHT GUEST","    *goto D2","*label D1","*set TR%-10","Oh, the story about practicing your aerobics class together was very amusing. Now, how do you explain that pair of skimpy black panties peeking out from under the pillow?!","*finish","*label D2","*temp randomE","*rand randomE 1 2","*if randomE=1","  *goto E1","*else","  *goto E2","*label E1","For SHAME! \"Is THIS what you are going to college for?\" they wonder. How do you think it feels for parents to come into their own child's room and be hit over the head with the evidence of their son's sexual exploits?","*page_break","Their visit is ruined. But they'll get over it.","","They came on their own -- next time they will probably give you fair warning. Dave apologizes for the commotion and looks like he's ready to start round two...","*finish","*label E2","His parents are just as embarrassed as you are. For a few moments the visit is awkward. It was a nice sentiment for them to come visit their son, but next time they will probably give more warning before popping over.","*finish","*label C2","*set TR%-10","Oh. They wonder if everyone who comes over wears their son's football shirt as attire.","*finish","*label C3","*set TR%-10","Nice try, except for one thing -- you forgot to take Dave out of the bed before making it! He is the big lump to the left of the gym shorts.","*finish","*label C4","*set TR%+20","That is very honest of you. I wonder how his parents will take it...","*page_break","*goto D2","*label C5","*set TH%-30","*set SC%-20","That might have been an acceptable response in the 60's, but we've gotten much more inhibited again since then. It is unlikely that even the most well-adjusted parents will see this kind of behavior as anything but rude and","inappropriate. They say a quick \"hello\" and \"goodbye.\"","*finish","",""], "labels":{"sexualencounter":8,"b.f":13,"b.t":18,"z2":29,"z1":31,"c1":62,"d1":74,"d2":78,"e1":85,"e2":92,"c2":95,"c3":99,"c4":103,"c5":108}}