{"crc":-1587009852, "lines":["WARNING - THIS EPISODE CONTAINS SUBJECT MATTER OF A SEXUAL NATURE.","Do you wish to continue?","*choice","  #Yes","    *goto sexualEncounter","  #No","    *set instantaneous true","    *finish","*label sexualEncounter","Your mother calls you in for a talk about something she says is \"very very important.\" She thinks that it might be a good time to go for a checkup with a \"gynecologist,\" a doctor who specializes in women.","*choice mood action","  #AFRAID","    #GO FOR AN EXAM","      *goto A11","    #DON'T GO FOR AN EXAM","      *goto A12","  #COMFORTABLE","    #GO FOR AN EXAM","      *goto A21","    *selectable_if (false) #DON'T GO FOR AN EXAM","      *finish","*label A11","*set CA%-20","She makes an appointment for you and says she will drive you there.","*page_break","*label A21","On the way over, Mom explains to you, \"It's a little embarrassing at first, but he really is a gentle doctor.\" You dwell for a moment on the word \"he,\" and realize that a man is going to see and \"mess around with\" all of your most","intimate parts.","","","Select an action:","","*choice","  #CHANGE YOUR MIND AND TELL HER YOU DON'T WANT TO SEE A MAN DOCTOR","    *goto B1","  #GO ANYWAY","    *goto B2","*label B1","*set CA%-10","She tells you, \"Don't worry. He's fine. Besides, you've already met him. He helped deliver you.\"","","","Select an action:","","*choice","  #STILL REFUSE","    *goto C1","  #GO ANYWAY","    *goto C2","*label C1","*set CA%+10","*set HP%+10","Your mother sees how frightened you look and offers to try to help you find a woman gynecologist. I guess you feel relieved.","*finish","*label B2","*label C2","*set CA%+10","*set PH%+20","The gynecologist is a very sweet old man. Most of the time you spend naked is with a nurse who helps prepare you for the exam. The doctor is kind enough to warm up the instruments before he examines you.","*page_break","When the examination begins, he shows you various different parts of your reproductive system and teaches you how to give yourself a breast examination, which he says is very important.","*page_break","He asks your mother if she would be kind enough to leave the room. When she does, he asks you whether you are sexually active and if you are using birth control. He then asks if you would like more information about birth control.","","","Select an action:","","*choice","  #GET MORE INFORMATION","    *goto D1","  #SAY, \"NO.\"","    *goto D2","*label D1","When the two of you are alone, the doctor gives you the facts on both male and female birth control methods and tells you to call him if you would like to talk to him more about it. You probably don't realize it now, but he happens to be","an excellent doctor.","*finish","*label D2","He sees that you are feeling a bit uncomfortable and tells you that if you ever need information about birth control to give the office a call. He leaves you with a little warning. \"Don't experiment before you get the facts, young lady.\"","*finish","*label A12","*set CA%+10","Your mother sees how frightened you are and offers to let it wait for just a little bit longer.","*finish","",""], "labels":{"sexualencounter":8,"a11":21,"a21":25,"b1":37,"c1":49,"b2":54,"c2":55,"d1":72,"d2":76,"a12":79}}