{"crc":-1023850023, "lines":["A wild driver cuts you off on the highway.","*choice mood action","  #FURIOUS","    #GO AFTER HIM FOR REVENGE","      *goto A11","    #LET HIM GO","      *goto A12","  #ANGRY","    #GO AFTER HIM FOR REVENGE","      *goto A21","    #LET HIM GO","      *goto A22","  #CALM","    #GO AFTER HIM FOR REVENGE","      *goto A31","    #LET HIM GO","      *goto A32","*label A11","You cut him off and slam on the brakes. This makes him go berserk. He pulls up alongside your car and shakes his fist at you. The man in the car is thin and wiry and looks like he hasn't shaved in days. He has a VERY crazy look in his eyes.","","","Select an action:","","*choice","  #GIVE HIM THE FINGER AND DRIVE AWAY","    *goto B1","  #START SCREAMING AT HIM","    *goto B2","  #JUST DRIVE AWAY","    *goto B3","*label B1","*set CA%-30","He chases after you and begins trying to push your car off the road. You have gotten yourself entangled with someone who is emotionally disturbed. The car you are driving is now dented and scraped on the passenger side.","*page_break","You approach a concrete overpass. The maniac bumps you toward it. You notice that he is waving a gun out the window. If you stop he will probably try to shoot you. If you try to get away, he will force you into the bridge abutment. What","do you want to do?","","","Select an action:","","*choice","  #STOP","    *goto C1","  #TRY TO OUTRUN HIM","    *goto C2","*label B2","*label C1","He pulls off onto the shoulder next to you and starts shouting. He points the gun toward the car, pulls the trigger and you hear a loud CRACK!","","*temp randomD","*rand randomD 1 2","*if randomD=1","  *goto D1","*else","  *goto D2","*label D1","Glass shatters everywhere. It's in your hair and eyes. Two more shots follow as he blows out your tire. He looks you right in the eye, reaches in the window and pulls the sleeve of your blouse. He sneers, \"Bitch.\"","*page_break","It looks as if he might try to kill you, but then he laughs and runs back to his car. He drives away. As you see his car disappear into the distance, you jot down the license number.","","","Select an action:","","*choice","  #CALL THE POLICE","    *goto X1","  #DO NOTHING","    *goto X2","*label X1","The car was stolen. They have no other clues.","*label X2","*finish","*label D2","*set TH%-30","It is only a toy gun. The man laughs wildly, gets back on the road and begins driving in the opposite direction. The moral of the story: It does not pay to mess with crazy people.","*finish","*label C2","No chance. He bumps you off the road. The scream of the tires skidding across the highway is interrupted by a resounding explosion and the sounds of shattering glass. As you hit the concrete overpass, the car explodes and burns. You are","burned to death. This game is over.","*goto_scene you_have_died","*label A32","*label A12","*label A22","*label B3","*set TH%+30","This person is a crazy man. He had a gun and would have tried to kill you if you had messed with him. You were smart to hold your temper, even though you would have liked to run him off the road.","*finish","*label A21","You chase him and begin to weave in and out of traffic. The two of you are driving very dangerously.","","","Select an action:","","*choice","  #STOP IT","    *goto E1","  #KEEP GOING UNTIL YOU GET THE BASTARD","    *goto E2","*label E1","*set TH%+10","A wise choice. Innocent people could have gotten hurt by the way you were driving.","*finish","*label E2","The guy in the other car swerves in front of a car driven by an elderly woman. You pull alongside him, cursing and threatening him. The elderly woman realizes what is happening and becomes frightened. She steps on the brake a bit too","hard and slides off the road. She hits her head on the steering wheel and passes out.","","","Select an action:","","*choice","  #GO BACK AND TRY TO GET ASSISTANCE FOR HER","    *goto F1","  #KEEP GOING AFTER THE GUY IN THE CAR","    *goto F2","  #JUST DRIVE","    *goto F3","*label F1","*set TH%-40","Fortunately, she has just been shaken up.","","You behaved in a very irresponsible way, without regard for the health and safety of others. You should be ashamed of yourself for showing such poor judgment.","*finish","*label F2","*set TH%-60","*set TR%-20","*set SC%-40","*set MN-2000","*if MN < 5","  *set MN 5","You are spotted by the police and are arrested for reckless driving. In addition, the elderly woman, whom you caused to slide off the road, sues you for damages. You lose your license and $2000 in Resources.","*finish","*label F3","*set TH%-60","*set SC%-70","*set TR%-70","Is hurting an elderly woman what it takes to get you to think sensibly? You might have killed her, you know. You'll never find out if she regained consciousness. Have a pleasant night's sleep.","*finish","*label A31","*set TH%-70","*set TR%-60","*set SC%-70","Anyone who would choose this response pattern is potentially very dangerous. In this frame of mind you could calmly and easily drive him off the road and into a concrete divider, killing him. Fortunately, a state trooper has seen the","incident and pulls up alongside you.","*page_break","You can't go through with your plan without getting caught, so for now you abandon it.","*finish","",""], "labels":{"a11":17,"b1":30,"b2":45,"c1":46,"d1":55,"x1":68,"x2":70,"d2":72,"c2":76,"a32":80,"a12":81,"a22":82,"b3":83,"a21":87,"e1":98,"e2":102,"f1":116,"f2":122,"f3":131,"a31":137}}