{"crc":-1524962041, "lines":["You are lying on a soft, furry blanket on the floor of a big room. You are on your back staring at shadows that sometimes creep across the ceiling. Every so often Mom or Dad passes by and makes a funny face. Your hands grope in all","directions, and your feet pat the floor gently, almost out of your control.","*choice mood action","  #HAPPY","    #ROLL TO SIDE","      *goto A11","    #MAKE AN \"O\" SHAPE WITH YOUR MOUTH","      *goto A12","    *selectable_if (false) #CRY","      *finish","  #SAD","    #ROLL TO SIDE","      *goto A21","    #MAKE AN \"O\" SHAPE WITH YOUR MOUTH","      *goto A22","    #CRY","      *goto A23","  #MAD","    #ROLL TO SIDE","      *goto A31","    #MAKE AN \"O\" SHAPE WITH YOUR MOUTH","      *goto A32","    #CRY","      *goto A33","*label A11","*set HP%+10","*set PH%+10","This maneuver is a little too difficult to accomplish at your present age. You can roll about half-way to one side.","*finish","*label A12","*set HP%+10","You pucker your cheeks in and out and take short, quick breaths. The skin on your face feels alternately tight and loose. A person walks by and twirls their fingers at you.","","","Select an action:","","*choice","  #TURN TOWARD THE PERSON","    *goto B1","  #MOVE YOUR FACE BACK AND FORTH","    *goto B2","*label TURN","*label B1","You are too young to keep the person in view for a long time. Whoever it is, he moves past in a blur.","*finish","*label FACE","*label B2","*set SC%+30","Your first SMILE! An important event. Your parents stand over you, mesmerized, as you practice your new skill.","*finish","*label A21","*set HP%-10","I guess you are not feeling very cheerful. Unfortunately, your physical development is not yet to the point where you can roll over and give people the cold shoulder. You stare at the ceiling until you fall asleep.","*finish","*label A22","*set HP%+20","*set PH%+20","Even though you are in a bad mood, this seems like great fun! Your mood takes a turn for the better. Someone walks by. You think, \"Hey! Here I am!\"","","","Select an action:","","*choice","  #TURN TOWARD THE PERSON","    *goto C1","  #MOVE YOUR FACE BACK AND FORTH","    *goto C2","*label C1","*goto TURN","*label C2","*goto FACE","*label A23","Poor baby. Your crying attracts the attention of your parents who bring you over to the couch and cuddle you until you fall asleep.","*finish","*label A31","*set GN%-10","You must be thinking, \"Get me off this cold hard floor!\" Unfortunately, you aren't strong enough to roll over yet. You grunt and groan, cry for a few minutes, then fall asleep.","*finish","*label A32","You're still too young to talk, but you make some noises. (\"Ooooo, oooooooh, aaaaaaah, aaaaaaaak.\") This brings some attention and a brief lift from the cold floor.","*finish","*label A33","*set GN%-10","You think, \"GET ME OFF OF HERE!\" and \"I WANT FOOD!\" Babies your age have no control over their impulses. Your cries are a sign of discontent. Whatever happened to that nice warm swimming pool you used to relax in?","*finish","",""], "labels":{"a11":24,"a12":29,"turn":41,"b1":42,"face":45,"b2":46,"a21":50,"a22":54,"c1":67,"c2":69,"a23":71,"a31":74,"a32":78,"a33":81}}