{"crc":687717992, "lines":["*if AG < 16","  Sorry, you're still too young for this experience.  Come back later.","  *set instantaneous true","  *finish","*elseif AG > 19","  Sorry, you're too old for this experience.","  *finish","${loverName} has just won an all-expenses-paid trip for two to a fantastic ski resort in Vermont. He has invited you to go along with him. There is only one problem--your parents absolutely refuse to allow you to take an overnight trip with","anyone of the opposite sex. What will you do?","","","Select an action:","","*choice","  #LIE TO YOUR PARENTS AND GO ANYWAY","    *goto A1","  #ARGUE WITH YOUR PARENTS WITH ${LOVERNAME} THERE FOR SUPPORT","    *goto A2","  #SIT DOWN WITH YOUR PARENTS AND TRY TO HAVE AN ADULT CONVERSATION ABOUT IT","    *goto A3","  #TELL ${LOVERNAME} IT'S NOT WORTH THE TROUBLE; HE SHOULD GO ALONE","    *goto A4","*label A1","*set TR%-20","*set FM%-5","The skiing is marvelous, and except for the fact that you might feel a little guilty, the two of you are having an enjoyable romantic time.","*page_break","On the second day of your vacation, ${loverName} tells you that he is going down to the ski shop to pick up the skis that he won as part of the package. He will ring the phone when he is finished, so the two of you can take a whirlpool bath","together. About an hour passes before the phone rings. You are a bit sleepy from relaxing.","","","Select an action:","","*choice","  #PICK UP THE PHONE","    *goto B1","  #LET THE PHONE RING/YOU KNOW WHO IT IS","    *goto B2","*label E1","*label B1","*temp randomC","*rand randomC 1 2","*if randomC=1","  *goto C1","*else","  *goto C2","*label C1","It's ${loverName}. You go down and have your whirlpool bath together, and it is very romantic. The two of you finish your vacation, come home, and no one ever finds out what you did.","*temp randomD","*rand randomD 1 2","*if randomD=1","  *goto D1","*else","  *goto D2","*label D1","*finish","*label D2","*page_break","*set CA%-10","That is, until ${loverName} accidently leaves some photos of the lodge around the house. One shows a pile of clothing, on top of which rests a bra and a pair of black lace panties, which just happen to be a bit too kinky to belong to one of","${loverName}'s male buddies.","*finish","*label C2","*set CA%-20","*set SC%-10","You lift up the phone and say, \"Hi, gorgeous, did you get something nice?\"","","\"DON'T 'HI, GORGEOUS' ME! WHERE ARE YOU?\" It's Dad. You both have a lot of explaining to do when you get back.","*finish","*label B2","What's the matter with you? Do you want ${loverName} to think something has happened to you?","","","Select an action:","","*choice","  #ANSWER THE PHONE","    *goto E1","  #LET IT RING","    *goto E2","*label E2","*set IN%+30","You were too smart to be fooled. That was really your Dad doing some amateur detective work.","*finish","*label A2","*set TH%-20","*set GN%-10","Whether you realize it or not, you have put ${loverName} in a very difficult position. He really wants to take you along on the trip, but at the same time, he doesn't want your family to hate him, either. He winds up just standing next to you","looking kind of dumb.","*finish","*label A3","*set TR%+30","*set TH%+10","*set EX%+40","You have decided to confront them honestly. Your dad appreciates this. He answers you with the same honesty. He doesn't trust ${loverName} alone in the same room as you. He thinks the two of you will have sex.","*page_break","You mention that if you wanted to have sex, it would be much easier to go some place closer to home, like a local motel. You are proud of yourself for winning points in the logic department.","*page_break","Dad says, \"Very true, very true,\" then gets a very sinister look on his face and continues, \"Just about the only difference, young lady, is that if you did something like that close to home, and I found out about it, I would not","be inconvenienced by having to travel far to find you and beat your boyfriend to a pulp.\"","*finish","*label A4","*set GN%+20","*set TH%+40","That was very sensitive of you. You feel that stirring up a conflict now would only spoil the trip for ${loverName}. If the two of you stay together and eventually get married, you will have plenty of opportunity to travel together.","*finish","",""], "labels":{"a1":22,"e1":38,"b1":39,"c1":46,"d1":54,"d2":56,"c2":62,"b2":69,"e2":80,"a2":84,"a3":90,"a4":101}}