{"crc":613322988, "lines":["Your mother has given you permission to have a party. You want to invite most of the kids from your class. There is one child that you have second thoughts about inviting. Her name is Louise Feiback. All of the kids call her \"Louise","Feedbag\" because she is very fat.","*page_break","You mention to your group of friends that you are thinking about inviting Louise. They make faces and pig noises. Some of them say that, if you invite \"The Bag,\" they will stay home.","*choice mood action","  #AMBIVALENT/MIXED FEELINGS","    #INVITE LOUISE","      *goto A11","    #DO NOT INVITE LOUISE","      *goto A12","  #PRESSURED BY PEERS TO GIVE IN","    *selectable_if (false) #INVITE LOUISE","      *finish","    #DO NOT INVITE LOUISE","      *goto A22","  #ANGRY","    #INVITE LOUISE","      *goto A31","    *selectable_if (false) #DO NOT INVITE LOUISE","      *finish","*label A11","When you ask Louise to come to your party, she immediately assumes that you are joking and want to make fun of her.","","","Select an action:","","*choice","  #USE THIS AS AN EXCUSE TO CALL HER A JERK AND DON'T INVITE HER","    *goto B1","  #TRY TO CONVINCE HER","    *goto B2","*label B1","*set SC%-20","*set GN%-10","Sure! Take the easy way out. Resolve your ambivalence by putting the guilt on Louise. Can you blame her after the way she has been treated?","","Everyone has a great time at your party. Louise stays home that night, cries, and eats to fill the emptiness of having no friends.","*finish","*label B2","*set SC%+40","*set HP%+20","Louise is completely overjoyed. This is the first time she has ever felt like part of \"the group.\" Some of your friends do stay home that night and refuse to speak with you at school. Louise's mother calls you up and thanks you for","being so generous.","*page_break","Louise's mother also happens to be extremely rich. On your next school vacation, she flies you and Louise to Hawaii for a week to stay with relatives there. Aloha!","*finish","*label A22","*label A12","*set GN%-20","Louise has heard from other people in school that you were thinking about inviting her. Although she was prepared for rejection (it has happened so many times she could expect nothing else), there was still a glimmer of hope. She spends","the night of your party crying and eating to fill up the emptiness of having no friends.","*finish","*label A31","*set SC%+30","*set CN%+40","You call the kids who don't want her there a bunch of jerks and threaten to throw out anyone who makes fun of Louise at your party. You have shown courage and tolerance for individual differences, and this has made you stronger.","*page_break","*goto B2","",""], "labels":{"a11":20,"b1":31,"b2":38,"a22":46,"a12":47,"a31":52}}