{"crc":654128594, "lines":["You are having some very important guests over for dinner, and you would like everything to be \"just so.\"","*choice mood action","  #CONFIDENT","    #PREPARE A MARVELOUS DINNER","      *goto A11","    #SEND OUT FOR DINNER / HIRE A CATERER","      *goto A12","  #ANXIOUS","    #PREPARE A MARVELOUS DINNER","      *goto A21","    #SEND OUT FOR DINNER / HIRE A CATERER","      *goto A22","*label A11","*set CN%+30","You realize that preparing the correct kind of hors d' oeuvre can set the tone for the entire meal.","","","Select an action:","","*choice","  #CREATE AN INTRICATE HORS D' OEUVRE","    *goto B1","  #PUT OUT SOME CHEESE AND CRACKERS","    *goto B2","*label B1","*label A21","*set TH%+10","*set CA%-20","You labor over some exotic hors d'oeuvres that bring rave reviews from your guests, who marvel at your culinary talents.","*if EM>0","  *goto E.T","*else","  *goto E.F","*label E.T","Mrs. Andrews says, \"My, My. I don't understand where you get your energy. You do such a fine job with cooking and you work during the day as well. You should be very proud of yourself.\"","*label E.F","*page_break","Relieved that the first part of the evening has gone along so smoothly, you rush into the kitchen to bring out the main course.","*page_break","You are horrified to realize that with all of the attentiion you have given to the hors d' oeuvres, you completely forgot to begin preparing the main course!","","","Select an action:","","*choice","  #CALL OUT FOR FOOD/HIDE IT FROM YOUR GUESTS","    *goto C1","  #TELL YOUR GUESTS ABOUT YOUR DILEMMA","    *goto C2","*label C1","*set TH%-10","*set SC%-20","The only thing open that will deliver is a southern fried chicken establishment which prepares everything in a greasy gravy. Do you want to order some?","","","Select an action:","","*choice","  #YES","    *goto D1","  #NO","    *goto D2","*label D1","*set SC%-20","Your guests eat the chicken but can't understand the discrepency between the two courses. They assume you called out for the appetizers. Your furniture gets grease stains all over it.","*finish","*label D2","*label C2","*set SC%+30","You are amazed to see how understanding your guests are. One person offers to go out for Chinese food. Another runs to the all-night deli and rustles up some vegetable salads and dessert. Sometimes a gaffe such as the one you made makes","people tune in to their own frailties. Everyone has a great time. Social sphere increases.","*finish","*label B2","*set SC%-10","The cheese and crackers are a flop, and so is the dinner!","*finish","*label A12","*label A22","*if EM>0","  *goto E2.T","*else","  *goto E2.F","*label E2.T","*set SC%+20","The guests enjoy the food. They think that it was practical for you to hire a caterer, because you work so hard during the day. The evening is a moderate social success.","*finish","*label E2.F","*set SC%-20","The guests gossip about the fact that you do not work, yet you spend your husband's money on catering when you have guests over. They enjoy the meal, but socially you are a flop.","*finish","",""], "labels":{"a11":12,"b1":24,"a21":25,"e.t":33,"e.f":35,"c1":49,"d1":62,"d2":66,"c2":67,"b2":72,"a12":76,"a22":77,"e2.t":82,"e2.f":86}}