{"crc":-2033896076, "lines":["Mom has just taken a job that requires her to be away in the morning and early afternoon. She decides to enroll you in a nursery school program. When you get there, you are greeted by a lady with very skinny legs and large, round glasses.","*page_break","There are children playing with buckets of sand, building blocks and toys. There is a small girl sitting in a corner with tears streaming from her eyes. She has a runny nose, and red cheeks from crying.","*choice mood action","  #EXCITED","    *selectable_if (false) #CRY","      *finish","    #WALK OVER AND TRY TO MAKE FRIENDS","      *goto A12","    *selectable_if (false) #GIVE THE LADY WITH THE SKINNY LEGS A KICK","      *finish","  #SAD","    #CRY","      *goto A21","    *selectable_if (false) #WALK OVER AND TRY TO MAKE FRIENDS","      *finish","    *selectable_if (false) #GIVE THE LADY WITH THE SKINNY LEGS A KICK","      *finish","  #ANGRY","    *selectable_if (false) #CRY","      *finish","    *selectable_if (false) #WALK OVER AND TRY TO MAKE FRIENDS","      *finish","    #GIVE THE LADY WITH THE SKINNY LEGS A KICK","      *goto A33","*label A12","*set SC%+20","Your excitement is a positive sign. You are trying to adapt to a new environment. You realize that your mom will be coming back, so you attempt to make friends. In the sandbox you see a little boy your age playing with a bucket and a red","shovel. What would you like to say to him?","","","Select an action:","","*choice","  #\"HI!\"","    *goto B1","  #\"CAN I PLAY?\"","    *goto B2","*label B1","*set SC%+10","The little boy ignores you. You are a newcomer to the social order of the nursery school. You are invading his territory. Your attempts at being sociable show potential, however. At very young ages, children are more likely to play","BESIDE one another than WITH one another.","*finish","*label B2","The little boy interprets this as a threat to his territory. He holds the toys close to his body. You can:","","","Select an action:","","*choice","  #IGNORE HIM","    *goto C1","  #ASK HIM TO PLAY","    *goto C2","*label C1","In time this boy might respond to you, but you are still too new and too threatening. Giving him space is likely to stimulate his curiosity about you. By next week you will be playing nicely. You will have made a new friend.","*finish","*label C2","The boy shakes his head back and forth. He wants no part of you.","*finish","*label A21","*set HP%-20","Mommy has some nerve, getting a job and palming you off on this nursery school! The lady with the skinny legs tries to calm you down. You can:","","","Select an action:","","*choice","  #KEEP CRYING","    *goto D1","  #ADJUST TO THE SITUATION","    *goto D2","*label D1","The more she tries to \"shhhh\" you, the louder you wail. Every once in a while you let out a heart-wrenching, \"Maaaaaaaaaa!\" for dramatic effect. Nicely done. You can:","","","Select an action:","","*choice","  #KEEP CRYING","    *goto F1","  #ADJUST TO THE SITUATION","    *goto F2","*label F1","*set HP%+10","*set SC%+10","The lady with the skinny legs has nerves of steel. Her ability to withstand the crying is greater than your energy to keep crying. Her secret is that she is extremely hard of hearing. You are eventually put next to a cry-baby boy, where","you can be free to exchange techniques.","*finish","*label F2","*label D2","*label E1","After you calm down, you realize that this really isn't so bad after all. For the rest of the day you keep yourself busy. When Mom comes back, you act as if you've barely missed her at all.","*finish","*label A33","*set GN%-30","*set PH%+20","What a nasty little girl! I'll bet you chose this because you thought you might hit her. She avoids your kick and places you firmly on the floor. Next, she reads you the riot act. You WILL behave appropriately. There will be NO kicking.","Misbehavior will be dealt with severely. This lady is all business. They don't call her \"Old Ironshins\" for nothing!","*finish","",""], "labels":{"a12":25,"b1":38,"b2":43,"c1":54,"c2":57,"a21":60,"d1":72,"f1":83,"f2":89,"d2":90,"e1":91,"a33":94}}