{"crc":-568821198, "lines":["A few people got a little wild playing \"spin the bottle\" at a friend's house yesterday. As a result, your neck looks like it was stung by a pack of wild hornets. As you walk out of the bathroom, Mom inquires about the curious-looking","marks.","*choice mood action","  #EMBARASSED","    #GIVE AN EXCUSE","      *goto A11","    #TELL THE TRUTH","      *goto A12","  #CRAFTY","    #GIVE AN EXCUSE","      *goto A21","    *selectable_if (false) #TELL THE TRUTH","      *finish","  #OUT OF IT","    #GIVE AN EXCUSE","      *goto A31","    *selectable_if (false) #TELL THE TRUTH","      *finish","*label A11","What excuse would you like to give? You can:","","","Select an action:","","*choice","  #SAY, \"I GOT STUNG BY A GROUP OF WILD HORNETS.\"","    *goto B1","  #SAY, \"I GOT MY NECK CAUGHT IN A PIECE OF JEWELRY.\"","    *goto B2","  #SAY, \"I GOT MY NECK CAUGHT IN A VACUUM.\"","    *goto B3","*label B1","*if FM>60","  *goto C.T","*else","  *goto C.F","*label C.T","You come from an understanding family. Mom offers to lend you some of her \"hornet repellent,\" and gives you a look that means \"Don't get yourself into trouble, young lady.\"","*finish","*label B2","*if FM>60","  *goto D.T","*else","  *goto D.F","*label D.T","*set FM%+20","Family relations are good right now. Mom looks at you with a fake-serious expression and says, \"You were lucky to have survived it.\"","*goto WATCH","*label B3","*if FM>60","  *goto E.T","*else","  *goto E.F","*label E.T","*set FM%+20","Family relations are good right now. Mom looks at you with a fake-serious face and says, \"Yeah, those things are a real menace to society. Thank goodness you came out of it in one piece!\"","*label WATCH","*page_break","She looks at you with an expression that means, \"You had better watch yourself, young lady.\" Sometimes parents don't have to say a lot to say a lot, if you know what I mean.","*finish","*label E.F","*label D.F","*label C.F","*set FM%-20","Your relationship with your family really isn't so great these days. The tensions cause Mom to snap at you. She says, \"Don't give me that line of bull, young lady. I know a hickey when I see one.\"","*page_break","At the end of her lecture, she reminds you about the dangers of premarital sexual contact, listing a host of exotic diseases and their symptoms in excruciating detail.","*finish","*label A12","*if FM>60","  *goto F.T","*else","  *goto F.F","*label F.T","Family relations are good. Your truthfulness makes them even better. Mom knows where you got the mark and might even have been embarrassed when she asked. Even though she trusts you, she feels the responsibility of keeping you out of","trouble as much as possible.","*page_break","These talks will probably never prevent you from doing what you really want to do, but they can make you think twice about some things.","*finish","*label F.F","*set FM%-10","Family relations are not that strong right now. Unfortunately, when this is the case, sometimes not even the truth helps. You get a lecture on morality, complete with a description of the latest venereal diseases, their causes and","symptoms.","*page_break","Did you know that by getting a hickey you can get a blood clot which can go to your BRAIN and KILL you? She finishes with, \"Listen, I know how it is to be your age. I'm just looking out for you.\" Do you wish you had given her an excuse","now?","","","Select an action:","","*choice","  #YES","    *goto G1","  #NO","    *goto G2","*label G1","*set FM%-10","*set TR%+20","Even though parents want their children to be truthful and honest at all times, Mom did the very thing that inspires deceit. She got angry and then lectured you. She concentrated on that stupid hickey, rather than on the fact that you","were straightforward with her. Remember this for later when you have teen-aged children of your own!","*finish","*label G2","*set TR%+30","In this instance you show more understanding for the people who are raising you than they show for you. Bravo!","*finish","*label A21","You must really think Mom was born yesterday. When she was your age, she once got quite a hickey (from your father). Whatever excuse you think of only makes her feel angry that you would take her for such a fool.","*page_break","An argument ensues, and you get a boring lecture about the potential dangers of the dreaded hickey (\"...it can create a blood clot that can go to your brain and kill you, bla, bla, bla...\"). Even though it happens to be true, you","probably don't pay too much attention to it.","*finish","*label A31","*set GN%-10","*set EX%-20","You have chosen a well-tested and time-honored adolescent defense to avoid talking about something that might be anxiety-provoking. Putting yourself up in the clouds makes you inaccessible to either real or imagined dangers.","*page_break","It works fine but has only one drawback -- while you are flying around up in the sky, your real feelings are driven deep inside you. They can surface at a time when they might catch you off-guard. As a result, you may get suddenly","depressed.","*finish","",""], "labels":{"a11":18,"b1":31,"c.t":36,"b2":39,"d.t":44,"b3":48,"e.t":53,"watch":56,"e.f":60,"d.f":61,"c.f":62,"a12":68,"f.t":73,"f.f":79,"g1":95,"g2":101,"a21":105,"a31":111}}