{"crc":1417105183, "lines":["Your dad's boss thinks that you are a fine young woman. He would be honored if you would consider attending the company dinner with his son, Matt.","*choice mood action","  #SUSPICIOUS","    #ACCEPT THE INVITATION","      *goto A11","    #MAKE AN EXCUSE","      *goto A12","    #TELL HIM THAT YOU'LL GET BACK TO HIM","      *goto A13","  #INTERESTED","    #ACCEPT THE INVITATION","      *goto A21","    *selectable_if (false) #MAKE AN EXCUSE","      *finish","    *selectable_if (false) #TELL HIM THAT YOU'LL GET BACK TO HIM","      *finish","  #UNINTERESTED","    *selectable_if (false) #ACCEPT THE INVITATION","      *finish","    #MAKE AN EXCUSE","      *goto A32","    #TELL HIM THAT YOU'LL GET BACK TO HIM","      *goto A33","*label A11","*set CA%-10","What kind of guy needs his father to make a date for him? You see your father's boss waiting outside the country club where they are staging the affair, with his handsome mustachioed chauffeur. Wait a minute... That's not the","chauffeur, it's Matt! This might be better than you thought.","*finish","*label A12","The boss senses that you are trying to give him the runaround.","","","Select an action:","","*choice","  #HOPE HE DOESN'T GET TOO ANGRY","    *goto B1","  #LIE YOUR WAY OUT OF THE EXCUSE, AND ACCEPT THE INVITATION","    *goto B2","*label B1","*set FM%-10","He doesn't get angry at all. Maybe it is just a coincidence that your dad has to sit on a stool, behind a plant for the company affair.","*finish","*label B2","*label A21","*set TH%+10","*set SC%+30","This was a very open-minded set of choices. You arrive at the country club waiting to meet Dad's boss's son. All of a sudden, this MOVIE STAR walks up to you. Your eyes glaze...your mouth gets dry and you must concentrate very hard to","prevent your tongue from dropping out of your mouth. COULD THIS BE MATT?","*page_break","Nope. It's some guy who works there parking cars. Matt arrives complete with braces, freckles and a squeaky laugh. As the night goes on, you find out he's not so bad. Dad gets a raise the following week. Now, about the company picnic","next month...","*finish","*label A32","*set GN%-20","*set TH%-40","*set FM%-20","Your behavior is rude and insensitive. Your boss reconsiders his earlier positive evaluation of you and begins to wonder about your dad as well. You have caused the family considerable stress.","*finish","*label A13","*label A33","*set FM%-40","You must really hate your father. The boss' face becomes red. He takes a handful of high blood pressure medication (hey, just like Dad says). When he calms down, he promises that you will never have a job in his company.","*page_break","Not only have you soured a potentially lucrative future business contact, but you have messed up the opportunity to date Matt, who is a ruggedly handsome college football star.","*finish","",""], "labels":{"a11":23,"a12":28,"b1":39,"b2":43,"a21":44,"a32":53,"a13":59,"a33":60}}