{"crc":-1103487494, "lines":["It's Valentine's Day, and you have just discovered that ${spouseName} received a box of candy and a \"mushy\" card from his secretary, who wanted to \"express her appreciation for all of the kindness and generosity he has shown...\" What will you do?","","","Select an action:","","*choice","  #DO NOT MENTION IT","    *goto A1","  #GIVE HIM THE THIRD DEGREE ABOUT HIS SECRETARY (THAT @$#%!)","    *goto A2","  #TELL HIM THAT YOU ARE JEALOUS","    *goto A3","*label A1","You don't have to mention it. He tells you about it, himself. \"How do you like that. She went through the trouble of finding out just what I like. She's such an absolute doll! I wouldn't trade her in for anything.\" It seems like he","would have been just as happy with a box of dried fertilizer! Are you feeling a little jealous?","","","Select an action:","","*choice","  #YES","    *goto B1","  #NO","    *goto B2","*label B1","*set GN%-10","That's understandable. He certainly is laying it on a bit thick. After a while, he settles down.","*label LATER","","Later in the evening, he asks you to do him a small favor. How will you treat him?","","","Select an action:","","*choice","  #SAY, \"WHY DON'T YOU HAVE YOUR WONDERFUL SECRETARY DO IT FOR YOU, DARLING?\"","    *goto C1","  #DO THE FAVOR","    *goto C2","*label C1","*set GN%-20","The claws are really sharp tonight, aren't they? He gets the message.","*finish","*label C2","*set GN%+40","You have passed up a golden opportunity for sarcasm and hostility. You should be proud of yourself. These are the times when relationships grow the most.","*finish","*label B2","*set CN%+10","*set CA%+20","You must have a very strong ego.","*finish","*label A2","*set CN%-20","*set GN%-20","*set HP%-20","You want to know as many details about his secretary as possible so, if you ever see her, you can completely stomp on her. You are the jealous type.","*label CHECKIT","*page_break","*if TR<50","  *goto D.T","*else","  *goto D.F","*label D.T","Sometimes people are jealous when they can't be trusted themselves, you know. Judging by your status sheet, perhaps you should give this some thought!","*goto LATER","*label D.F","Perhaps you find it difficult to believe that someone can be as Trustworthy as you seem to be.","*goto LATER","*label A3","*set TR%+30","*set GN%-5","That is very honest of you. At least you didn't do something that would allow your jealousy to display itself in a more hostile form.","*goto CHECKIT","",""], "labels":{"a1":12,"b1":24,"later":27,"c1":39,"c2":43,"b2":47,"a2":52,"checkit":57,"d.t":63,"d.f":66,"a3":69}}