{"crc":-522337376, "lines":["A very aggressive girl from a tough crowd starts an argument with you and challenges you to a fight after school. Everyone whispers about \"the big fight.\" It looks like there will be a lot of people watching.","*choice mood action","  #FRIGHTENED","    #SHOW UP AFTER SCHOOL","      *goto A11","    #DON'T SHOW UP AFTER SCHOOL","      *goto A12","  #TOUGH","    #SHOW UP AFTER SCHOOL","      *goto A21","    *selectable_if (false) #DON'T SHOW UP AFTER SCHOOL","      *finish","  #UNAFFECTED","    *selectable_if (false) #SHOW UP AFTER SCHOOL","      *finish","    #DON'T SHOW UP AFTER SCHOOL","      *goto A32","*label A11","*set CA%-20","*set PH%+10","Your anxiety makes it impossible for you to react quickly. The other girl jumps you from behind and beats you up. The only reason why you showed up at all was so that you wouldn't look foolish in front of the crowd. The fact that you","didn't \"chicken out\" does very little to remove the scratches from your face.","*finish","*label A12","*set IN%+30","*set SC%-10","The next day in school, three or four girls from the tough crowd call you \"chicken.\" Everyone else realizes that it would have been foolish to fight that girl. Intellectual sphere rises because you reacted in a way to preserve your own","safety.","*finish","*label A21","*set PH%+15","The girl shoves you hard, knocking you off-balance. She scratches you in the face and neck. She is much more used to this kind of thing than you are. Suddenly, you see that she has left herself off balance.","","","Select an action:","","*choice","  #SMACK HER","    *goto B1","  #SCRATCH HER","    *goto B2","*label B1","*set PH%+15","*set SC%+10","*set CN%+30","Your hand smacks hard against the girl's cheek.","*temp randomC","*rand randomC 1 2","*if randomC=1","  *goto C1","*else","  *goto C2","*label C1","*set CN%+20","*set SC%+40","She is startled and out of breath. She looks at you and at her friends and begins to cry. They walk her away from the fight.","*finish","*label C2","The girl tells her friends to jump on you. You can:","","","Select an action:","","*choice","  #STAY THERE AND FIGHT","    *goto D1","  #RUN AWAY","    *goto D2","*label D1","*temp randomE","*rand randomE 1 2","*if randomE=1","  *goto E1","*else","  *goto E2","*label E1","*set IN%-30","The girl's friends all pile on top of you, tearing at your skin and clothes.","Suddenly, all of the people in the crowd who are watching get very quiet. \"WHAT IS GOING ON OUT HERE?\" the principal's voice booms. \"GIRLS?! FIGHTING?","You should all be ashamed of yourselves.\" Everyone gets two weeks' suspension for fighting.","*finish","*label E2","The girl knocks the wind out of you, and you fall to the floor. She is just about to step on you, when the principal comes and breaks up the fight. Everyone involved in the fight gets suspended for two weeks.","*finish","*label D2","*label A32","*set IN%+20","You choose not to risk the danger of getting seriously hurt. This girl was capable of hurting you and might have done so, had you chosen to stay and fight her.","*finish","*label B2","Your scratching doesn't have any effect on her.  She laughs at you, then proceeds to beat you up. You are left with many scratches and bruises. It wasn't a very good idea to fight.","*finish","",""], "labels":{"a11":17,"a12":23,"a21":29,"b1":41,"c1":52,"c2":57,"d1":68,"e1":75,"e2":81,"d2":84,"a32":85,"b2":89}}