{"crc":217264481, "lines":["WARNING - THIS EPISODE CONTAINS SUBJECT MATTER OF A SEXUAL NATURE.","Do you wish to continue?","*choice","  #Yes","    *goto sexualEncounter","  #No","    *set instantaneous true","    *finish","*label sexualEncounter","A college-aged guy named Bobby Rhinehart works at the dry cleaning store that you use. One evening you arrive at the store just as it is closing. You absolutely need the clothes tonight. Bobby is already out the door. Because you know","him by name, and because you also know that he is friendly, you feel sure that he will reopen the store and get you your clothes.","*choice mood action","  #FRIENDLY","    #ASK HIM TO REOPEN THE STORE","      *goto A11","    #DECIDE TO WAIT UNTIL THE STORE REOPENS","      *goto A12","  #ANXIOUS","    #ASK HIM TO REOPEN THE STORE","      *goto A21","    #DECIDE TO WAIT UNTIL THE STORE REOPENS","      *goto A22","*label A11","*if SC<60","  *goto B.T","*else","  *goto B.F","*label B.T","Your social skills aren't good enough to get him to go through the trouble of reopening the store. He wants to go out with his friends tonight, and this would hold him up. He calls out to you, saying that a time alarm has been set and","his boss will think he is going back in to do something shady if he trips it by reopening it. \"Company policy, you know. Sorry!\"","*finish","*label B.F","Your social skills make it easy for you to ask for this request in a way that is difficult to refuse. He reopens the store for you. As you watch him disappear to the back of the store, you notice how firm his body is and, for a moment,","you drift back to the days when you were that young.","*page_break","\"Was it THAT long ago?\" you wonder. \"Yes,\" you conclude, \"It was THAT long ago.\" Bobby snaps you back to reality by handing you a big pile of clothes and asks if you would like a hand walking out to the car. You thank him.","*page_break","Just before you pull out of the parking lot, you notice that Bobby is having car trouble. Rather than having genuine concern about his transportation difficulties, you find yourself entertaining thoughts of a \"fling\" with this younger man.","","","Select an action:","","*choice","  #OFFER TO HELP JUMP-START THE CAR","    *goto C1","  #OFFER HIM A LIFT BACK HOME","    *goto C2","  #DO NOTHING / GO BACK TO YOUR OWN HOME","    *goto C3","*label C3","*if MS>0","  *goto Q.T","*else","  *goto Q.F","*label C1","*set SC%+20","*set GN%+20","Nothing helps. The battery is completely dead.","","","Select an action:","","*choice","  #OFFER HIM A LIFT BACK HOME","    *goto D1","  #DO NOTHING / GO BACK TO YOUR OWN HOME","    *goto D2","*label C2","*label D1","In the car on the way home, you notice him looking at you in a peculiar sort of way. He tells you that it's funny to be sitting next to someone he's only seen from behind a counter. You find yourself talking very freely to him and, for","a moment, your connection to him is like taking a fast train ride back to adolescence.","*page_break","Because you are relating to him more on his own level, he perceives you as a \"different\" kind of adult. You are honestly curious and even envious about his life, rather than critical, like most other adults. As you begin to feel younger,","he begins to feel older.","*page_break","Soon you realize that you could enjoy talking to Bobby for a long time. He's young and charming and just a little naive. He motions proudly to a cluster of apartments, explaining that he lives alone. He moved out of his parents' home","because he \"needed to be independent.\" He invites you up for a cup of coffee.","","","Select an action:","","*choice","  #GO UP AND HAVE A CUP OF COFFEE","    *goto E1","  #SAY THAT YOU HAVE TO GET BACK TO YOUR OWN HOME","    *goto E2","*label E1","Bobby disappears to make the coffee; you notice that his apartment is decorated sparsely, but tastefully. There are no crazy posters or wild-looking artwork. He must be a pre-med student, because you can see anatomical charts on the","walls and small piles of books stacked neatly in the corners.","*page_break","From the room you are in, you can see gym socks hanging over a towel bar in the bathroom. He seems so self-sufficient.","*page_break","You wonder for a moment just how old he might be. Nineteen? Twenty? \"That's not SO young,\" you say to yourself. Bobby emerges from an adjacent room with a fresh pot of coffee.","*page_break","He is barefooted. He has strong, muscular legs. As you sit by the table drinking your coffee and talking, you notice him staring right into your eyes. He isn't trying very hard to hide his intense gaze. When you are finished with the","coffee, you can:","","","Select an action:","","*choice","  #LINGER AND HAVE A SECOND CUP","    *goto F1","  #EXCUSE YOURSELF AND LEAVE","    *goto F2","*label F1","The two of you talk with great passion about subjects you haven't discussed in years. You had almost forgotten how much energy young people have for philosophizing about things. The longer you stay, the more you lose track of time. You","refuse to look out the window, fearing that you will be reminded by the violet sky that it is getting late.","*page_break","Finally, a silence falls between the two of you. It is the uncomfortable silence that happens when two people realize their physical attraction for one another at the same moment. Bobby becomes shy. It is clear that if anything will","happen between you, it will have to be initiated by you.","","","Select an action:","","*choice","  #MAKE A SEXUAL ADVANCE","    *goto G1","  #EXCUSE YOURSELF AND LEAVE","    *goto G2","*label G1","*if MS>0","  *goto H.T","*else","  *goto H.F","*label H.T","Right before you make your move, you are reminded about ${spouseName}. The usual questions run through your mind. \"What if...?\" \"How would I explain...?\" It is already very late now. You would have to make up a story either way.","","","Select an action:","","*choice","  #CHANGE YOUR MIND, APOLOGIZE AND LEAVE","    *goto I1","  #GO ON MAKING THE ADVANCE","    *goto I2","*label I1","*label Q.T","*set TR%+30","*set TH%+30","Your conscience gets the better of you. For a moment, you resent everything about your life: the fact that you are getting old, the fact that you are married and the fact that you can no longer do whatever you please. Worse than that,","you feel you never really appreciated that time of life when you could have done whatever you pleased.","*page_break","In the car on the way home, you remind yourself of the things you do have and begin the train ride back to adulthood, sighing at all the familiar images. As you walk through the door, ${spouseName}, with a worried look on his face, asks you where","you have been.","","","Select an action:","","*choice","  #SAY, \"CAR TROUBLE.\"","    *goto J1","  #GIVE HIM A DIFFERENT EXCUSE","    *goto J2","  #TELL HIM THE TRUTH","    *goto J3","*label J1","*set TR%-10","It's not exactly a lie, but think about it. You didn't really DO anything. You could have told the truth.","*finish","*label J2","*set TR%-10","${spouseName} breathes a sigh of relief. Any story would have been just fine.","*finish","*label J3","You didn't really do anything, so there is no reason to hide it. ${spouseName} looks at you in a peculiar way. You don't look guilty enough OR happy enough to have done anything worth getting suspicious over!","*finish","*label I2","*if TR>70","  *goto K.T","*else","  *goto K.F","*label K.T","*set HP%-30","Bobby responds eagerly to your advances. You spend long hours making love. It is a powerful experience for you. You have been a very trustworthy person so far. This trustworthiness causes you to feel terribly guilty about having sex with","this young man. As a result, you are thrown into a deep depression. You leave feeling resentful and foolish.","*finish","*label K.F","*set HP%-30","After making love, the reality of what you have done suddenly sweeps over you. If ${spouseName} ever found out he would be crushed. Bobby looks dreamy-eyed. He begins to talk to you about sneaking away for a weekend, about meeting at hotels and","secret places just for the two of you.","*page_break","His youth becomes painfully evident. He has no appreciation of the complexity of what has just happened, because to him it isn't very complex. He hasn't cheated on HIS spouse and can't even imagine it.","","","Select an action:","","*choice","  #TRY TO CONTINUE THE AFFAIR","    *goto L1","  #TELL HIM THAT THIS IS ALL THERE CAN BE","    *goto L2","*label L1","*set SC%-30","*set TR%-30","*set MP+2","It doesn't work. How could you think it would? Eventually ${spouseName} finds out. It's difficult for him, but after admitting that he can't live without you, he finally forgives you for it.","*finish","*label L2","*set CA%-30","Bobby gets angry, and for a moment it seems as if he will cause trouble, but he is a smart kid and eventually begins to understand the realities of the situation. Your affair remains undetected, but a few months after the incident, a","friend tells you that while picking up her clothing at the dry cleaners, she heard this rumor....","*finish","*label H.F","The two of you make love for hours and fall asleep in each other's arms. The next day you are awakened by the usual smell of coffee, and for a moment wonder where you are. A flood of experiences from yesterday invades your consciousness.","You look for Bobby, but he has evidently left the house. There is a note by the coffee pot.","*page_break","It reads, \"Thanks for a great night! I'd really love to do it again sometime. I've got a heavy date tonight, so if you could be out by about noontime, I could straighten the place up a bit. Keep in touch!\"","*finish","*label F2","*label G2","It's difficult, but you let yourself out. On the way back you begin to think about many aspects of your life -- the fact that you are getting old, and the unfairness of the fact that you really never appreciate the freedom of youth until","it has long since passed you by. (Sigh!)","*finish","*label D2","*label E2","*label Q.F","On the way home, you begin to think back to the time when you were just a teenager, yourself. Maybe Bobby was the type of guy who would have asked you out. He was very attractive. You sigh as you are transported briefly to another time","of your life.","*finish","*label A12","*set CA%+30","*set SC%+30","*label A22","You drop off your clothes the next morning and the young man behind the counter apologizes for not being able to help you. You shrug it off politely.","*finish","*label A21","*set CA%-20","The young man explains to you that once the registers are locked for the night, they can't be opened!","*finish","",""], "labels":{"sexualencounter":8,"a11":22,"b.t":27,"b.f":31,"c3":49,"c1":54,"c2":67,"d1":68,"e1":86,"f1":105,"g1":120,"h.t":125,"i1":136,"q.t":137,"j1":156,"j2":160,"j3":164,"i2":167,"k.t":172,"k.f":177,"l1":192,"l2":198,"h.f":203,"f2":209,"g2":210,"d2":214,"e2":215,"q.f":216,"a12":220,"a22":223,"a21":226}}