{"crc":981926160, "lines":["You have been invited to a party at the home of an acquaintance. When you arrive at the party, you notice that you and your companion have virtually nothing in common with the other people there. They dress differently, speak","differently and listen to a different kind of music.","*page_break","Although you are in the same room as everyone else, you seem separate from them. You have been there almost an hour and still haven't spoken to a single person.","*choice mood action","  #UNCOMFORTABLE/ON EDGE","    #LEAVE THE PARTY EARLY","      *goto A11","    #MINGLE WITH THE GUESTS","      *goto A12","  #AT EASE/TAKING IN THE ATMOSPHERE","    #LEAVE THE PARTY EARLY","      *goto A21","    #MINGLE WITH THE GUESTS","      *goto A22","*label A11","*set SC%-10","*set CA%-10","I guess you feel uncomfortable with the differences between yourself and the other people at the party. You might have tried getting to know some of them a bit better. Sometimes it is the differences between people that make life","interesting and exciting. What fun would it have been to meet a group of people who were nothing more than clones of yourself?","*finish","*label A12","*page_break","Your discomfort is a natural reaction to people who are so different from you in appearance and mannerisms.","*page_break","*if SC>70","  *goto B.T","*else","  *goto B.F","*label B.T","You have developed excellent social skills. As a result, you have no trouble mingling with the crowd. Many of the people in the room are from foreign countries. The information you gather about them is fascinating and rewarding.","*finish","*label B.F","*if SC>49","  *goto C.T","*else","  *goto C.F","*label C.T","*set CN%+10","*set SC%+10","Perhaps a lack of confidence in your social abilities is part of the reason for your discomfort. As it turns out, many of the people in the room are from foreign countries. The information you gather about them is fascinating and","rewarding. Your social skills and confidence improve as a result of taking the risk to get to know others who are much different in lifestyle.","*finish","*label C.F","*set SC%+20","Your social skills aren't really sharp enough to make an impression on these people, and they treat you with indifference. Many of the people in the room are from foreign countries, and that is why they seem so peculiar. Your","social skills improve as a result of your willingness to take the risk of meeting new people, so things will be better next time around.","*finish","*label A21","*set CA%+20","On the one hand, I wonder how a person who claims to be so at ease with herself can attend a party with so many different types of people and resist the urge to satisfy curiosity and meet some of them.","*page_break","On the other hand, there are those who like to be \"passive observers.\" You are probably the type of person who would go to a party like this and gossip about everyone there all the way home.","*finish","*label A22","*if SC>50","  *goto D.T","*else","  *goto D.F","*label D.T","*set SC%+20","*set IN%+20","You are comfortable with your personality and your ability to make an impression socially. Your status sheet suggests that this is a fairly accurate appraisal of yourself. As it turns out, many of the people in the room are","from foreign countries. The information you gather about them is fascinating and rewarding.","*finish","*label D.F","*set SC%-20","You have overrated your ability to socialize. The people in the party find your manner inappropriate and boorish, but you hardly notice.","*finish","",""], "labels":{"a11":15,"a12":21,"b.t":29,"b.f":32,"c.t":37,"c.f":43,"a21":48,"a22":54,"d.t":59,"d.f":65}}