{"crc":1238829875, "lines":["WARNING - THIS EPISODE CONTAINS SUBJECT MATTER OF A SEXUAL NATURE.","Do you wish to continue?","*choice","  #Yes","    *goto sexualEncounter","  #No","    *set instantaneous true","    *finish","*label sexualEncounter","You are in the house alone. While you are \"exploring\" the drawers, you notice a Playgirl magazine underneath a pile of clothing.","*choice mood action","  #INTERESTED","    #EXAMINE THE MAGAZINE","      *goto A11","    *selectable_if (false) #PUT THE MAGAZINE AWAY","      *finish","  #UNINTERESTED","    *selectable_if (false) #EXAMINE THE MAGAZINE","      *finish","    #PUT THE MAGAZINE AWAY","      *goto A22","*label A11","The middle page folds out to show a man in a cowboy hat and boots...WITH NOTHING ELSE ON!! You try to turn the page, but you just can't believe what's there. Your eyes are frozen to one spot in particular.","","","Select a mood:","","*choice","  #AROUSED","    *goto B1","  #CONFUSED","    *goto B2","  #UNINTERESTED","    *goto B3","*label B1","*set CA%-10","Your curiosity stimulates some early sexual fantasies. At this point in life, unless you are extremely precocious, you don't have all the facts about sex. You are finding out fast.","*label D","","","Select an action:","","*choice","  #TAKE OUT THE CENTERFOLD AND KEEP IT","    *goto C1","  #LEAVE IT ALONE","    *goto C2","*label C1","The centerfold guy continues to intrigue you. Every once in a while, you have a sexy dream, with him as the star.","*finish","*label C2","*set CA%-10","You sigh and put the magazine back. Why don't any of the guys in your class look like this? Or do they?","*finish","*label B2","*set CA%-10","You ask yourself many questions. Do all men look like this? How old do you have to get before people start to \"do\" things? Are all of their \"you-know-whats\" THAT big?","*goto D","*label A22","*label B3","Perhaps you aren't curious about men yet. That's perfectly okay. As you get older, you may find them much more interesting. Sex does have its share of","rewards and problems, but these things are more likely to have the greatest impact on your life when you are a bit older.","*finish","",""], "labels":{"sexualencounter":8,"a11":21,"b1":34,"d":37,"c1":47,"c2":50,"b2":54,"a22":58,"b3":59}}