{"crc":434954264, "lines":["Today is Dad's birthday and you would like to make him breakfast.","*choice mood action","  #EXTRAVAGANT","    #TRY TO MAKE EGGS","      *goto A11","    #TRY TO MAKE CEREAL","      *goto A12","    #ASK MOM FOR HELP","      *goto A13","  #PRACTICAL","    #TRY TO MAKE EGGS","      *goto A21","    #TRY TO MAKE CEREAL","      *goto A22","    #ASK MOM FOR HELP","      *goto A23","*label A11","*set SC%+20","What kind of eggs do you want to try to make?","","","Select an action:","","*choice","  #SCRAMBLED","    *goto B1","  #FRIED","    *goto B2","  #BOILED","    *goto B3","*label B1","*label B2","*label B3","You must think that young children can do a lot! The best you can do is throw them raw into a pot and give them to Dad--which is exactly what you do. He's in bed sleeping.","","","Select an action:","","*choice","  #FEED HIM RAW EGGS WITH A SPOON","    *goto C1","  #WAKE HIM UP FIRST","    *goto C2","*label C1","Boy, is he surprised. He probably thinks this is going to be the best birthday ever. Mom is laughing very hard. Dad's egg is dripping on the bed.","*finish","*label C2","How do you want to wake him?","","","Select an action:","","*choice","  #TURN ON THE CLOCK RADIO","    *goto D1","  #OPEN HIS EYE WITH YOUR FINGERS","    *goto D2","*label D1","He's up. You show him the eggs. I guess he's not really hungry yet. It's the thought that counts.","*finish","*label D2","Daddy wakes up making doggie noises. SNORT! SNORT! GRRRRRRR! You start to feed him the eggs. He runs into the bathroom to wash up. (At least you think he wants to wash up.)","*finish","*label A12","*set SC%+20","You pour out a bowl of cereal. It keeps coming and coming. Hey! There's a toy in there. You put some milk on it. Oops! Some of it spills on the floor. You take it into Dad. You'll have to wake him up. How do you want to wake him?","","","Select an action:","","*choice","  #TURN ON THE CLOCK RADIO","    *goto E1","  #OPEN HIS EYE WITH YOUR FINGERS","    *goto E2","*label E1","He's up. You show him the cereal. I guess he's not really hungry yet. It's the thought that counts.","*finish","*label E2","Daddy wakes up making doggie noises. SNORT! SNORT! GRRRRRRR! You start to feed him the soggy cereal. He runs into the bathroom to wash up. (At least you think he wants to wash up.)","*finish","*label ASKMOM","*label A13","*label A23","Mom won't let you do exactly what you want but helps you make Dad a nice breakfast. This makes him feel terrific.","*finish","*label A21","*label A22","You don't know how to be practical yet, silly. Why don't you ask Mom for some help?","","","Select an action:","","*choice","  #O.K.","    *goto F1","  #YOU WANT TO DO IT YOURSELF","    *goto F2","*label F1","*goto ASKMOM","*label F2","You do a lovely job of redecorating the kitchen. When Mom and Dad come into the kitchen, you yell, \"Surprise!\" They turn around and head back to the bedroom.","*finish","",""], "labels":{"a11":16,"b1":30,"b2":31,"b3":32,"c1":43,"c2":46,"d1":57,"d2":60,"a12":63,"e1":75,"e2":78,"askmom":81,"a13":82,"a23":83,"a21":86,"a22":87,"f1":98,"f2":100}}