{"crc":-2128543391, "lines":["A friend of yours at school has gotten pregnant and has decided to get married. The whole town is buzzing about it as if it were an awful scandal. Your mother has been gossiping about it night and day with her nosey friends.","*page_break","Every once in a while she tells someone on the phone, \"If that were MY daughter, I'd lock her up until she was 25 before I ever let her out on a date again.\" Your friend is frightened and embarrassed.","*page_break","One day you receive a phone call from your friend. She tells you that her boyfriend will be quitting high school and going to work full-time. They will be married in three weeks. She wants to know whether you would consider being a","bridesmaid at her wedding.","*choice mood action","  #FLATTERED","    #AGREE TO BE HER BRIDESMAID","      *goto A11","    *selectable_if (false) #DECLINE THE INVITATION","      *finish","  #EMBARRASSED","    #AGREE TO BE HER BRIDESMAID","      *goto A21","    #DECLINE THE INVITATION","      *goto A22","*label A11","*if ST>0","  *goto B.T","*else","  *goto B.F","*label B.T","Your mother says she will not let you do it. The whole town is talking about the incident, and she will not condone it by letting you be a part of it.","","","Select an action:","","*choice","  #DO IT ANYWAY","    *goto C1","  #STAY HOME","    *goto C2","*label C2","*set FM%+10","*set TH%-10","*set EX%-20","*set HP%-20","Adhering to your mother's wishes, you stay home. You find out from a friend in school the next day that the bride's mother fainted in the aisle and had to be taken home in an ambulance.","*finish","*label C1","You can hardly believe how unfair your mother is.","*page_break","*label B.F","*set TH%+20","*set FM%-10","*set SC%+30","*set GN%+40","As it turns out, the wedding is small, but touching. Your friend is in her mother's wedding dress, which seems too large and much too long. As you watch her walk down the aisle, you couldn't possibly imagine trading places with her.","*page_break","The groom looks terrified. His father rests a strong hand on his shoulder throughout the ceremony. As you eye the people who are attending, you see some people crying tears of happiness and others shaking their heads and gossiping.","*page_break","Later in the day, you overhear a woman say, \"If that were my daughter I would die.\" FIVE minutes later she tells your friend's mother \"how beautiful and mature\" her daughter looked. Sometimes adults seem so two-faced, it can make you sick!","*finish","*label A21","*set CA%-10","*set SC%-10","Your friend senses your discomfort. Two days later, she calls you and says that she has decided not to have any bridesmaids. \"Thank you, anyway.\" She hangs up the phone quickly, trying not to cry.","*finish","*label A22","I can understand why you might feel uncomfortable. From your friend's point of view, she is trying to make her wedding feel as \"normal\" as possible and wants her friends to be there for support. She wants to remember the day with some","pleasant memories. Would you like to change your mind?","","","Select an action:","","*choice","  #YES","    *goto D1","  #NO","    *goto D2","*label D2","*finish","*label D1","*goto A11","",""], "labels":{"a11":17,"b.t":22,"c2":33,"c1":40,"b.f":43,"a21":54,"a22":59,"d2":71,"d1":73}}