{"crc":-401039204, "lines":["Up until this point in life, Weasly Rabbit, your stuffed toy, has been one of your best friends. You take him everywhere with you, but he is beginning to get on in years. One of his ears is torn off, and a recent eye injury has made his","face look a little lopsided.","*page_break","Your mother suggests that Weasly should be retired. You wake up one day to discover Weasly has been moved from the place where you last spotted him.","*choice mood action","  #PANICKY","    #CRY","      *goto A11","    #SEEK INFORMATION","      *goto A12","    *selectable_if (false) #DO NOTHING","      *finish","  #SUSPICIOUS","    *selectable_if (false) #CRY","      *finish","    #SEEK INFORMATION","      *goto A22","    #DO NOTHING","      *goto A23","  #UNCONCERNED","    *selectable_if (false) #CRY","      *finish","    *selectable_if (false) #SEEK INFORMATION","      *finish","    #DO NOTHING","      *goto A33","*label A11","How could you have given up on Weasly so soon? I know you are upset, but this is no time to panic.","","","Select an action:","","*choice","  #GIVE UP HOPE","    *goto B1","  #GO GET MOM","    *goto B2","*label B1","You think that you are too powerless to do anything to resurrect Weasly. Your self-confidence is not strong enough for you to fight for what you believe in. To succeed in life, you will have to fight for what is rightfully yours.","*set HP%-30","*finish","*label B2","*goto SEEK","*label A12","Even though you are driven to find out why your friend has suddenly disappeared, you are not in a frame of mind that would insure a satisfactory outcome. You question everyone in the house as to the whereabouts of Weasly.","*page_break","You confront your mother, who looks very guilty.","","","Select an action:","","*choice","  #CALM YOURSELF DOWN AND ASK ABOUT THE DOLL","    *goto C1","  #BECOME HYSTERICAL AND ASK FOR THE DOLL","    *goto C2","*label C1","*set CA%+40","Mom sees that you are not that upset and tells you a story about how Weasly wanted to be with friends that were more like himself. She says that next week you will have a new visitor, a brand new friend who will be just as nice as Weasly.","","","Select an action:","","*choice","  #SATISFIED","    *goto D1","  #NOT SATISFIED","    *goto D2","*label D1","*label SAT","It is unfortunate that little children are so naive. You will get a new doll, but it is clear that your mother has made a terrible mistake. Weasly has just been assigned to a spot on the bottom of a pile of trash at the city dump.","Life is tough, and this is only the beginning.","*set TR%+20","*set IN%-10","*finish","*label D2","*label UNSAT","Bravo! Don't fall for that line of bull. Parents are great at fabricating stories like this when they make mistakes. You will not get your Weasly Wabbit back, but your intelligence and perseverance in this situation make it harder","for your parents to tell you made-up stories to cover their mistakes.","*set IN%+40","*finish","*label C2","Your panic and hysteria make your mom feel guilty about throwing out the doll. She spends an afternoon tracking it down and restoring it to mint condition, performing major surgery to insure that Weasly will be with you for a long","while.","*finish","*label A22","*label SEEK","You confront Mom with the fact that Weasly was not in the spot where he was last deposited. She claims not to have seen him either. You are:","","","Select an action:","","*choice","  #SATISFIED WITH THIS ANSWER","    *goto E1","  #NOT SATISFIED WITH THIS ANSWER","    *goto E2","*label E1","A very naive choice. Your mother has pulled a fast one on you, and you will never see Weasly again.","*set IN%-20","*finish","*label E2","Wisely, you persist. This time she tells you that Weasly left because he wanted to be with friends who were more like him. She tells you that next week you will have a new visitor, a brand new friend who will be just as nice as","Weasly. You are:","*set IN%+30","","","Select an action:","","*choice","  #SATISFIED","    *goto F1","  #NOT SATISFIED","    *goto F2","*label F1","*goto SAT","*label F2","*goto UNSAT","*label A23","You must learn to follow your instincts. Your lack of action has allowed Weasly to be placed in the trash. You suffer from confusion and from a mild depression. You secretly suspect that Mom is responsible for Weasly's","disappearance, but since you were not assertive enough to approach her, you will never know.","*set IN%+10","*finish","*label A33","Your attachment to Weasly was weak. You would think that after all the hours that he kept you company, you would show a little more concern. Remember that time you pulled all of the buttons off the living room couch and were put in","your room for the whole day? It was Weasly who kept you from going stir-crazy. Learn to appreciate your friends, or they may abandon you in times of need.","*set EX%-10","*finish","",""], "labels":{"a11":26,"b1":37,"b2":41,"a12":43,"c1":56,"d1":68,"sat":69,"d2":75,"unsat":76,"c2":81,"a22":85,"seek":86,"e1":97,"e2":101,"f1":114,"f2":116,"a23":118,"a33":123}}