{"crc":2016711702, "lines":["Paul is one of your best friends. You've grown up together (the two of you used to take baths in the same tub when you were babies), seen a lot of each other and have hung around together.","*page_break","You have never gone out together, but maybe it's better that way. No complications. He's going out with a girl who treats him terribly -- a total bitch.","*page_break","One night when you and a date and Paul and his date go out to the movies, Paul's date gets really sick. She doesn't really LOOK that sick, but she just feels like giving everyone a hard time because she has a headache.","*page_break","Since she happens to live really close to your date's house, and you practically live right next door to Paul, AND all four of you are exhausted, it might be a good idea if you and Paul go home together, and Paul's bitchy date and your","date drive home together.","*choice mood action","  #FEELING SORRY FOR PAUL","    #HAVE YOUR DATE DRIVE PAUL'S DATE HOME","      *goto A11","    *selectable_if (false) #ENCOURAGE EVERYONE TO GO HOME WITH WHOMEVER THEY CAME WITH","      *finish","  #NOT FEELING SORRY FOR PAUL","    *selectable_if (false) #HAVE YOUR DATE DRIVE PAUL'S DATE HOME","      *finish","    #ENCOURAGE EVERYONE TO GO HOME WITH WHOMEVER THEY CAME WITH","      *goto A22","*label A22","*set SC%-20","Paul gets angry with you for not letting him out of taking her home. You can't figure out why he's such a glutton for punishment.","*finish","*label A11","*set SC%+10","*set GN%+20","*set TH%+30","You and Paul have a real heart-to-heart talk. During the talk he confesses to being suckered into relationships with women who treat him like dirt. The two of you collapse on a chair together and continue talking. Your shoulders are","pressed against each other.","*page_break","Paul sighs and mentions, \"You know, the only girl I've ever been able to feel comfortable with is you. I don't understand why I can't find someone who is as pretty, smart, intelligent and lovable. You must be one of a kind.\"","","","Select an action:","","*choice","  #SAY (JOKINGLY), \"THAT'S BECAUSE I AM ONE OF A KIND, SILLY. NOW GET OUT OF HERE AND GET SOME SLEEP.\"","    *goto B1","  #TURN AROUND AND GIVE HIM A GENTLE KISS ON THE CHEEK","    *goto B2","*label B1","*set CA%-10","A potentially romantic moment becomes light. I guess you wanted it that way. Paul goes home, and for a second you wonder, \"What if...\"","*finish","*label B2","For a moment you think you see a tear well up in Paul's eye. He leans toward you to give you a kiss.","","","Select an action:","","*choice","  #TELL HIM THIS IS NOT RIGHT","    *goto C1","  #KISS HIM","    *goto C2","*label C1","His head lowers, and he sighs. He's had a crush on you ever since he can remember, but was always afraid you would reject him.","*page_break","He goes home and you don't see much of him anymore.","*finish","*label C2","He gives you a long, slow and sensuous kiss. In that kiss there are years of admiration and devotion. You realize that you must have had a crush on him too. That night when you try to sleep, you think of how it might be with Paul as","your boyfriend. Is he thinking the same things too?","*page_break","The next day he calls you and apologizes for \"getting out of hand.\" He says he doesn't think things could work.","*finish","",""], "labels":{"a22":19,"a11":23,"b1":40,"b2":44,"c1":55,"c2":60}}