{"crc":1575340219, "lines":["WARNING - THIS EPISODE CONTAINS SUBJECT MATTER OF A SEXUAL NATURE.","Do you wish to continue?","*choice","  #Yes","    *goto sexualEncounter","  #No","    *set instantaneous true","    *finish","*label sexualEncounter","${loverName} wants to know if you are interested in going to a \"naturist\" club to which he belongs. Do you know what a \"naturist\" club is?","","","Select an action:","","*choice","  #YES","    *goto A1","  #NO","    *goto A2","*label A1","Okay. Be sure to bring the proper attire if you decide to go!","*goto B","*label A2","Naturist clubs are groups of people who enjoy the communal spirit provided by shedding some of the inhibitions of modern society and enjoying social and intellectual stimulation in this \"natural\" state.","*label B","","Are you interested in going to the naturist club with ${loverName}?","","","Select an action:","","*choice","  #YES","    *goto C1","  #NO","    *goto C2","*label C2","Suit yourself!","*finish","*label C1","You arrive at the naturist club, a sprawling country ranch surrounded by tall shrubs. You are greeted by the club manager, who is standing behind a partition, and you and your companion are each given a key to a locker. ${loverName} says he","will meet you by the shuffleboard courts in the back of the club. When you arrive on the courts, what will you be wearing?","","","Select an action:","","*choice","  #CASUAL WEAR","    *goto D1","  #FOOTWEAR, BUT THAT'S IT","    *goto D2","*label D1","Are you sure you know what a naturist club is? It's a nudist camp! If you want to stay, you'll have to put on your Birthday Suit. Will you be staying?","","","Select an action:","","*choice","  #YES","    *goto E1","  #NO","    *goto E2","*label E2","Suit yourself!","*finish","*label E1","*label D2","There is ${loverName} in all his glory over by the shuffleboard courts. He doesn't look bad for his age. Your body reacts to the suprise with an unexpected blush. The slight nervousness and the breeze in the air makes your nipples stand out. No","one seems to notice except ${loverName} who thanks you for the \"compliment.\"","*finish","",""], "labels":{"sexualencounter":8,"a1":19,"a2":22,"b":24,"c2":36,"c1":39,"d1":51,"e2":62,"e1":65,"d2":66}}