{"crc":1777174204, "lines":["*if EM>0","  *goto Z.T","*else","  *goto Z.F","*label Z.F","I'm sorry, but you must have a job to do this vignette.","*comment @NTQ","*set instantaneous true","*finish","*label Z.T","In your own opinion, you have been doing a good job at work. Your boss, however, constantly complains about the pickiest things. He never tells you when you have done a good job. When you do something wrong, he really lets","you have it, even when you foul up on something easily correctable.","*page_break","To make matters worse, most of the mistakes you make are HIS fault. Now he has called you into his office for a \"discussion.\" This usually means that you are going to get yelled at for something.","*page_break","Sometimes you think that having an affair with the office manager and being married to his own nagging wife is driving him straight to the funny farm.","*choice mood action","  #ANGRY","    #LISTEN QUIETLY","      *goto A11","    #STICK UP FOR YOURSELF","      *goto A12","  #ANXIOUS","    #LISTEN QUIETLY","      *goto A21","    #STICK UP FOR YOURSELF","      *goto A22","  #UNBOTHERED","    #LISTEN QUIETLY","      *goto A31","    #STICK UP FOR YOURSELF","      *goto A32","*label A11","*set GN%-10","*set HP%-20","Your anger causes you to resent working and your boss even more than you do now. Don't you know you're not supposed to have your life made miserable by work for a few years yet? Your reaction only fosters depression.","*finish","*label A12","You have been used as a scapegoat for too long now. You tell your boss that you don't want to hear any more of his complaining. He tells you to stop talking to him like that or he'll fire you. You can:","","","Select an action:","","*choice","  #QUIT","    *goto B1","  #LET HIM FIRE YOU","    *goto B2","*label B1","*set CN%+40","*set EM 0","*comment @OCP,(NONE)","*set occupation \"(NONE)\"","Good riddance!","*finish","*label B2","He won't fire you because he depends on you too much, but he won't apologize either.","*finish","*label A21","*set CN%-20","You have become used to this kind of abuse -- but you shouldn't have. Don't you know that if you listen to negative things about yourself long enough, you eventually begin to believe that you deserve them?","*finish","*label A22","*set CA%-20","You are intimidated. Your boss only comes down on you harder because he knows you are frightened of him.","*finish","*label A31","*set VC%-10","*set EM 0","*comment @OCP,(NONE)","*set occupation \"(NONE)\"","You must be trying to tune your boss out. He sees you are doing this and becomes infuriated. YOU'RE FIRED!","*finish","*label A32","*set CA%+30","*set VC%-10","*set EM 0","*comment @OCP,(NONE)","*set occupation \"(NONE)\"","You are the mellow type who tries not to let the opinions of others influence you in a negative way. You calmly point out that he is responsible for a lot of the problems you are having. He calmly fires you. On your way out the door,","the phone rings. It is your boss's wife. She wants to know where her husband is.","","","Select an action:","","*choice","  #TELL HER HE'S FOOLING AROUND WITH THE OFFICE MANAGER IN THE BACK","    *goto X1","  #HANG UP ON HER","    *goto X2","*label X1","*set HP%+10","*set TR%-10","This gets your boss in the desired amount of hot water. He calls you at home and asks you, pleads with you, begs you to: (1) come back to work and (2) tell \"snookums\" that you were playing a nasty trick. He'll even give you a raise","and a two-hour lunch break every day.","","","Select an action:","","*choice","  #DO WHAT HE SAYS/GO BACK TO WORK","    *goto Y1","  #TELL HIM YOU ARE LOOKING FOR EMPLOYMENT ELSEWHERE","    *goto Y2","*label Y1","*set HP%-10","\"Snookums\" says that anyone who is rotten enough to tell the wife of her boss a story like that should be fired. You're out of work again. Your ex-boss snickers as you walk out the door.","*finish","*label Y2","*set IN%+10","As you hang up the phone, you imagine him whimpering on the other end.","*finish","*label X2","*set TR%+10","Loyal to the end, I see.  You walk out the front door and never look back.","*finish","",""], "labels":{"z.f":4,"z.t":9,"a11":32,"a12":37,"b1":48,"b2":55,"a21":58,"a22":62,"a31":66,"a32":73,"x1":90,"y1":104,"y2":108,"x2":112}}