{"crc":-419138752, "lines":["*if (VC>60) and (EM>0)","  *goto Z.T","*else","  *goto Z.F","*label Z.F","I'm sorry. This episode awards those, currently working, who have contributed significantly to their vocations over the course of a lifetime. You have not achieved this kind of success.","*finish","*label Z.T","Because of your fine vocational performance, you are singled out for your tremendous achievements and honored at an awards dinner hosted by important members of your work environment.","*page_break","During your introduction, the host notes that you are \"outstanding because of your ability to work with others, enriching the field and exemplifying the most outstanding qualities of hard work, patience and pride.\"","*choice mood action","  #HUMBLE/MODEST","    #MAKE A LONG SPEECH","      *goto A11","    #MAKE A SHORT SPEECH","      *goto A12","  #EMBARRASSED/ANXIOUS","    #MAKE A LONG SPEECH","      *goto A21","    #MAKE A SHORT SPEECH","      *goto A22","  #PROUD","    #MAKE A LONG SPEECH","      *goto A31","    #MAKE A SHORT SPEECH","      *goto A32","*label A11","*set VC%+30","Anyone who is truly humble and modest should certainly not burden the audience with a long bombastic speech! I guess you are not as humble as you think you are, but that's okay. Tonight is your night, so enjoy!","*finish","*label A12","*set TR%+30","*set GN%+20","Nobody likes a long speech, right? You are truly humble and modest, not to mention extremely considerate. Who would you like to thank most during your speech?","*label D","","","Select an action:","","*choice","  #THOSE WITH WHOM YOU WORK","    *goto B1","  #YOUR BOSS","    *goto B2","  #YOUR FAMILY","    *goto B3","  #A HIGHER POWER","    *goto B4","*label B1","*set SC%+30","That is very sincere. Your co-workers appreciate you for this. Social sphere increases markedly.","*finish","*label B2","*set VC%+30","Your boss is proud of you. Your recognition of the help and support your boss has given you is very reinforcing to him. Vocational sphere rises even higher.","*finish","*label B3","*set FM%+30","You appreciate the fact that a good family life can, indeed, help a person get ahead on the job (just as stress in one area can compound stress in another). The love and support given by a family can ameliorate stress on the job. You","have a rare ability to keep life in perspective. Congratulations on your success. I'm sure you will have even more in the future.","*finish","*label B4","*set TH%+20","Some people have come to the realization that there is more to the world than meets the eye. As a result, they take a perspective on life which allows for a certain kind of spirituality. Regardless of the denomination, spiritual beliefs","and religious values remain suprisingly constant from religion to religion.","*page_break","One doesn't have to be extremely religious to put faith in these values either. Sometimes the belief that there are reasons for occurrences that are at times outside of our comprehension, can be a tremendous source of motivation and","comfort.","*finish","*label A21","Your speech is punctuated with a lot of \"uhms\" and \"ahs,\" but eventually you get the message across. Who would you like to thank most during your speech?","*goto D","*label A22","It seems that you are feeling a bit self-conscious about this. You shouldn't. After all, you really deserve it! Who would you like to thank most during your speech?","*goto D","*label A31","Some people would see this kind of choice as being narcissistic or conceited. In reality, you have earned this moment, and there is no reason why you shouldn't enjoy it, as long as you don't get carried away with yourself. Who would you","like to thank most during your speech?","*goto D","*label A32","*set GN%+30","Your consideration (nobody really ENJOYS listening to long speeches) and your pride are some of the reasons why you are being honored tonight. Who would you like to thank most during your speech?","*goto D","",""], "labels":{"z.f":4,"z.t":7,"a11":27,"a12":31,"d":35,"b1":49,"b2":53,"b3":57,"b4":62,"a21":70,"a22":73,"a31":76,"a32":80}}