{"crc":2003595895, "lines":["*if EM<1","  *goto Z.T","*else","  *goto Z.F","*label Z.T","I'm sorry. You can only play through this episode if you are employed in a steady job. You can go to the WORK ICON, land a job, and return.","*comment @NTQ","*set instantaneous true","*finish","*label Z.F","In the ladies' room of the office at which you work, you are offered some cocaine to help \"get you through a tough day.\"","*choice mood action","  #APPRECIATIVE","    #SNORT THE WHITE POWDER","      *goto A11","    *selectable_if (false) #PASS ON THE OFFER","      *finish","  #UNSURE","    #SNORT THE WHITE POWDER","      *goto A21","    #PASS ON THE OFFER","      *goto A22","  #NOT INTERESTED","    *selectable_if (false) #SNORT THE WHITE POWDER","      *finish","    #PASS ON THE OFFER","      *goto A32","*label A11","*set OH+4","*set TH%-10","*set SC%+10","SNNNNNNNNIIIIF! Up it goes. Is this something you think you would like to do often?","","","Select an action:","","*choice","  #YES","    *goto B1","  #NO","    *goto B2","*label B1","*if TH<30","  *goto C.T","*else","  *goto C.F","*label C.T","*set OH+3","Be careful. You have a personality that is likely to gravitate toward developing a drug habit.","*finish","*label C.F","*set TH%-20","Be careful. The rush may not be worth the consequences.","*finish","*label B2","*set SC%+20","It looks like you are yielding to quick but potentially dangerous ways of dealing with stress. The coping strategy that you have chosen may be a sign of poor judgment in general. It kind of makes you wonder just how far you might","go...","*finish","*label A21","Does your lack of certainty reflect your concern with how you might look in front of all these people?","","","Select an action:","","*choice","  #YES","    *goto D1","  #NO","    *goto D2","*label D1","*set SC%-10","Maybe you shouldn't be so concerned about fitting in.","*finish","*label D2","*set IN%-10","*set TH%-10","Your response is puzzling.","*finish","*label A22","*set CN%+20","*set IN%+30","Perhaps some of your uncertainty stems from the fact that you want these people to think highly of you. It's a sign of strength to keep yourself from doing impulsive things just for the sake of impressing others.","*page_break","In life, the risks worth taking are usually the ones that bring the most gain to yourself and those around you. In this case, the social gain that people get from \"just fitting in\" does not seem to be justified by the risk of becoming","a \"coke head.\"","*finish","*label A32","*set CN%+20","*set IN%+10","*set SC%+30","You know that using drugs as a coping mechanism can only lead to trouble. Fads like this often have a way of touching a person's life in one way or another. They touch some people harder than others. Snorting up some of the white","stuff seems to become a preoccupation with many people your age. Some people even devote their lives to it.","*finish","",""], "labels":{"z.t":4,"z.f":9,"a11":27,"b1":41,"c.t":46,"c.f":50,"b2":54,"a21":59,"d1":70,"d2":74,"a22":79,"a32":87}}