{"crc":1620910753, "lines":["You have seen your friend Marsha and her husband John socially for a long time. They have a very peculiar relationship. John insists on controlling every aspect of Marsha's life.","*page_break","One day when you are talking to Marsha, she confesses that about three years ago, she began seeing another man -- one who is kind, gentle and loving. She has been thinking about leaving John for this other man but is unsure if she can.","*choice mood action","  #UNCOMFORTABLE","    #DON'T GIVE ANY DIRECT ADVICE","      *goto A11","    #GIVE HER SOME ADVICE","      *goto A12","  #COMFORTABLE","    #DON'T GIVE ANY DIRECT ADVICE","      *goto A21","    #GIVE HER SOME ADVICE","      *goto A22","*label A11","*set TH%+20","This must have been a difficult decision. Giving her advice might mean taking responsibility for a decision that she, alone, should make. Stepping aside might distance you from your friend for a while, but in the end, it is worth it.","*finish","*label A12","*set SC%-10","Advice given under duress is almost always bad advice. Marsha resents you for meddling, regardless of the outcome.","*finish","*label A22","What kind of advice are you going to give her?","","","Select an action:","","*choice","  #SEEK MARRIAGE COUNSELING","    *goto B1","  #CONTINUE THE AFFAIR","    *goto B2","  #DIVORCE JOHN AND MARRY THE OTHER MAN","    *goto B3","  #DIVORCE JOHN AND MARRY NEITHER ONE","    *goto B4","*label B1","*set GN%+20","Marsha tells you that she and John have already been to several marriage counselors. Two marriage counselors got so fed up with John that, for the sake of their OWN sanity, they refused to see the couple anymore. Two others said that the","problem was Marsha's own lack of assertiveness and her desire to be controlled, which Marsha knew anyway but couldn't help. Do you want to give Marsha any more advice?","","","Select an action:","","*choice","  #YES","    *goto C1","  #NO","    *goto C2","*label C2","Good, you've meddled enough as it is!","*finish","*label C1","What advice will you be giving now, Sigmund?","","","Select an action:","","*choice","  #CONTINUE THE AFFAIR","    *goto D1","  #DIVORCE JOHN AND MARRY THE OTHER MAN","    *goto D2","  #DIVORCE JOHN AND MARRY NEITHER ONE","    *goto D3","*label B2","*label D1","*if TR<30","  *goto E.T","*else","  *goto E.F","*label E.T","*set SC%-20","You WOULD recommend something like this. Taking the cowardly, untrustworthy way has long been your trademark in life. Marsha feels uncomfortable doing this and later resents you for making the suggestion.","*finish","*label E.F","Obviously this piece of advice really isn't very good. If Marsha could comfortably continue the affair, she wouldn't be asking for your advice, now, would she?","*finish","*label B3","*label D2","*set SC%-20","Very simple advice. Just like that, pick up a whole relationship, a whole life, and transfer to another. Think about what phase of life you are in now. Chances are John and Marsha have been together for twenty years or more. For a woman","who is used to getting structure and direction from a person like John, this kind of move would be terrifying.","*page_break","Your intentions are good -- you want to see Marsha happier than she is now. Regardless of how a relationship looks to outsiders, when two people stay together, they satisfy SOME kind of need for each other. Believe it or not, she may","actually DESIRE a man who is as domineering as John.","*page_break","Your advice to her is logical, but people often do not act that way. As a result, Marsha's ambivalence turns to anger, which she directs at you for butting into her life.","*finish","*label B4","*label D3","What kind of advice is this? I can't imagine why you would even suggest it, and neither can Marsha. She resents you for butting into her life, and the two of you begin to grow apart.","*finish","*label A21","The sound of breaking glass punctuates your otherwise relaxing afternoon (Marsha is throwing a bit of a fit. You are used to this.) You are glad you don't have to deal with any of this.","*finish","",""], "labels":{"a11":14,"a12":18,"a22":22,"b1":37,"c2":50,"c1":53,"b2":66,"d1":67,"e.t":72,"e.f":76,"b3":79,"d2":80,"b4":90,"d3":91,"a21":94}}