{"crc":1476498717, "lines":["WARNING - THIS EPISODE CONTAINS SUBJECT MATTER OF A SEXUAL NATURE.","Do you wish to continue?","*choice","  #Yes","    *goto sexualEncounter","  #No","    *set instantaneous true","    *finish","*label sexualEncounter","While you are walking down a deserted street, a stretch limosine screeches to a halt by the curb. A woman dressed in a long black overcoat steps out and walks quickly toward you, peering back over her shoulder through large round","sunglasses.","*page_break","She is extremely tall. Leaning over you and resting her trembling hand lightly on your arm, she speaks through a heavy accent in slow halting speech, \"I am a stranger to you, but you must help me. My life and the lives of innocent","others are in great jeopardy.\"","*page_break","She produces a small box addressed to someone in a nearby residential area.","*page_break","\"You must deliver this package. Please be discreet. No police. If police are involved, they will kill again.\"","*page_break","You barely realize what has happened when the woman turns, gets back into the limosine and roars off, leaving you with the package.","*page_break","Seconds later, another long black car speeds by in that direction.","*choice mood action","  #COOPERATIVE","    #DELIVER THE PACKAGE","      *goto A11","    *selectable_if (false) #DO NOT DELIVER THE PACKAGE","      *finish","  #NOT COOPERATIVE","    *selectable_if (false) #DELIVER THE PACKAGE","      *finish","    #DO NOT DELIVER THE PACKAGE","      *goto A22","*label A11","You arrive at the address. It is a huge split-level house with a Rolls Royce, a Jaguar and a Porsche parked in the driveway. You ring the bell, and a tan middle-aged man with silver hair and deep blue eyes comes to the door in a","satin smoking jacket and silk pajama pants. You deliver the package and turn to walk away. He asks if you would like to stop in for a drink.","","","Select an action:","","*choice","  #EXCUSE YOURSELF AND GO HOME","    *goto B1","  #STOP IN FOR A DRINK","    *goto B2","*label B1","*set SC%-10","Suit yourself. Opportunity knocked. You headed out the door.","*finish","*label B2","\"Sit down on the couch and make yourself comfortable.\"","*page_break","He asks you what kind of drink you would like...","","","Select an action:","","*choice","  #SOMETHING MYSTERIOUS/WITH A LITTLE KICK TO IT","    *goto C1","  #SOMETHING COOL AND REFRESHING","    *goto C2","  #SOMETHING HHHHHOT!","    *goto C3","*label C1","*set OH+1","*label C2","*label C3","He fixes your drink and places it down on a long marble table. As you scan the room, you notice expensive-looking art work  -- vases, rugs and sculptures -- on every wall and in every corner. He invites you into the adjoining \"rumpus","room.\" The rumpus room is filled with hunting trophies: a lion's head, some elephant tusks, a zebra skin and some weird-looking tribal masks.","*page_break","The room is dark. He almost seems to float from one room to another. You are seated next to him.","","","Select an action:","","*choice","  #EXCUSE YOURSELF AND LEAVE","    *goto D1","  #STICK AROUND FOR A WHILE","    *goto D2","*label E2","*label D1","*set TH%+30","Get the feeling that sticking around might have made you a permanent part of the rumpus room? Sometimes being paranoid can save your own rumpus, so to speak.","*finish","*label D2","The man turns to you and tenderly touches your face. \"You have done well, my little messenger of mercy. Passion is the only thing that exceeds my gratitude.\"","","","Select an action:","","*choice","  #BECOME HIS WILD JUNGLE SAVAGE","    *goto E1","  #EXCUSE YOURSELF","    *goto E2","*label E1","*set TH%-20","He places his drink down on the table and reaches out for your eager embrace.","*page_break","He barely touches you before he lets out a blood-curdling, \"YIIIIIIIIIII!!!\" and collapses, whispering, \"Poison.\"","*page_break","Two men in black body stockings appear from behind the furniture. They grab you and tie you to a post in the center of the room.","*page_break","One of the men walks right up to you, presses his lips against yours and says, \"Where are the letters? Talk or die a thousand deaths.\"","","","Select an action:","","*choice","  #CONFESS","    *goto F1","  #TELL HIM YOU JUST CAME TO DELIVER A PACKAGE","    *goto F2","  #SPIT IN HIS EYE","    *goto F3","*label F1","*set TH%-10","*set TR%+20","Confess to what? Whatever it is you say, he doesn't believe you.","*goto G","*label F2","*set TH%-10","He doesn't believe you. He says he knows you are part of The Coalition of Seven.","*goto G","*label F3","*set GN%-10","\"Your viciousness only makes me want to kill you even more,\" he says.","*label G","*page_break","\"You have thwarted the revolution for the last time. After the Berlin Incident, we vowed to crush The Coalition of Seven.\"","*page_break","The man pulls out a chrome-plated revolver and presses it to your neck. You gasp as... the trigger clicks... and...","*page_break","YOU SIT STRAIGHT UP IN BED! You've got to stop reading those cheap spy romance novels before going to bed.","*finish","*label A22","*set SC%-20","What a human being. Little do you know -- you might have just passed up the opportunity of a lifetime!","*finish","",""], "labels":{"sexualencounter":8,"a11":33,"b1":45,"b2":49,"c1":64,"c2":66,"c3":67,"e2":81,"d1":82,"d2":86,"e1":97,"f1":117,"f2":122,"f3":126,"g":129,"a22":137}}