{"crc":2014097991, "lines":["A neighbor approaches you and asks if you would like to make some extra money doing yard work. You evaluate the job: It is back-breaking work for a $10.00 per week payoff.","*choice mood action","  #INTERESTED","    #ACCEPT THE RESPONSIBILITY","      *goto A11","    *selectable_if (false) #REJECT THE RESPONSIBILITY","      *finish","  #DISINTERESTED","    *selectable_if (false) #ACCEPT THE RESPONSIBILITY","      *finish","    #REJECT THE RESPONSIBILITY","      *goto A22","*label A11","*set TH%+30","*set VC%+10","*set PH%+10","After your third week of work, your friends plan a trip to the mall and ask if you would like to come along. Jamie's mother will be driving, but the trip will occur during the time when you usually do the yard work. There is no way you","can squeeze the two events in on the same day, and still do a good job on the lawn. You can:","","","Select an action:","","*choice","  #REFUSE THE TRIP TO THE MALL","    *goto B1","  #DO A QUICK JOB ON THE LAWN AND HOPE NOBODY NOTICES","    *goto B2","  #ASK YOUR NEIGHBOR IF HE WOULD MIND NOT HAVING HIS LAWN DONE","    *goto B3","*label B1","*set TH%+40","You stay and do your yard work like a responsible person. At this point, how much money are you putting away in the bank every week?","","","Select an action:","","*choice","  #ABOUT TWO DOLLARS","    *goto C1","  #ABOUT FOUR DOLLARS","    *goto C2","  #MORE THAN FOUR DOLLARS","    *goto C3","*label C1","*label C2","*label C3","*if TH<70","  *goto E.T","*else","  *goto E.F","*label E.T","You lack the self-control to do any real saving. Like most children, you are quick to dip into your savings for little pleasures. You have, however, shown good attitudes toward responsibility, which will help you with work later on.","*finish","*label E.F","*set TR%+20","*set MN+400","Your savings habits are admirable. You will accumulate $400 that you will bring with you into the next module.","*finish","*label B2","Somebody DOES notice, and as a result spends the rest of the afternoon finishing the job you started. You are fired from your first job after three short weeks.","*finish","*label B3","*temp randomM","*rand randomM 1 2","*if randomM=1","  *goto M1","*else","  *goto M2","*label M1","*set VC%-10","He doesn't mind. He simply asks your best friend who is happy to take the job and the money. He does a much better job on the lawn and gets the job full time. You are replaced.","*finish","*label M2","*set VC%-10","He asks the boy down the block who does a much better job and is willing to take $9.00. You are replaced.","*finish","*label A22","*set VC%-10","Work is not for you right now. That's O.K., but you have just passed up an opportunity to collect some resources.","*finish","",""], "labels":{"a11":12,"b1":29,"c1":43,"c2":44,"c3":45,"e.t":50,"e.f":53,"b2":58,"b3":61,"m1":68,"m2":72,"a22":76}}