{"crc":1522678913, "lines":["While you are out having cocktails with ${loverName} you encounter, Dr. Rex Nicholson, an old beau of ${loverName}'s, and Chief of Neurosurgery at Memorial Hospital. He flashes his pearly white teeth (for which he paid his friend, the dentist, a pretty","penny) at ${loverName} and walks over, twirling the keys to his brand new Mercedes around his index finger.","*page_break","\"Fancy running into you here, gorgeous. Mind if I kill some time waiting for Suzie to catch up with me?\" ${loverName} seems to melt, introduces the two of you, and asks if you wouldn't mind the intrusion. What will you do?","","","Select an action:","","*choice","  #SAY, \"ACTUALLY I DO MIND, WE WERE DISCUSSING SOMETHING IMPORTANT\"","    *goto A1","  #INVITE HIM TO SIT DOWN","    *goto A2","  #MAKE A FACE AND ACCEPT RELUCTANTLY","    *goto A3","*label A1","*set SC%-40","Please, rush right out and pick up a copy of Miss Manners' latest book. You are REALLY going to need it! I can understand why you might feel a little threatened, but ${loverName} sees your behavior as rude and boorish. Dr. Rex does leave the two","of you alone (he seems to know everyone at the bar), but the result is that ${loverName} sees you as a clod.","*finish","*label A2","*set SC%+10","As the conversation evolves, you notice ${loverName} is absolutely captivated by him. He makes several comments, including one rather annoying one, which is, \"I hope you realize what a lucky man you are, Sport. She's terrific in every way, and I","mean EVERY way.\" ${loverName} giggles and says, \"Rex, stop. You're embarrassing me.\" After a few drinks, Suzie, Rex's date, shows up.","*page_break","You recognize her from the covers of several fashion magazines. Within five minutes he is groveling at her feet. Every man has his Achilles heel, eh, Sport? Rex graciously picks up your tab for drinks and also dinner, then Suzie leads him","away on what appears to be an invisible leash.","","","Select an action:","","*choice","  #POINT OUT HOW GOOGLY-EYED ${LOVERNAME} WAS IN HIS PRESENCE","    *goto B1","  #KEEP QUIET ABOUT THE INCIDENT","    *goto B2","*label B1","*set CN%+30","\"True,\" she says. \"But to tell you the truth, when he talks I try my best to tune him out completely. He's all fancy wrapping and pretty bows, but once you open the present there's really nothing inside.\" She'll take you over him any day.","*finish","*label B2","*set CN%-20","Too bad. You might have found out something really flattering about yourself.","*finish","*label A3","*set CN%-20","Tsk! Tsk! Watch yourself. That green-eyed monster is rearing his ugly head. No, not Dr. Rex. That green-eyed monster Jealousy.","*finish","",""], "labels":{"a1":15,"a2":20,"b1":36,"b2":40,"a3":44}}