{"crc":-1388597234, "lines":["${loverName} has often spoken about her baby sister, Michelle, who goes to college in another state. She would like you to meet her, and then the three of you could go out together for dinner. Are you agreeable to this?","","","Select an action:","","*choice","  #YES","    *goto A1","  #NO","    *goto A2","*label A2","*finish","*label A1","As it turns out, Michelle is quite beautiful -- sparkling blue eyes, and thick black hair that falls in large swirls down her neck and shoulders. She is young, innocent and exotic-looking. She is also very friendly, immediately","establishing a \"brotherly\" relationship with you by hooking her arm in yours as the three of you walk around town, laughing and having a good time.","*page_break","The attention you receive from this beautiful young girl is flattering, and ${loverName} notices it. She makes a hostile \"hands-off\" remark (as a joke, of course) to her sister, who apparently ignores it. What will you do?","","","Select an action:","","*choice","  #SIT BACK AND ENJOY THE BICKERING AND EXTRA ATTENTION","    *goto B1","  #INTERCEDE AND TELL ${LOVERNAME} TO STOP BEING SO HARD ON HER SISTER","    *goto B2","  #SHY AWAY FROM MICHELLE TO SATISFY ${LOVERNAME}","    *goto B3","*label B1","*set TH%-20","*set CN%+30","I guess it feels pretty good having two women fighting for your attention. However don't expect anything romantic from ${loverName} later. She will tell you, \"Why don't you try that on Michelle, if you like her so much?\" It becomes clear that","${loverName} feels threatened by Michelle's youthful beauty. What will you do?","*label D","","","Select an action:","","*choice","  #TELL HER THAT YOU PREFER HER TO MICHELLE","    *goto C1","  #POINT OUT TO HER THAT SHE IS FEELING THREATENED","    *goto C2","  #DO NOTHING","    *goto C3","  #SHOW HER THAT YOU WOULD MUCH PREFER A SEXY WOMAN WITH MORE EXPERIENCE","    *goto C4","*label C1","*set HP%-20","\"Of course, that's what you SAY, but it certainly isn't the way you ACTED tonight. The two of you were ALL OVER ONE ANOTHER!\" You are going to have to let her blow off some steam about this one.","*finish","*label C2","*set TH%-10","\"When I want analysis, I'll talk to my shrink about it!\" she says. Off-the-cuff interpretations like these, even when they are accurate, are likely to turn people off. Perhaps you should have been more sensitive to the problem, rather","than try to cure it.","*finish","*label C3","*set TH%+40","*set SC%+20","Not a bad idea. Letting her blow off some steam causes her to realize that she was feeling overly threatened by her sister's youthful beauty. Eventually, she comes around and admits her jealousy.","*finish","*label C4","*set TH%+60","*set SC%+40","*set IN%+40","A brilliant response, for two reasons. First, you didn't patronize her by saying she was better-looking than her sister (even if she IS better looking than her sister, the fact that she acted so threatened indicates that she really","doesn't think so).","*page_break","Second, you showed her the object of your true desire, dispelling her belief that you were probably fantasizing about having a romantic experience with her sister (which you probably were, but I'll never tell!)","*finish","*label B2","*set IN%-20","Big mistake! You have reinforced ${loverName}'s fear of you allying with her sister and ignoring or neglecting her. I hope you weren't planning on trying anything romantic with ${loverName} tonight.","*finish","*label B3","Some might say this is a wimpy way out of the situation, but those same people probably spend a lot of lonely nights at home. Later that night, ${loverName} admits that she feels threatened by Michelle's youthful beauty. What will you do?","*goto D","",""], "labels":{"a2":10,"a1":12,"b1":28,"d":33,"c1":47,"c2":51,"c3":56,"c4":61,"b2":70,"b3":74}}