{"crc":1439058063, "lines":["You and a group of your friends are getting together to go to a movie. Your best friend and his date are picking you up at your house, and the three of you are meeting everyone else, including your own date, at the theater. The","doorbell rings, and you are greeted by a dark-haired beauty with sparkling eyes and a devastating figure.","*page_break","She smiles at you and tells you her name is Cheryl. Your friend is waiting in the car because he isn't feeling well. In the car and at the movies, you and Cheryl make small talk. After all, your best friend isn't feeling up to par.","You wouldn't want Cheryl to have a lousy time and resent him.","*page_break","Besides, your date seems to be so engrossed in the movie, she doesn't seem to mind, either. Midway through the movie, your friend pulls you aside and asks if you wouldn't mind taking Cheryl home. He knows she is enjoying the movie and","he is feeling too ill to stay.","*choice mood action","  #COMPASSIONATE (FEELING SORRY FOR FRIEND)","    #TAKE CHERYL HOME","      *goto A11","    *selectable_if (false) #TELL HIM TO TAKE HER HOME HIMSELF","      *finish","  #DISPASSIONATE (NOT FEELING SORRY FOR FRIEND)","    *selectable_if (false) #TAKE CHERYL HOME","      *finish","    #TELL HIM TO TAKE HER HOME HIMSELF","      *goto A22","*label A22","*set SC%-20","He can't understand why you won't do him this small favor. Can anyone be THAT insensitive? On the other hand, perhaps you refused because you couldn't trust yourself alone with sexy Cheryl. Your relationship with your friend is","temporarily upset.","*finish","*label A11","What will you do?","","","Select an action:","","*choice","  #TAKE YOUR DATE HOME FIRST","    *goto B1","  #TAKE CHERYL HOME FIRST","    *goto B2","*label B2","Cheryl says goodbye to your date and asks if you would walk her to the door. She kisses you on the cheek. You think you feel her finger poke something into your back pocket. Later that evening, you discover that Cheryl slipped you a","piece of paper with her phone number on it.","","","Select an action:","","*choice","  #CALL HER","    *goto C1","  #RIP THE PAPER UP","    *goto C2","*label C1","*set TR%-20","When you call her, she sounds very aloof. She feels guilty about coming on to you and wishes you would forget about the whole thing. That's life! You almost sold out on your best friend for this girl.","*finish","*label C2","*set TR%+50","*set GN%+50","*set IN%+40","Two displays of loyalty to your friend in one night! You could have taken Cheryl home last and had a romantic interlude with her. You could also have gotten together with her some other time, particularly after you knew she was","interested in you. You are a good friend and will probably go far in the world.","*finish","*label B1","With you and Cheryl alone in the car, Cheryl mentions what a great friend you must be and thanks you for being so considerate all the way around. She invites you inside her house for a few minutes.","","","Select an action:","","*choice","  #GO INSIDE","    *goto D1","  #GO BACK HOME","    *goto D2","*label D2","*set TR%+30","You deserve a pat on the back for avoiding the obvious dilemma. Whether you know it or not, Cheryl had the hots for you. When you get back home, your date is waiting for you by the door. She left her purse in the car and can't get","into her house without it. You bring her home and she invites you in. Let's take it from the top...!","*finish","*label D1","*set TH%-30","Cheryl gets you a cold drink and sits down next to you on the couch. She jokes that she feels as if YOU were her date for tonight. After all, you took such good care of her.","*page_break","She thanks you again and kisses you on the cheek. After she kisses you, she keeps her face close to yours. She looks at you for a long second and begins to bring her lips up close to yours.","","","Select an action:","","*choice","  #KISS HER","    *goto E1","  #STOP HER FROM KISSING YOU","    *goto E2","*label E2","*set TR%+30","You did a valiant thing. The next day you mention the event to your friend. He tells you, \"You should have 'gone for it.' After all, what are friends for?\" Sometimes life is pretty tough to figure out.","*finish","*label E1","*set TR%-30","One kiss leads to another, and another, and another. You are completely taken in by Cheryl's advances, and you leave exhausted. Will you ever mention this incident to your date or your friend?","","","Select an action:","","*choice","  #YES","    *goto F1","  #NO","    *goto F2","*label F2","*finish","*label F1","Will you mention it to your date?","","","Select an action:","","*choice","  #YES","    *goto G1","  #NO","    *goto G2","*label G1","*if SR>0","  *goto H.T","*else","  *goto H.F","*label H.T","*set GF 0","*set SR 0","*set ES 0","*set LT 0","${loverName} feels as if she can no longer trust you. She breaks off with you. Honesty may be the best policy, but it doesn't always prevent you from getting yourself into trouble.","*goto P","*label H.F","She is not thrilled with the news, but, then again, you aren't going steady with her, so she can't tell you what you did was wrong. Since you weren't going steady with anyone, it seems like you had a need to punish yourself in this","situation. Perhaps you should have concentrated more on telling your friend.","*goto P","*label G2","*set TR%-10","She never finds out.","*label P","*page_break","Do you mention it to your friend?","","","Select an action:","","*choice","  #YES","    *goto I1","  #NO","    *goto I2","*label I1","*set TR%-10","*set SC%-30","He is thrown into a state of emotional turmoil. How could you do this to him? Your honesty is touching, but it puts a strain on your relationship with him. Your friend becomes upset with Cheryl and never asks her on a date again.","Cheryl becomes upset with you for opening your mouth and never wants to speak to you again. Do you think it was worth all this?","","","Select an action:","","*choice","  #YES","    *goto J1","  #NO","    *goto J2","*label J1","She must have been some kisser.","*finish","*label J2","I don't blame you.","*finish","*label I2","*set SC%-30","Your friend finds out anyway. Cheryl is the type who seduces and tells. He doesn't want anything to do with you ever again.","*finish","",""], "labels":{"a22":19,"a11":24,"b2":35,"c1":47,"c2":51,"b1":58,"d2":69,"d1":74,"e2":88,"e1":92,"f2":104,"f1":106,"g1":117,"h.t":122,"h.f":129,"g2":133,"p":136,"i1":148,"j1":162,"j2":165,"i2":168}}