{"crc":-776983972, "lines":["Mr. Quincy is the toughest teacher in your school. One day, you forget to put your homework in with the rest of the items you need for school. Quincy asks where your homework is. You tell him you forgot it. He says, \"Come on, now.","You can be more creative than that.","*page_break","Why don't you tell me something more BELIEVABLE, like, 'Mr. Quincy, I did my homework, but my dog threw up on it.'\" Everyone in class laughs hard at your expense. Mr. Quincy gives you a punishment assignment to do in addition to","the work you have not handed in. He says, \"What have you got to say for yourself, now, Mister?\"","*choice mood action","  #ANGRY","    #SAY \"$%&^$ YOU, MR. Q.\" UNDER YOUR BREATH","      *goto A11","    #SAY NOTHING","      *goto A12","    #TRY TO ENLIST YOUR MOTHER'S HELP","      *goto A13","  #DEPRESSED","    *selectable_if (false) #SAY \"$%&^$ YOU, MR. Q.\" UNDER YOUR BREATH","      *finish","    #SAY NOTHING","      *goto A22","    #TRY TO ENLIST YOUR MOTHER'S HELP","      *goto A23","  #UNAFFECTED","    *selectable_if (false) #SAY \"$%&^$ YOU, MR. Q.\" UNDER YOUR BREATH","      *finish","    #SAY NOTHING","      *goto A32","    *selectable_if (false) #TRY TO ENLIST YOUR MOTHER'S HELP","      *finish","*label A11","*set GN%-10","*set IN%-10","Mr. Quincy doesn't hear you, but that nerdy Joey Robinson does. He says, \"Oooooooh, Mister Quuuuinceeee, He just said a baaaad word.\" Quincy uses this as an opportunity to suspend you. You lose out on school time and your","Intellectual sphere drops.","*finish","*label A12","*set HP%-10","You were treated unfairly, yet you chose to keep it to yourself. Chances are you will be in a lousy mood for the rest of the day. You might even take your anger out on someone who really doesn't deserve it.","*finish","*label A13","*set FM%-10","*if ST>0","  *goto B.T","*else","  *goto B.F","*label B.T","Your mother is the type who believes that if you get into trouble in school, you deserve it. You get no sympathy from her, especially if you are acting so angry.","*finish","*label B.F","*set FM%+30","*set IN%+10","Your mother sympathizes with you, but explains that there isn't much you can do with teachers like this. She recommends that you be as patient with him as possible.","*finish","*label A23","*set FM%+20","You look so pitiful and confused that it infuriates your mother. She sends a note to the school and follows it up with a personal visit. She receives a personal apology from Quincy, but you don't.","*page_break","Everytime he speaks to you from now on, he does it with a tone of sarcasm and false respect. There is definitely something wrong with this man.","*finish","*label A22","*set HP%-10","You have been unfairly treated, and you have let it get you down. Children often feel powerless when they are treated like this by adults. Hopefully, you will keep this in mind for later.","*finish","*label A32","*set CN%+10","You must think that jerks like this are not worth getting upset about. This may be true, but the fact is you let him belittle you. If this happens enough times without you behaving assertively, you will develop a poor attitude about","yourself and EXPECT this kind of treatment from everyone.","*finish","",""], "labels":{"a11":27,"a12":33,"a13":37,"b.t":43,"b.f":46,"a23":51,"a22":57,"a32":61}}