{"crc":-1861644020, "lines":["Your wife has accepted an invitation for the two of you to dine with friends of hers from high school that you ABSOLUTELY HATE. Tammy, an ex-cheerleader, is still childish and giggly, and wears her hair in pigtails. Hank, her husband,","chews with his mouth open and likes to talk about his and Tammy's sexual exploits in public.","","","Select an action:","","*choice","  #GET ANGRY AT YOUR WIFE FOR MAKING THE DATE WITHOUT TALKING TO YOU ABOUT IT","    *goto A1","  #ABSOLUTELY REFUSE TO GO","    *goto A2","  #GO AND TOLERATE YOUR WIFE'S FRIENDS JUST TO MAKE HER HAPPY","    *goto A3","*label A1","*set GN%-20","What will you ultimately do as a result of your anger?","","","Select an action:","","*choice","  #PROBABLY WIND UP GOING","    *goto B1","  #STAY HOME","    *goto B2","*label B2","*set MP+1","Your wife becomes upset and begins to cry. What will she tell her friends?","*finish","*label B1","Will you try to make her feel guilty about it?","","","Select an action:","","*choice","  #YES, DEFINITELY","    *goto C1","  #NO","    *goto C2","*label C1","*set MP+1","That's not very nice.","*goto A3","*label C2","*set TH%+30","That's very big of you.","*label A3","*label G1","When you arrive, Hank and Tammy greet you. They are serving English Muffin pizzas for dinner. As you walk into the dining room, Hank stares right at your wife's bottom and mentions that she looks like she has \"nice, tight buns, heh, heh.\"","You can:","","","Select an action:","","*choice","  #THREATEN TO PUNCH HANK SQUARELY IN THE MOUTH IF HE CONTINUES ALONG THESE LINES","    *goto E1","  #ASK HANK IF HE WOULD BE KIND ENOUGH TO EVOLVE INTO A FORM THAT DOESN'T DRAG ITS KNUCKLES ON THE FLOOR WHEN IT WALKS","    *goto E2","  #IGNORE HIM","    *goto E3","*label E1","*set HP%+10","This causes a loud argument. It is a perfect excuse to end the night early. Your wife begins to realize that they aren't the type of people worth socializing with.","*finish","*label E2","Of course he doesn't understand what you are talking about, but he senses you have put him down. He is not intelligent enough to think of a response so he just ignores you for the rest of the night. No great loss.","*finish","*label E3","Unfortunately, he only gets worse. You can:","","","Select an action:","","*choice","  #PULL YOUR WIFE ASIDE AND TELL HER YOU WANT TO GO BEFORE YOU EXPLODE","    *goto F1","  #TOLERATE IT","    *goto F2","*label F1","*set HP%+10","*set TH%+30","Your wife doesn't remember Hank being this bad, but certainly understands. You'll never go back there again.","*finish","*label F2","*set TH%-10","*set IN%-10","How can you tolerate this kind of degrading comment directed at your wife? Either you are a wimp, or you and Hank are two of a kind. Get with it.","*finish","*label A2","This puts your wife in a difficult position, since she already accepted. Can't you forgive her and go along, just this once?","","","Select an action:","","*choice","  #\"O.K.\"","    *goto G1","  #\"NO WAY\"","    *goto G2","*label G2","*set GN%-10","Just wait until the next time you want to go to dinner at YOUR friend's house.","*finish","",""], "labels":{"a1":13,"b2":25,"b1":29,"c1":40,"c2":44,"a3":47,"g1":48,"e1":62,"e2":66,"e3":69,"f1":80,"f2":85,"a2":90,"g2":101}}