{"crc":-457058763, "lines":["While being taken to the park, your dad meets an old college buddy who is wheeling a baby about your age. As the two dads talk, you casually begin to eye the baby in the other carriage.","*choice mood action","  #INDIFFERENT","    #DO NOTHING","      *goto A11","    #PUT YOUR FINGER NEAR THE OTHER BABY'S FACE","      *goto A12","  #CURIOUS","    *selectable_if (false) #DO NOTHING","      *finish","    #PUT YOUR FINGER NEAR THE OTHER BABY'S FACE","      *goto A22","  #AGGRESSIVE","    *selectable_if (false) #DO NOTHING","      *finish","    #PUT YOUR FINGER NEAR THE OTHER BABY'S FACE","      *goto A32","*label A11","*set SC%-20","Snob! You are able to get away with these terrible manners now, but soon you will find that one must learn how to socialize properly.","","","Select an action:","","*choice","  #BECOME FRIENDLIER","    *goto B1","  #REMAIN SNOBBY","    *goto B2","*label B2","Your rigid style of behavior may interfere with your ability to make adequate social contacts in later life.","*finish","*label A22","A baby! You wonder if it has all the same parts as you.","","","Select an action:","","*choice","  #TOUCH THE BABY'S FACE","    *goto C1","  #TOUCH THE BABY'S ARM","    *goto C2","*label C1","*label A12","You poke the other baby right in the eye. He starts to cry. Your father is slightly embarrassed. The other dad is worried that his little baby is not macho enough to take a little poke.","","","Select an action:","","*choice","  #PAT THE OTHER BABY TO CALM HIM DOWN","    *goto D1","  #LEAVE THE BABY ALONE","    *goto D2","*label D1","*label B1","It doesn't work. Geez! This kid is a CRYBABY. You are learning that sometimes no matter how nice you are to some people they just don't appreciate it. Your dad moves you away from the other baby and gives you a cookie to keep you","occupied. At least he appreciates your empathy.","*set SC%+30","*set EX%+30","*finish","*label D2","Why waste your time being nice to an overly-sensitive baby? You could have tried a little harder to be nice to him, but it wouldn't have been worth it.","*finish","*label C2","The baby touches you back. You are exploring the environment and learning about one another. This causes your Intellectual and Social spheres to increase. You seem to like one another. You've made your first friend!","*set IN%+20","*set SC%+20","*finish","*label A32","You want to test what this baby is made of, so you hit it in the face.","*set PH%+15","*temp randomE","*rand randomE 1 2","*if randomE=1","  *goto E1","*else","  *goto E2","*label E1","The baby starts to cry. You have no sympathy for it.","","","Select an action:","","*choice","  #HIT IT AGAIN","    *goto F1","  #LEAVE IT ALONE","    *goto F2","*label F1","The baby is screaming from fright and you are enjoying all of the commotion you have caused. The two dads are too busy reminiscing to break up the fracas. Your aggression traits have increased. You will one day learn that all people","aren't this easy to intimidate.","*set GN%-20","*finish","*label F2","You've caused enough trouble for one day. How do you feel now that you know you've disrupted this poor baby's entire afternoon?","","","Select a mood:","","*choice","  #GUILTY/REMORSEFUL","    *goto G1","  #FINE","    *goto G2","*label G1","*set TH%+20","That's a good sign. We'll see if this prevents you from doing something this impulsive in the future.","*finish","*label G2","You are too young to understand the definition of a bully -- but that's what you are becoming. Perhaps if your dad paid more attention to you, your behavior wouldn't be so inappropriate.","*finish","*label E2","BAM! You get bopped on the head with the other baby's bottle. The surprise of retaliation keeps you under control for the rest of the interaction. I hope you have learned your lesson.","*finish","",""], "labels":{"a11":17,"b2":29,"a22":32,"c1":43,"a12":44,"d1":55,"b1":56,"d2":62,"c2":65,"a32":70,"e1":79,"f1":90,"f2":95,"g1":106,"g2":110,"e2":113}}