{"crc":1662546411, "lines":["${loverName}'s sister, Loretta has arrived in town unexpectedly, on the night that you have a date with ${loverName}. ${loverName} asks if you wouldn't mind her tagging along for the evening.","","","Select an action:","","*choice","  #TAKE LORETTA ALONG","    *goto A1","  #TELL HER THAT YOU WOULD RATHER SEE HER ALONE EVEN IF IT MEANS POSTPONING THE DATE","    *goto A2","*label A2","*set CN%+10","Suit yourself. Blood is thicker than water, you know. ${loverName} says she'll see you around sometime. She thinks you are being unfair.","*finish","*label A1","*set SC%+30","Loretta is the domineering type. She takes control of the evening almost immediately after the introductions are made. You and ${loverName} want to go to dinner at a Chinese restaurant. Loretta prefers Italian. In order to appease her","sister ${loverName} convinces you that Italian would be best.","*page_break","During the meal you would like to order white wine, but Loretta jumps in and orders a very expensive bottle of red wine. Loretta also orders three main courses, truffles for dessert, and enough after-dinner drinks to anesthetize a horse.","*page_break","Throughout the evening, the conversation is monopolized by Loretta, who is fond of picking on things you say that she doesn't agree with, then whispering snide comments to ${loverName}, who looks very uncomfortable throughout the whole affair.","When the waiter arrives with the check you can:","","","Select an action:","","*choice","  #PICK UP THE TAB","    *goto B1","  #ANNOUNCE THAT YOU ARE ONLY PAYING FOR YOU AND ${LOVERNAME}","    *goto B2","  #ANNOUNCE THAT EVERYONE IS GOING \"DUTCH\"","    *goto B3","*label B1","*set SC%+30","You are a true gentleman. ${loverName} offers to pay for herself and her sister.","","","Select an action:","","*choice","  #ACCEPT THE OFFER","    *goto C1","  #REJECT THE OFFER POLITELY","    *goto C2","*label C1","You offered once, right? After ${loverName} picks up the check, Loretta says in a loud stage whisper, \"...and he's CHEAP, too!\"","*finish","*label C2","Loretta thanks you, but mentions that it is difficult to find really good Italian food anywhere these days.","*finish","*label B2","*set GN%-10","\"Hrrrrrmph!\" the sister snorts. \"You told me that he was kind and generous. What a CHEAPSKATE!\" she sneers.","","","Select an action:","","*choice","  #GIVE HER A PIECE OF YOUR MIND","    *goto D1","  #IGNORE HER","    *goto D2","*label D2","*if TR<70","  *goto E.T","*else","  *goto E.F","*label E.T","You don't have the impulse control necessary to do that.","*label D1","*set GN%-20","You make sure to chronicle every social indiscretion she has commited throughout the course of the evening, including the fact the she passed wind during the main course, and failed to excuse herself. ${loverName} apologizes for","the whole evening, and the two of you part, barely speaking with one another the entire evening.","*if MS>0","  *goto F.T","*else","  *goto F.F","*label F.T","You should have stayed home with your wife tonight.","*label F.F","*finish","*label E.F","This is extremely difficult to do, but you have the impulse control necessary to accomplish it. You are a true gentleman. Later in the evening, after you drive ${loverName} and Miss Manners home, you get a telephone call, thanking you","for your patience.","*finish","*label B3","*set GN%-10","${loverName}, who had been previously quiet and reserved, looks at her sister incredulously and the both of them cry out in unison: \"CHEAPSKATE!\" Blood is thicker than water, you know. Both of them storm out of the retaurant","leaving you stuck with the tab.","*if MS>0","  *goto G.T","*else","  *goto G.F","*label G.T","*page_break","You should have stayed home with your wife tonight.","*label G.F","*finish","",""], "labels":{"a2":10,"a1":14,"b1":34,"c1":46,"c2":49,"b2":52,"d2":64,"e.t":69,"d1":71,"f.t":79,"f.f":81,"e.f":83,"b3":87,"g.t":95,"g.f":98}}