{"crc":-619964309, "lines":["*if AG < 13","  Sorry, you're still too young for this experience.  Come back later.","  *set instantaneous true","  *finish","*elseif AG > 14","  Sorry, you're too old for this experience.","  *finish","Just when things have really begun to take off with you and ${loverName}, an old girl friend calls up, and begs to speak with you, or see you \"just one more time.\"","","","Select an action:","","*choice","  #SEE HER","    *goto A1","  #TELL HER FIRMLY THAT \"IT'S OVER\"","    *goto A2","*label A1","*if TR>70","  *goto B.T","*else","  *goto B.F","*label B.T","Your Trustworthy characteristic shows that you can have an intelligent conversation with your \"ex\" and still maintain your loyalty to ${loverName}.","*finish","*label B.F","Your Trustworthy characteristic shows that you might have some conflicts regarding your loyalty to ${loverName}.","*if TH<40","  *goto C.T","*else","  *goto C.F","*label C.T","Your level of impulsiveness suggests that you would not be able to resist the advances she makes. The old flame is rekindled. You can:","*label GIVE/RES","","","Select an action:","","*choice","  #GIVE IN TO THE ADVANCES MADE BY YOUR OLD GIRL FRIEND","    *goto D1","  #RESIST HER","    *goto D2","*label D1","${loverName} eventually finds out and asks you to make a choice. Who would you rather be with?","","","Select an action:","","*choice","  #YOUR FORMER GIRL FRIEND","    *goto E1","  #${LOVERNAME}","    *goto E2","*label E1","*set HP%-20","*set GF 0","*set SR 0","After three weeks, everything that caused the two of you problems the first time, causes even more headaches this time around. Have you forgotten that the two of you really can't stand one another? Don't even think about going back","to ${loverName}.","*finish","*label E2","*set TR%-10","She takes you back, but never completely trusts you again.","*finish","*label C.F","Your level of impulsiveness suggests that you have the self-control necessary to resist her. Your old girlfriend comes on to you strongly, promising that if the two of you ever got back together, things would be totally different.","*goto GIVE/RES","*label A2","*label D2","*set TR%+20","*set TH%+40","Why tempt yourself with something that is certain to open up a closet full of old skeletons?  You have made a healthy separation and no longer wish to be involved with your \"ex.\" Seeing her would only reinforce the fact that you still need each other, in","which case she might never stop calling on you for help, favors, etc.","*finish","",""], "labels":{"a1":17,"b.t":22,"b.f":25,"c.t":31,"give/res":33,"d1":43,"e1":54,"e2":61,"c.f":65,"a2":68,"d2":69}}