{"crc":413606345, "lines":["It is springtime and love is in the air. You have been thinking about Suzie Marsh night and day, and have finally mustered the courage to write her a love letter. Suzie is every boy's dream. She's only ten, but she has the body of","an eleven-year-old. You have the letter in your hand.","*choice mood action","  #CONFIDENT","    *selectable_if (false) #THROW THE NOTE AWAY","      *finish","    *selectable_if (false) #GIVE THE NOTE TO HER FRIEND TO DELIVER","      *finish","    *selectable_if (false) #LEAVE IT IN HER BOOK","      *finish","    #WALK RIGHT UP AND GIVE IT TO HER","      *goto A14","  #HESITANT/AMBIVALENT","    #THROW THE NOTE AWAY","      *goto A21","    #GIVE THE NOTE TO HER FRIEND TO DELIVER","      *goto A22","    #LEAVE IT IN HER BOOK","      *goto A23","    *selectable_if (false) #WALK RIGHT UP AND GIVE IT TO HER","      *finish","*label A22","*set SC%-10","*set HP%-10","You swear her friend to secrecy and she agrees. Unfortunately, all the girls are extremely jealous of Suzie. The friend uses the letter to tease Suzie (saying \"He wants to tell you how much he wants to LUUUUV you and KIIIISS","you!\"), and as a result she ignores you.","*finish","*label A21","*set HP%-10","You throw the note away. You are the cause of your own unrequited love. For weeks you suffer from the thought that Suzie will slip through your fingers. One day, she asks if she could borrow a pen.","*page_break","You get so nervous that before you can take it out of your pocket, all the other boys get there first, and the top of her desk looks like an aisle in the corner stationery store.","*finish","*label A23","Were you brave enough to sign the letter?","","","Select an action:","","*choice","  #YES","    *goto C1","  #NO","    *goto C2","*label C1","*set SC%-10","Too bad--she thinks that you are WEIRD and ignores you.","*finish","*label C2","Good. When she sees the note she thinks that whoever wrote it must be very WEIRD.","*finish","*label A14","*set CN%+20","*set SC%+10","I like your style!","*if SC>75","  *goto D.T","*else","  *goto D.F","*label D.T","According to your status sheet your social skills are strong. Suzie is flattered, but regrets to inform you that you are simply not her type. How do you feel about this?","","","Select a mood:","","*choice","  #\"NO BIGGIE\"","    *goto E1","  #\"I'M CRUSHED\"","    *goto E2","*label E1","*set CN%+50","I thought so. There are plenty of fish in the sea. At least you gave it your best shot. Next time, try a more direct approach. Your handwriting is horrible.","*finish","*label E2","*set CN%-10","It seems that your social skills are just a cover-up for a lack of confidence. You are the type who does things for other people and not yourself. Examine this in yourself and see if it makes sense to you.","*finish","*label D.F","*set CA%+10","*set SC%+20","*set CN%+10","Your status sheet suggests that you have neither the social skills nor the confidence to pull this off successfully. Suzie thinks you are WEIRD and ignores both you and your letter. You get lots of credit for trying.","Social sphere goes up and anxiety decreases as you realize that things aren't so bad when you know you've given it your best shot.","*finish","",""], "labels":{"a22":21,"a21":27,"a23":33,"c1":44,"c2":48,"a14":51,"d.t":59,"e1":70,"e2":74,"d.f":78}}