{"crc":274615040, "lines":["You are eating at the house of one of your parent's friends. You were told by your mother to be on your BEST BEHAVIOR. Something that you ate has disagreed with you and now you feel very sick.","*choice mood action","  #QUEASY","    #IGNORE IT","      *goto A11","    #THROW UP AND GET IT OVER WITH","      *goto A12","    #CALL MOM","      *goto A13","    #TRY TO FIND THE BATHROOM YOURSELF","      *goto A14","*label A11","*temp randomB","*rand randomB 1 2","*if randomB=1","  *goto B1","*else","  *goto B2","*label B1","After a long struggle to keep yourself from throwing up in front of everyone, the sick feeling goes away.","*set TH%+20","*finish","*label B2","The sick feeling goes away for a little while. All of a sudden your mother makes you eat a stalk of broccoli. BLEAAAAAACK! You throw up all over the table. How embarrassing!","*finish","*label A12","*set SC%-20","Without any regard for anyone around you, you throw up. It splashes in the dish in front of you and gets all over the roast. Your mother is mortified. Your father is much more understanding. This is something you will all get a great","laugh out of twenty years from now.","*finish","*label A13","*temp randomC","*rand randomC 1 2","*if randomC=1","  *goto C1","*else","  *goto C2","*label C1","Mom puts you off for a bit. You can't say you didn't try to warn her. Your stomach rumbles...BLEAAAAAACK! You throw up all over everything! Mom is angry at herself and embarrassed.","*finish","*label C2","Mom walks over to you and asks what is wrong. She brings you into the bathroom and takes your temperature. You don't have a fever. She gives you a glass of warm milk. You feel a little better, but it wasn't the milk that did it -- it was","Mom.","*finish","*label A14","*set IN%+30","It is a large, unfamiliar house. You find a room -- but it's not a bathroom. If you get sick here, no one will know...BLEAAAAAACK! Getting sick like that is difficult to hide. You are discovered and everyone feels sorry for you. The","person who has to clean it up feels less sorry for you than everyone else.","*finish","",""], "labels":{"a11":11,"b1":18,"b2":22,"a12":25,"a13":30,"c1":37,"c2":40,"a14":44}}