{"crc":552094831, "lines":["While socializing at a friend's party you run into someone you had a terrible crush on in 5th grade. She looks even better now than she did back then. She is with a guy who looks like he eats apartment buildings for lunch.","*choice mood action","  #SOCIABLE/FLIRTATIOUS","    #WALK OVER AND SAY \"HELLO\"","      *goto A11","    *selectable_if (false) #JUST IGNORE HER","      *finish","  #UNSOCIABLE/ SELF-CONSCIOUS","    *selectable_if (false) #WALK OVER AND SAY \"HELLO\"","      *finish","    #JUST IGNORE HER","      *goto A22","*label A22","Oddly enough, SHE walks over to YOU and begins a conversation about \"the old days.\"","","*goto TALK","*label A11","*set SC%+10","*set CN%+10","*label TALK","You are introduced to Duke, her date, who excuses himself to look for something to eat (there is a table full of food over there that looks unprotected).","","","Select an action:","","*choice","  #MAKE SMALL TALK AND EXCUSE YOURSELF","    *goto B1","  #BRING UP THE FACT THAT YOU HAD A TERRIBLE CRUSH ON HER IN \"THE OLD DAYS\"","    *goto B2","*label B1","*set SC%+10","*set CN%-10","You talk about how things have changed and how everyone has \"grown up\" since grade school. Neither of you has kept up with anyone. The conversation soon runs out of steam and you excuse yourself. Besides, Duke is returning from battle and","may still be a bit hungry. You never got a chance to find out that it was SHE who had an even bigger crush on YOU.","*finish","*label B2","As the sweat dampens your palms, you take the risk of telling her that back in grade school, you thought she was irresistable. She had dimples, blond hair and three freckles on each cheek.","*page_break","*temp randomC","*rand randomC 1 2","*if randomC=1","  *goto C1","*else","  *goto C2","*label C1","She admits that she had quite an impression of you, too. Everyone used to call you \"Squirrel Cheeks\" because of the way your teeth were too big for your mouth. She continues, \"Everyone thought you were such a NERD!\" With that, Duke walks","back with clam dip dripping from his chin. Your attraction for her seems to wane by the second.  She and Duke seem made for each other.","*finish","*label C2","*set CN%+30","*set SC%+20","*set HP%+20","She admits that she remembers you well, too. She still has a notebook that has your name written on it a thousand times, \"Once for every time I wished I could kiss you,\" she says. Just as she finishes speaking, Duke begins stomping his way","to your side of the room. You had better be careful, he still looks hungry.","","","Select an action:","","*choice","  #QUICKLY ASK HER FOR HER NUMBER","    *goto D1","  #WALK AWAY WHILE YOU STILL HAVE BOTH LEGS SECURELY IN PLACE","    *goto D2","*label D1","\"It's 555-0764. Please call me, SOON.\" You walk away and begin mingling again, wondering if this could possibly work out.","*if ((SR<1) and (ES<1)) and (MS<1)","  *goto E.T","*else","  *goto E.F","*label E.T","*finish","*label E.F","*page_break","Isn't there the small matter of a commitment that you have made to someone else that you seem to be forgetting? What do you have to say about this?","","","Select an action:","","*choice","  #\"I'LL TAKE MY CHANCES\"","    *goto I1","  #\"I DIDN'T REALLY PLAN ON CALLING\"","    *goto I2","*label I1","*set TR%-30","What a sleazo. One thing is certain. You have made it extremely risky for yourself. If you get caught cheating on your steady partner you could lose HER heart. If you get caught cheating by Duke, you could lose YOUR heart (literally, if","you know what I mean).","*finish","*label I2","*set TR%-20","I know, SURE. Whatever you say. I guess that means you can wash off the telephone number you have written on your arm in catsup.","*finish","*label D2","*if ((SR<1) and (ES<1)) and (MS<1)","  *goto J.T","*else","  *goto J.F","*label J.T","*set CN%-20","*set CA%-20","Coward! What's ten or twenty broken bones compared to a thousand kisses?","*finish","*label J.F","*set SC%+10","*set HP%+20","*set CN%+20","How flattering. You walk away thinking about how things might have been if only you had known her back then.","*finish","",""], "labels":{"a22":12,"a11":16,"talk":19,"b1":30,"b2":36,"c1":45,"c2":49,"d1":64,"e.t":70,"e.f":72,"i1":84,"i2":89,"d2":93,"j.t":98,"j.f":103}}