{"crc":-653377749, "lines":["You have just passed through the ADOLESCENCE phase of life.","*page_break","Family life can be very rough during adolescence. Even though your family expects you to take charge of your life, no one wants to let you have the freedom to do what you want.","*page_break","Judging by your progress through life so far, your family life has","*if FM>60","  *goto A.T","*else","  *goto A.F","*label A.T","been quite good, all things considered. Family members can be pains, but no one seems to mind it when you overhaul your hair for three hours every morning in the bathroom.","*goto PH","*label A.F","not been very good. Spending time at home is like going to battle. At times you aren't sure how you can even LIVE there.","*label PH","*page_break","Physically you have been","*if PH>60","  *goto B.T","*else","  *goto B.F","*label B.T","a healthy young man. Your body image may have been a little bit of a concern to you during this phase, but you seem strong physically.","*goto SC","*label B.F","not very healthy.","*label SC","*page_break","Socially, this phase of life does present its share of problems. Most of these problems fall into the category of girls. Life must have been pretty simple before they showed up. Your social adjustment to this phase of life has been","*if SC>70","  *goto C.T","*else","  *goto C.F","*label C.T","remarkable.","*goto REL","*label C.F","*if SC>50","  *goto D.T","*else","  *goto D.F","*label D.T","good.","*goto REL","*label D.F","not very good.","*label REL","","*if SR>0","  *goto Z.T","*else","  *goto Z.F","*label Z.T","You are developing a relationship with ${loverName} so you see how tricky things can get.","*goto EMO","*label Z.F","Although you do not have a steady girlfriend at the present time, there's always the next life phase.","*label EMO","*page_break","Now, regarding your emotional development...","*page_break","*if TR<50","  *goto E.T","*else","  *goto E.F","*label E.T","You are not the most trustworthy teen-ager around, you know. Perhaps you can avoid getting into any more trouble than you've already had by developing a better set of ethics.","*goto TH","*label E.F","*if TR<70","  *goto F.T","*else","  *goto F.F","*label F.T","Your trustworthiness and sense of fair play are commendable. You are an honest young man, but there is always room for improvement.","*goto TH","*label F.F","You are a remarkably trustworthy young man. This trait is bound to take you far, emotionally and vocationally. You are developing into the type of adult that people can confide in. Unfortunately, the burden that comes along with this","characteristic, is the tendency for people to tell you their problems.","*label TH","*page_break","*if TH>70","  *goto X.T","*else","  *goto X.F","*label X.T","A positive aspect of your adolescence is your ability to resist temptation and not give into your impulses. Since adolescence is a time for testing limits, this can get some people into some pretty dangerous situations. On the other hand,","leading too much of a sheltered life can be boring.","*goto HP","*label X.F","It looks like you have had your share of testing the limits and doing things on the spur of the moment. It also looks like some of those things haven't really turned out for the better. Risk-taking is a large part of this phase of life.","You should take care that you don't let it evolve into plain old foolishness later.","*label HP","*page_break","*if HP>70","  *goto W.T","*else","  *goto W.F","*label W.T","You seem to be enjoying most of what you do. Even though you experience \"the blues\" every once in a while, it's nice to see that you are not having a depressed, traumatized life.","*goto GN","*label W.F","*if HP>50","  *goto V.T","*else","  *goto V.F","*label V.T","You are taking life pretty seriously, aren't you. While you are far from depressed, it sometimes seems that you don't always strive to be the happiest person you can be.","*goto GN","*label V.F","You seem to be unusually depressed for such a young person. I hope things can get brighter for you later on.","*label GN","*page_break","*if GN<50","  *goto G.T","*else","  *goto G.F","*label G.T","The degree to which you display aggressive types of behavior is somewhat alarming. Now is the time when you have to keep a tighter check on your hostility. If it gets out of hand, you could wind up in deep trouble.","*goto IN","*label G.F","Even though an occasional explosive outburst is common in most adolescents, you seem to have everything well under control. You seem to be sensitive and gentle.","*label IN","*page_break","*if IN>60","  *goto Y.T","*else","  *goto Y.F","*label Y.T","You certainly have a good head on your shoulders. You are not only book-smart, you also have plenty of common sense.","*goto ENDIT","*label Y.F","You don't seem to be making too many sensible decisions. Intelligence is not only a function of how much information a person can store in his or her head, it's also the ability to learn from experience.","*label ENDIT","*page_break","Now that your adolescence is almost over it's time to be hurled out there into the abyss of the REAL WORLD. (I'll bet you didn't know that everything you did so far was part of the fake world.)","*finish","",""], "labels":{"a.t":9,"a.f":12,"ph":14,"b.t":21,"b.f":24,"sc":26,"c.t":33,"c.f":36,"d.t":41,"d.f":44,"rel":46,"z.t":52,"z.f":55,"emo":57,"e.t":65,"e.f":68,"f.t":73,"f.f":76,"th":79,"x.t":85,"x.f":89,"hp":92,"w.t":98,"w.f":101,"v.t":106,"v.f":109,"gn":111,"g.t":117,"g.f":120,"in":122,"y.t":128,"y.f":131,"endit":133}}