{"crc":146402166, "lines":["During a college vacation break, you bump into a person who used to be a good friend in high school. He chose to skip college and find a job. He is now working as a machine maintenance engineer at a local plant in your old home","town. When you try to converse with him, he seems distant and aloof, almost resentful.","","","Select an action:","","*choice","  #ASK HIM WHAT'S ON HIS MIND","    *goto A1","  #MAKE SMALL TALK FOR A FEW MINUTES THEN WALK AWAY","    *goto A2","*label A1","He says, \"What would you care? Besides, you have the easy life in college now. You would never understand MY worries.\"","","","Select an action:","","*choice","  #GET ANGRY AND WALK AWAY","    *goto B1","  #ASK HIM IF HE WANTS TO TELL YOU ABOUT IT ANYWAY","    *goto B2","*label B1","*set GN%-10","The nerve of some people. Besides, who said college was the good life? You chose to walk away from this person's rudeness, which is perfectly O.K.. You couldn't have valued his friendship much or perhaps you would have tried","harder to find out what was behind his hostility.","*finish","*label B2","*set TH%+30","*set GN%+20","*set SC%+20","Your sincerity causes him to see that he has treated you in a rude fashion. He admits that his life is very difficult now. He has bills to pay and other responsibilities he really wasn't ready for. His life is routine and he","gets little enjoyment out of his work.","*page_break","Seeing you sparked some envy in him, but soon your friendship is renewed. He only criticized you because he felt you might be looking down on him because he didn't go to college--a move he regrets now. Your patience brings down his","defenses and motivates him to take a closer look at his life.","*finish","*label A2","*set SC%-10","The conversation between you and your friend is stilted and uneasy. You sense a great tension between the two of you. Soon you get the feeling that he is just waiting for you to say something that sounds like you were smart for going to","college, and that he was stupid for getting a job.","*page_break","He secretly regrets the choice he made, but doesn't want anyone bringing it to his attention. Your small talk takes some of the threatening tone out of his voice. You rationalize the experience by saying to yourself, \"Some people","just change.\"","*finish","",""], "labels":{"a1":11,"b1":22,"b2":27,"a2":37}}