{"crc":149214498, "lines":["While you are working, a friend calls to tell you that he has free tickets to a baseball game--box seat! Unfortunately, you have already made plans to take your wife out to a movie that she has been dying to see. What will you do?","","","Select an action:","","*choice","  #TELL YOUR WIFE THAT YOU ARE STUCK AT WORK, THEN GO TO THE BASEBALL GAME","    *goto A1","  #CALL YOUR WIFE AND DISCUSS THE SITUATION","    *goto A2","  #DON'T GO TO THE BASEBALL GAME","    *goto A3","*label A1","*set TR%-20","When you arrive at the baseball game, you notice that you are seated in the seat directly adjacent to the box owned by The Playhouse men's magazine. There are eight seats worth of scantily-clad girls to your immediate left.","","","Select an action:","","*choice","  #PAY MORE ATTENTION TO THEM THAN TO THE BASEBALL GAME","    *goto B1","  #TRY TO KEEP YOUR MIND ON THE GAME","    *goto B2","*label B1","*set CN%+10","One if them thinks you are \"sooooooooo cute!. Just like a little fuzzy, wuzzy teddy bear.\" She wants to know if she can sit on your lap to watch the game.","","","Select an action:","","*choice","  #LET HER SIT IN YOUR LAP","    *goto C1","  #DECLINE THE INVITATION","    *goto C2","*label C1","It makes a great camera shot for between innings. The TV cameraman zooms in for a nice tight close-up of your face, one side of which is obscured by the well-endowed Playhouse \"kitten.\"","*page_break","As you see your face and the kitten's various parts on the giant TV screen scoreboard, you feel a slight surge of panic. You realize that there is virtually no chance of ${spouseName} seeing the ball game, especially at that","precise moment. You get a nice round of applause from the crowd, and a kiss on the cheek from Joni, also known as Miss November.","*page_break","Sure enough, when you get home, both of your secrets are safe--${spouseName} has no idea that you went to the game, or fondled a spectator young enough to be your daughter.","*page_break","Unfortunately, the you-know-what hits the fan about a week later when The Wandering Enquirer prints a front page blow-up of you and Miss November in a \"passionate embrace\" with the headline, MISS NOVEMBER CATCHES SUGAR DADDY AT BALL GAME!","","","Select an action:","","*choice","  #DENY THAT THE MAN IN THE PHOTO IS YOU","    *goto D1","  #COME CLEAN AND ADMIT THE TRUTH","    *goto D2","*label D1","*set TR%-20","*set SC%-10","You really should put the shovel down now, as you are only digging yourself in deeper and deeper. The likeness is uncanny. Every one of your neighborhood friends has sent you the clipping to hang up at work. ${spouseName} is furious because you","lied to her. Your credibility with her slips for a while.","*finish","*label G2","*label D2","*if TR<40","  *goto E.T","*else","  *goto E.F","*label E.T","With your history of untrustworthy behavior, do you think she's going to believe that everything is as \"innocent\" as you say?  I hope you don't mind sleeping on the couch for the next few weeks.","*finish","*label E.F","${spouseName} doesn't understand why you lied to her in the first place. In any event, since you haven't been terribly untrustworthy in the past, you both get quite a laugh out of the incident.","*finish","*label C2","Eventually, the girls become more of an unwelcome distraction than something interesting to look at. \"Was that a touchdown?\" they coo. \"When do we see the kickoff?\" Questions like this remain cute for an hour or so at the most.","*page_break","You watch the game and practice your best \"I'm-so-tired-from-work\" face for when you get home. By the way, when are you taking ${spouseName} to see that movie, like you promised?","*label H","","","Select an action:","","*choice","  #\"TOMORROW NIGHT\"","    *goto F1","  #\"I'LL GET AROUND TO IT\"","    *goto F2","*label F1","When you arrive at the movie theater, a man taps you on the shoulder and says, \"Hey, bud, aren't you the guy who wuz sitten next to all of them beautiful women last night at the baseball game?\"","","","Select an action:","","*choice","  #MUMBLE UNDER YOUR BREATH AND HIDE YOUR FACE","    *goto G1","  #TELL THE TRUTH","    *goto G2","*label G1","\"Nah, you're kiddin' me. I never forget a face.\" The man goes on to describe every article of clothing you had on. At this point ${spouseName}, leans over and says, \"That's impossible, Sir--he worked late last night.\" On the way into the","theater ${spouseName} gives you a wink and a kiss on the cheek. She taped the game so you could watch it, and in the process of taping saw you there!","*finish","*label F2","*set TR%-30","That doesn't sound very fair. Trustworthiness decreases sharply.","*finish","*label B2","You must be a real sports fan. You watch the game and practice your best \"I'm-so-tired-from-work\" face for when you get home. By the way, when are you taking ${spouseName} to see that movie, like you promised?","*goto H","*label A2","She is angry, and will probably be even angrier if you don't come home and take her to the movies.","","","Select an action:","","*choice","  #PROMISE HER DINNER AND MOVIES IF SHE SAYS IT'S O.K. TO GO TO THE BALLGAME","    *goto I1","  #GO HOME AND TAKE HER TO THE MOVIES","    *goto I2","*label I1","*set SC%-20","The issue is not really the movie. It's breaking a promise because you feel enjoying yourself is more important than ${spouseName}'s feelings. Eventually she lets you off the hook so you can see the game, but she resents you for it.","*finish","*label I2","*set TR%+30","The movie is a murder mystery about a wife who plots to kill her husband after suffering through years of neglect. The wife is caught, but not convicted. Everyone thinks the bum deserves what he got. Aren't you glad you didn't","go to the game?","*finish","*label A3","*set TR%+30","*set SC%+30","Your values are admirable. As it happens, the baseball game gets rained out, and the tickets are good for the following game, so you get to do both!","*finish","",""], "labels":{"a1":12,"b1":24,"c1":36,"d1":54,"g2":60,"d2":61,"e.t":66,"e.f":69,"c2":72,"h":76,"f1":86,"g1":97,"f2":101,"b2":105,"a2":108,"i1":119,"i2":123,"a3":128}}