{"crc":-1695249817, "lines":["*if MP>7","  *goto Z.T","*else","  *goto Z.F","*label Z.F","*set SC%+30","*set HP%+20","You and ${spouseName} have had a good marriage up until this point. The local paper singles you out as \"Couple Of The Year\" and sends you on a vacation cruise around the world! Bon Voyage!","*finish","*label Z.T","You and ${spouseName} have had what many would consider a \"stormy marriage.\" Lately, ${spouseName} has been thinking about this and has decided that things must change, or she wants out. She has given you the ultimatum that she will not continue the","marriage without some kind of marriage counseling.","","","Select an action:","","*choice","  #DIVORCE HER","    *goto A1","  #GO FOR MARRIAGE COUNSELING","    *goto A2","*label A1","If you really feel this strong about not wanting to change anything, I guess a divorce is the best way out.","*set MS 0","*finish","*label A2","After speaking with both of you, the counselor has found that there seems to be a lack of communication between you. As far as ${spouseName} is concerned, she tends to get resentful rather than express her true feelings. You also have trouble","expressing your feelings.","*page_break","Over the course of the marriage counseling, the following things are revealed:","*if TR<50","  *goto B.T","*else","  *goto B.F","*label B.T","You have not been the most trustworthy husband that you can be.","*label B.F","*if TH<50","  *goto C.T","*else","  *goto C.F","*label C.T","Your self-destructivness and impulsive behavior has a tendency to get you into trouble, which in turn upsets your wife.","*label C.F","*if GN<50","  *goto D.T","*else","  *goto D.F","*label D.T","You are gruff and hostile at times, which frightens your wife, then makes her angry and resentful.","*goto E","*label D.F","You have a tendency to take control of things without considering the feelings of your wife.","*label E","*page_break","Now that everything is out in the open you can:","","","Select an action:","","*choice","  #CALL THE WHOLE THING A BUNCH OF NONSENSE","    *goto F1","  #EXPRESS A DESIRE TO CHANGE","    *goto F2","*label F1","*set GN%-10","*set TH%-10","*set HP%-10","*set SC%-30","*set MS 0","This stranger has no right to claim that you have these characteristics, even if what the counselor says were true. You feel as if he were siding with your wife. The incident is a disaster. The outcome is a long, angry divorce trial.","*finish","*label F2","*set CA%+30","*set HP%+30","*set SC%+10","Your flexibility breathes new life into your marriage. Your problems, at least for the moment, seem to disappear.","*finish","",""], "labels":{"z.f":4,"z.t":9,"a1":21,"a2":25,"b.t":34,"b.f":36,"c.t":41,"c.f":43,"d.t":48,"d.f":51,"e":53,"f1":65,"f2":73}}