{"crc":-1831816252, "lines":["The latest craze is wearing a dog collar around your neck, with a T-shirt proclaiming your dog-name. You have just spent $10.00 on a shirt that says,\"FIFI REX the Mad Mongrel\" and have borrowed one of your dog's collars. On the way","out of the house, your mother says,\"Do you THINK you are going out to school with that ridiculous get-up on?\"","*choice mood action","  #ATTENTIVE","    #WALK BACK INTO YOUR ROOM AND PUT ON REGULAR CLOTHES","      *goto A11","    *selectable_if (false) #WALK OUT OF THE HOUSE QUICKLY, MAKING BELIEVE YOU DON'T HEAR HER","      *finish","  #INATTENTIVE","    *selectable_if (false) #WALK BACK INTO YOUR ROOM AND PUT ON REGULAR CLOTHES","      *finish","    #WALK OUT OF THE HOUSE QUICKLY, MAKING BELIEVE YOU DON'T HEAR HER","      *goto A22","*label A11","Once you are back in there you can:","","","Select an action:","","*choice","  #PUT ON REGULAR CLOTHES AND HIDE THE OLD ONES TO CHANGE INTO LATER AT SCHOOL","    *goto B1","  #CHANGE AND FORGET ABOUT THE OUTFIT","    *goto B2","*label B1","*set TR%-10","*set SC%+40","As you walk out of the house this time your mother says, \"That's better, dear. Sometimes I don't know what gets into that head of yours.\" Later that day, the principal calls all the parents of children that have worn \"dogmania\" outfits","to school.","*page_break","When your mother is called she says that she is SURE the principal is mistaken. He asks if there is a possibility that there could be two \"FIFI REX The Mad Mongrel\" T-shirt wearers in the neighborhood. Your mother is mortified.","*goto DISH","*label B2","*set SC%-20","Your friends at school say you have no guts, and refuse to allow you to \"pack\" (hang around) with them. How do you feel about this?","","","Select a mood:","","*choice","  #DEPRESSED","    *goto C1","  #\"I GUESS I'LL GET OVER IT\"","    *goto C2","*label C1","*set HP%-20","Your affiliation with the group seems very important to you. Life can be a real dog sometimes (oops, sorry...).","*finish","*label C2","*set SC%+30","Once you are away from the group for a while, you realize that most of the school thinks they are a bunch of jerks. You find a new bunch of friends who are more willing to accept you for what you are.","*finish","*label A22","*set FM%-10","Your mother is furious because you ignored her. She tells you that if you want to act like a dog, you will be treated like one.","*label DISH","You are forced to eat your meals from a special dog dish (with your dog-name written on it) for the next three days.","*finish","",""], "labels":{"a11":13,"b1":24,"b2":32,"c1":44,"c2":48,"a22":52,"dish":55}}