{"crc":1305607434, "lines":["You are sitting in the car with Dad, warming it up, when the phone rings and he has to go inside to take the call. You look at the keys dangling from the ignition switch, and hear the purr of the engine. No one would notice if you","moved the car a little and jumped back in your seat before Dad returns.","*choice mood action","  #DARING","    #MOVE THE CAR","      *goto A11","    *selectable_if (false) #KEEP STILL","      *finish","  #SAFE","    *selectable_if (false) #MOVE THE CAR","      *finish","    #KEEP STILL","      *goto A22","*label A11","*set TH%-10","You slide over and sit in the driver's seat. The steering wheel seems very large and everything looks different from this side of the car. You turn the radio off and gently shift the gearshift lever down one notch.","*page_break","*temp randomB","*rand randomB 1 3","*if randomB=1","  *goto B1","*elseif randomB=2","  *goto B2","*else","  *goto B3","*label B1","*set FM%-10","The gearshift locks in reverse and you can't quite reach the brake! The car slides into a tree and dents the rear fender. \"How many times have I told you that the car is a WEAPON. It can kill people! What is WRONG with you!\" This","is all you hear for the rest of the day.","*finish","*label B2","*set CA%-10","The gearshift locks in reverse, but you reach the brake in time to stop the car (or innocent bystanders) from being damaged. When Dad comes out he sees you sitting in the car, playing with the radio. He wonders out loud if he had let","the car roll before he got out. You begin to hum...","*finish","*label B3","You are on a slight incline and the car doesn't move, even when the pointer is on \"D\". You can:","","","Select an action:","","*choice","  #GIVE IT SOME GAS","    *goto C1","  #PUT IT BACK ON 'P'","    *goto C2","*label C1","*set HP%-20","*set FM%-20","The tires spin and the car jerks forward about 25 feet. You are stopped by the fender of another car -- a black and white one with a flashing light on top. When your dad comes out to see what is going on the police officer gives","him about five tickets.","*page_break","You could beg the police officer to arrest you, but it would do you no good. Soon you would get out out of jail and be at your father's mercy anyway. You are grounded for a month.","*finish","*label C2","*set TR%+10","It's good to know that you can quit while you're ahead. You might have done something stupid (that is, more stupid than what you already did) and gotten yourself into real trouble.","*finish","*label A22","*set TH%+50","Reflecting on the possible consequences of your behavior is a sign of developing impulse control. You will have plenty of opportunities to wreck the family car later, under more legitimate circumstances.","*finish","",""], "labels":{"a11":13,"b1":25,"b2":30,"b3":35,"c1":46,"c2":54,"a22":58}}