{"crc":87065042, "lines":["Your best friend since grade school has been looking depressed and confused. He is usually a very happy-go-lucky person, so you really can't understand what could be wrong.","*choice mood action","  #SYMPATHETIC/CONCERNED","    #ASK HIM WHAT IS WRONG","      *goto A11","    #KEEP TO YOURSELF/BELIEVE IT'S NONE OF YOUR BUSINESS","      *goto A12","  #DISINTERESTED","    *selectable_if (false) #ASK HIM WHAT IS WRONG","      *finish","    #KEEP TO YOURSELF/BELIEVE IT'S NONE OF YOUR BUSINESS","      *goto A22","*label A11","He tells you that there is nothing wrong, but you can see by his face that he is deeply troubled.","","","Select an action:","","*choice","  #KEEP PRESSING HIM TO TELL YOU","    *goto B1","  #LEAVE HIM ALONE","    *goto B2","*label B2","I guess you believe you have tried and that any further prying would be inappropriate. Some people have a way of testing whether a person TRULY wants to help (as opposed to those who merely feel it is their obligation as","friends) by saying that there really isn't anything wrong. I think that this was one of those times. You never find out what was bothering him.","*finish","*label B1","After much hesitation, he lowers his eyes and blurts out that he thinks he is a homosexual. He is worried that if he tells any friends, they will desert him, and that he will be laughed at. What are you feeling right now?","","","Select an action:","","*choice","  #ANXIOUS/SHOCKED","    *goto C1","  #DISGUSTED","    *goto C2","  #ACCEPTING","    *goto C3","*label C1","*set CA%-20","You can't prevent the shock from showing in your face. Your friend sees this and interprets it as disapproval. As a result of learning this information, what will become of your friendship with this person?","","","Select an action:","","*choice","  #NOTHING HAPPENS AT FIRST, BUT GRADUALLY YOU GROW APART","    *goto D1","  #YOU IMMEDIATELY TELL HIM YOU DISAPPROVE AND STOP SEEING HIM AS A FRIEND","    *goto D2","  #YOU SYMPATHIZE WITH HIM AND ASK HIM TO TELL YOU HIS TROUBLES","    *goto D3","  #YOU OFFER YOUR SUPPORT, BUT SUGGEST HE GET SOME HELP TO SORT OUT HIS FEELINGS","    *goto D4","*label D1","*set CA%-10","Although you would like to be supportive of him, you just can't understand why he would like men more than women. Homosexual behavior makes you feel very uncomfortable and you just can't get over it.","*finish","*label C2","*label D2","*set CA%-20","When confronted with even the mention of homosexual behavior, some people really panic. Your friend's fears and suspicions are proven. Two days later he disappears and you never see him again.","*finish","*label E1","*label D3","*set SC%-10","You may be asking for more work than you are willing to provide for this friend. As a result of your sympathy, he becomes very dependent, telling you his every problem, every thought, and every worry. This is bound to wear","down the patience of even the most true-blue friend.","*page_break","At this time in your life, I'm sure that you have many of your own problems to deal with. As a result, you become tired of being his therapist and begin to avoid him. Your friendship eventually dwindles away.","*finish","*label E2","*label D4","*set GN%+30","*set IN%+30","*set SC%+40","This was the most considerate thing you could have done for this young man. Taking on the responsibility of being the sole source of support for him might have made him overly dependent on you. This could have put a strain on your","friendship. As a result of your suggestion, your friend learns how to deal with his homosexuality and the two of you remain close friends.","*finish","*label C3","It is nice to see that you are willing to be supportive.","","","Select an action:","","*choice","  #SYMPATHIZE AND ASK HIM TO TELL YOU HIS TROUBLES","    *goto E1","  #OFFER SUPPORT AND SUGGEST PROFESSIONAL COUNSELING","    *goto E2","*label A12","*set SC%-10","Although you are truly worried about your friend and his present state of mind, you feel uncomfortable approaching him. Perhaps you are afraid of overstepping your boundaries. Although in this case it's too late to remedy, remember","that friendship involves risk-taking.","*page_break","If you really care about someone, you can risk being told to mind your own business without fear of destroying the relationship.","*finish","*label A22","*set TH%-30","You are obviously more concerned with yourself than with the problems of this friend. Unfortunately, the problems he is experiencing now are among the most unsettling people can have. As a result, he disappears and you never see","him again.","*finish","","",""], "labels":{"a11":12,"b2":23,"b1":27,"c1":40,"d1":56,"c2":60,"d2":61,"e1":65,"d3":66,"e2":73,"d4":74,"c3":81,"a12":92,"a22":99}}