{"crc":1082802952, "lines":["The phone rings while Daddy is ironing a shirt. He must leave you alone in the room with the iron.","*choice mood action","  #HELPFUL","    *selectable_if (false) #PLAY QUIETLY","      *finish","    #HELP DAD IRON THE SHIRT","      *goto A12","  #CAUTIOUS","    #PLAY QUIETLY","      *goto A21","    *selectable_if (false) #HELP DAD IRON THE SHIRT","      *finish","*label A12","*set TH%-10","The iron is heavy and hard to manage. You try to push it across the shirt with two hands.","*temp randomB","*rand randomB 1 4","*if randomB=1","  *goto B1","*elseif randomB=2","  *goto B2","*elseif randomB=3","  *goto B3","*else","  *goto B4","*label B1","Dad comes in just before you burn yourself and ruin his shirt.","*finish","*label B2","*set PH%-10","You accidentally touch the iron and burn your finger. The iron falls on the floor and burns a hole in the carpet.","*finish","*label B3","You leave the iron on top of Dad's shirt and it burns a hole right through it.","*page_break","You could have gotten burned very badly, even though you were trying to be helpful.","*finish","*label B4","*set PH%-20","Ouch! You burn your hand on the hot iron. It falls to the floor with a thud. When you try to pick it up from the floor you pick it up by the metal part and burn your hand badly.","*finish","*label A21","*set TH%+40","Dad realizes that you are alone with the hot iron and calls you in to him.","You run into the room and trip over the iron cord.","*temp randomD","*rand randomD 1 5","*if randomD=1","  *goto D1","*elseif randomD=2","  *goto D2","*elseif randomD=3","  *goto D3","*elseif randomD=4","  *goto D4","*else","  *goto D5","*label D1","*label D2","The iron wobbles but remains upright. You have avoided getting hurt.","*finish","*label D3","*label D4","The iron falls on the floor and burns a hole in the carpet. It's not your fault.","*finish","*label D5","*set TH%-10","*set PH%-10","You fall onto the floor and the hot iron lands on your hands and arms. It hurts a lot. You are taken to the hospital.","*temp randomE","*rand randomE 1 2","*if randomE=1","  *goto E1","*else","  *goto E2","*label E1","*set PH%-10","You suffer minor burns. Young skin heals quickly. You were very lucky.","*finish","*label E2","*set PH%-25","You suffer second degree burns on your hands and arms. You are bandaged to the elbow on both sides. You will have some permanent scarring.","*finish","",""], "labels":{"a12":12,"b1":25,"b2":28,"b3":32,"b4":37,"a21":41,"d1":57,"d2":58,"d3":61,"d4":62,"d5":65,"e1":75,"e2":79}}