{"crc":1420045521, "lines":["You are a guest at your friend Billy's house. His mom gives you both a box of crayons and two pieces of paper.","*choice mood action","  #ARTISTIC","    #DRAW ON THE PAPER","      *goto A11","    #DRAW (IN GENERAL)","      *goto A12","  #IMPULSIVE","    #DRAW ON THE PAPER","      *goto A21","    #DRAW (IN GENERAL)","      *goto A22","*label A11","*set IN%+20","*set TH%+30","You are behaving yourself very nicely so far. You draw a pretty picture.","","","Select an action:","","*choice","  #GIVE IT TO BILLY'S MOM","    *goto B1","  #GIVE IT TO YOUR MOM","    *goto B2","*label B1","*set TH%+20","*set SC%+30","A very strong sign of developing social etiquette. Emily Post would certainly approve.","*finish","*label B2","*set FM%+20","A very nice gesture. You can have a good time at somebody else's house for a short while, but there's no place like home.","*finish","*label A12","*set IN%+20","You draw large circles and swirls with black crayon on the paper. Oops!  You drew on the expensive tablecloth.","","","Select an action:","","*choice","  #TELL BILLY ABOUT THE SPOT","    *goto C1","  #COVER UP THE SPOT","    *goto C2","  #TELL BILLY'S MOM ABOUT THE SPOT","    *goto C3","*label C1","Billy is a gracious host. He excuses you, then adds a stroke or two to your design (on the tablecloth, that is).","*finish","*label C2","You casually slide the paper over the offending spot, where it will remain covered and undetected until after you leave. This was the sneaky, cowardly way out.","*finish","*label C3","*set TR%+30","Your honesty is commendable. Billy's mom realizes she wasn't thinking clearly when she let you draw on top of the tablecloth. Will you be this honest when you get yourself into real trouble?","","","Select an action:","","*choice","  #YES","    *goto D1","  #NO","    *goto D2","*label D1","We'll see.","*finish","*label D2","Probably not, but admitting this is a trustworthy sign in itself. You're all right.","*finish","*label A21","*set TH%-30","You scribble back and forth wildly, creating bold slashes of color. When you are finished, you can:","","","Select an action:","","*choice","  #CRUMPLE IT UP AND START AGAIN","    *goto E1","  #SAVE IT","    *goto E2","*label E1","*set GN%-20","Ah yes, the frustrated artist. Your impulsiveness combined with your desire for perfection keeps you in a state of \"artistic turmoil.\"","*finish","*label E2","You appreciate the value of even this kind of emotional expression. When you are famous, this scribbling might be worth a fortune.","*finish","*label A22","*set TH%-20","You and Billy work each other into a frenzy (as little boys often do). First you cover the paper, then Billy suggests you redecorate the kitchen.","","","Select an action:","","*choice","  #JOIN HIM","    *goto F1","  #MIND YOUR MANNERS","    *goto F2","*label F1","You and Billy create a fabulous mural on the kitchen wall, a real one-of-a-kind masterpiece. Unfortunately Billy's mom shares neither your enthusiasm, nor your love for the arts. You are sent home pronto and the last you saw of Billy, he","was being put into solitary confinement and holding a pillow on his rear end.","*finish","*label F2","*set SC%+30","A valiant choice with an unfortunate outcome. When Billy's mother discovers his masterpiece she gives you joint credit. She does not know that you are definitely an impressionist while Billy is an obvious cubist. Adults!","*finish","",""], "labels":{"a11":12,"b1":25,"b2":30,"a12":34,"c1":48,"c2":51,"c3":54,"d1":66,"d2":69,"a21":72,"e1":84,"e2":88,"a22":91,"f1":103,"f2":107}}