{"crc":-1161728938, "lines":["You have just passed through INFANCY. A brief look at your life up to this time shows the following:","*page_break","Your family life has been:","*if FM>60","  *goto A.T","*else","  *goto A.F","*label A.T","Positive and nurturant, and as a result you have begun to form the critical bonds that are important during this phase of life.","*goto PH","*label A.F","Not very good. You seem to be lacking the bonds that are so critical during this phase of life.","*label PH","*page_break","Physically you have been:","*if PH>60","  *goto B.T","*else","  *goto B.F","*label B.T","A healthy baby.","*goto SC","*label B.F","Not a very healthy baby.","*label SC","*page_break","Socially, during this phase in life, nothing much is really expected of you. After all, you're still much too young to throw a successful cocktail party, and frankly, anyone who still dribbles on himself probably wouldn't make the ideal","dinner guest. However, by now there are some things you should have mastered. Your progress in this area shows:","*page_break","*if SC>80","  *goto C.T","*else","  *goto C.F","*label C.T","You have been the type of child who charms the lollipops off people. You have been the type of child who is huggable and gets his cheeks pinched by old ladies with bright red lipstick.","*goto EMO","*label C.F","*if SC>50","  *goto D.T","*else","  *goto D.F","*label D.T","You have been the type of child that Mom could trust in department stores.","*goto EMO","*label D.F","You have been the type of child who often spits and throws temper tantrums. I'll bet you had your bottom whacked quite a few times, so far.","*label EMO","*page_break","Now, regarding your emotional and personality development...","*page_break","*if TR<50","  *goto E.T","*else","  *goto E.F","*label E.T","You are not exactly the type of child who could be trusted to wash his hands before coming to the dinner table. If there is a piece of cake sitting in the refrigerator at noon, chances are it will be in your tummy by dinner.","*goto TH","*label E.F","*if TR<70","  *goto F.T","*else","  *goto F.F","*label F.T","You are a fairly trustworthy little boy, making your share of exploratory excursions into the world of the unknown and forbidden (the bathroom and under the kitchen sink).","*page_break","Your folks could trust you in most cases, but when all of the chocolates have one bite taken out of them, it is a fair guess whose teethmarks have made those jagged impressions.","*goto TH","*label F.F","What a trustworthy lad you are turning out to be. You will probably join the Boy Scouts of America in the next module. On the one hand your trustworthiness is a desired trait. On the other, I am curious why you don't explore your environment","a bit more, get into things a bit.","*page_break","For instance, haven't you ever wondered what that zipper on the side of your mother's pillow is for? Well, then, UNZIP it!","*label TH","*page_break","Your Thoughtfulness characteristic really doesn't count for much in this module. Most children often find themselves at the mercy of their whims and impulses. You are allowed to be cranky now. People","will tolerate it much better than when you are a teen-ager. Then your whining and carrying on will seem more objectionable.","*page_break","*if GN<50","  *goto G.T","*else","  *goto G.F","*label G.T","One thing about your character that has a tendency to put people off is your aggressiveness. You are the type of baby who likes to pull on loose pieces of clothing, hair and any bulbous fleshy object that comes within your reach. You are","going to have to learn the meaning of \"make nice.\"","*goto ENDIT","*label G.F","You are a gentle baby, one of those adorable little kids that learns to give kisses at an early age and knows how to \"make nice.\" This helps you along socially now. Fifteen years or so from now, you are going to keep a closer tab on those","hot lips, but for now anyone is fair game.","*page_break","People will love you so much, they won't even mind when you leave them with all of those contagious childhood coughs and colds kids have a tendency to spread.","*label ENDIT","*page_break","That wraps up your status for the first module. I hope you like yourself. If not, you can always try to improve yourself in the modules to come. There's plenty of time.","*finish","",""], "labels":{"a.t":7,"a.f":10,"ph":12,"b.t":19,"b.f":22,"sc":24,"c.t":33,"c.f":36,"d.t":41,"d.f":44,"emo":46,"e.t":54,"e.f":57,"f.t":62,"f.f":67,"th":72,"g.t":81,"g.f":85,"endit":90}}