{"crc":967380853, "lines":["Mary Jane Jones is one of those friends who really knows how to be \"one of the guys.\" She's been a good friend of yours since third grade. You would like to ask her to the school dance except for one problem: She is six inches taller","than you.","*choice mood action","  #SELF-CONSCIOUS","    #ASK HER TO THE DANCE","      *goto A11","    #DON'T ASK HER TO THE DANCE","      *goto A12","  #SELF-ASSURED","    #ASK HER TO THE DANCE","      *goto A21","    *selectable_if (false) #DON'T ASK HER TO THE DANCE","      *finish","*label A11","*set SC%+30","Against your better judgment, you ask her to the dance. She is extremely flattered. How does this make you feel?","","","Select a mood:","","*choice","  #BETTER","    *goto B1","  #STILL SELF-CONSCIOUS","    *goto B2","*label B1","*set SC%+10","You realize that friendship is much more important than having people point at you and laugh (which they do). The two of you have a terrific time together.","*finish","*label B2","*set SC%-10","You worry about how you look so much that you wind up having a lousy time at the dance. You bring Mary Jane home early and decide not to go on any more dates until you grow. Too bad, she really is a nice person. How do you feel","now?","*label GUILTY","","","Select a mood:","","*choice","  #GUILTY","    *goto C1","  #NOT GUILTY","    *goto C2","*label C1","Then stop being so concerned about what people think of you and have a good time!","*finish","*label C2","*set SC%-10","Five years from now Mary Jane becomes a three million dollar-a-year fashion model, and you grow seven inches. The next time you ask her for a date, be prepared to be rejected!","*finish","*label A12","You know, she was really hoping that you would take her. She wouldn't have gone with anyone else. The day after the dance you walk over to her in the hall. When you say hello, you notice a tear sliding down the side of her face. She","says that nothing's bothering her but you know exactly why she's upset. Do you feel:","*goto GUILTY","*label A21","Of course, you have a fantastic time. You make fun of everyone who is stupid enough to comment on the difference in your size. Five years after the dance, Mary Jane becomes a three million dollar-a-year model.","*finish","",""], "labels":{"a11":13,"b1":25,"b2":29,"guilty":33,"c1":43,"c2":46,"a12":50,"a21":54}}