{"crc":1075173080, "lines":["You have just taken off your socks and shoes after a long, tiring day. You would like nothing more than to begin a nice, lazy, relaxing evening. The clothes hamper seems a mile away.","*choice mood action","  #LAZY","    #TOSS THE SOCKS UNDER THE BED","      *goto A11","    #WALK OVER TO THE HAMPER AND PLACE THEM INSIDE","      *goto A12","  #RESPONSIBLE","    *selectable_if (false) #TOSS THE SOCKS UNDER THE BED","      *finish","    #WALK OVER TO THE HAMPER AND PLACE THEM INSIDE","      *goto A22","*label A11","*set TH%-5","I'll bet this isn't the first time you've done this! Look under there -- it's a regular sock convention. There are some pairs, but mostly it's a singles gathering. That's because the bed charges a one sock rental fee for each sock it","shelters (yes, you've finally found out where all of those socks go). How do you feel about being a little bit of a slob?","","","Select an action:","","*choice","  #O.K.","    *goto B1","  #EMBARRASSED/GUILTY","    *goto B2","*label B1","*set CA%+30","*set CN%+20","That's the spirit. It's no big deal, really. Unless of course, your wife is a neatnik, or your conscience bothers you.","*if ST>0","  *goto C.T","*else","  *goto C.F","*label C.T","Considering your strict upbringing it's interesting that you have been able to keep a casual attitude about such things.","*finish","*label C.F","Sometimes being too compulsive about things can really put a strain on life -- but then again, so can not having any clean socks to wear!","*finish","*label B2","*if ST>0","  *goto D.T","*else","  *goto D.F","*label D.T","It must have been your strict upbringing that makes you feel this way.","*finish","*label D.F","That is odd -- there's nothing in your past or in your upbringing that would make you feel concerned about such things.","*finish","*label G1","*label A12","As you approach the hamper, the crowd begins to murmur in the background... there are two seconds left on the clock and the score is tied...","","","Select an action:","","*choice","  #SHOOT!","    *goto E1","  #PASS","    *goto E2","*label E1","The shot is up... the buzzer sounds...","*temp randomF","*rand randomF 1 2","*if randomF=1","  *goto F1","*else","  *goto F2","*label F1","*set PH%-10","SCORE! THE GAME IS OVER! YOUR TEAM WINS! THE CROWD IS GOING WILD! YOU STUB YOUR TOE! It's back to the real world.","*finish","*label F2","HE MISSES! YOUR TEAM LOSES THE PLAYOFFS! (I know, no fair, I didn't mention that it was the playoffs, but I didn't want to put too much pressure on you.) There's always tomorrow's game.","*finish","*label E2","*set CN%-20","PASS? What do you mean, PASS?! You must be either very tired or have a very poor imagination. How do you ever expect to become a star?","*finish","*label A22","*set CA%+20","You are so neat and wonderful. This will contribute to great success in life, but every once in awhile you have to let go, live a little. Wouldn't you just love to try to make a fifty-foot jump shot with those socks, right into the old","hamper?","","","Select an action:","","*choice","  #YES","    *goto G1","  #NO","    *goto G2","*label G2","Incredible self control there, Sport.","*finish","",""], "labels":{"a11":12,"b1":25,"c.t":33,"c.f":36,"b2":39,"d.t":44,"d.f":47,"g1":50,"a12":51,"e1":62,"f1":70,"f2":74,"e2":77,"a22":81,"g2":94}}