{"crc":1674910370, "lines":["WARNING - THIS EPISODE CONTAINS SUBJECT MATTER OF A SEXUAL NATURE.","Do you wish to continue?","*choice","  #Yes","    *goto sexualEncounter","  #No","    *set instantaneous true","    *finish","*label sexualEncounter","You are in the house alone. While you are \"exploring\" the drawers you notice a stack of Playboy magazines underneath a pile of clothing.","*choice mood action","  #INTERESTED","    #EXAMINE THE MAGAZINES","      *goto A11","    *selectable_if (false) #PUT THE MAGAZINES AWAY","      *finish","  #DISINTERESTED","    *selectable_if (false) #EXAMINE THE MAGAZINES","      *finish","    #PUT THE MAGAZINES AWAY","      *goto A22","*label A11","The middle page folds out to show a woman with dark hair and very large breasts sitting on the edge of a bed and combing her hair. Her legs are apart. What is your reaction to this?","","","Select a mood:","","*choice","  #AROUSED","    *goto B1","  #CONFUSED","    *goto B2","  #DISINTERESTED","    *goto B3","*label B1","*set CA%-10","*set CN%+10","Imagine if you ever walked into your room and SHE was sitting like THAT on YOUR bed! You can:","*label D","","","Select an action:","","*choice","  #TAKE OUT THE CENTERFOLD AND KEEP IT","    *goto C1","  #LEAVE IT ALONE","    *goto C2","*label C1","The centerfold girl becomes your favorite fantasy. Enjoy it while you can. You may find it hard to believe, but women like this only exist in Fantasyland. You almost never meet them at the bus stop or in the supermarket!","*finish","*label C2","*set CA%-10","You sigh and put the magazine back. Why don't any of the girls in your class look like this? Or do they?","*finish","*label B2","*set CA%-10","You ask yourself many questions. Do all women look like this? How old do you have to get before meeting someone like this? What is this strange feeling I have in my pants? You can:","*goto D","*label A22","*label B3","Perhaps you aren't curious about women yet. That's perfectly O.K. As you get older you may find them much more interesting.","*finish","",""], "labels":{"sexualencounter":8,"a11":21,"b1":34,"d":38,"c1":48,"c2":51,"b2":55,"a22":59,"b3":60}}