{"crc":328983126, "lines":["Jill Brady is always untying your shoes and running away. Today she is wearing a skirt. She is bent over picking up a pile of books from the floor.","*choice mood action","  #MISCHIEVOUS","    #SEEK REVENGE","      *goto A11","    *selectable_if (false) #PAY NO ATTENTION TO \"STUPID GIRLS\"","      *finish","  #ABSORBED IN MORE IMPORTANT THINGS","    *selectable_if (false) #SEEK REVENGE","      *finish","    #PAY NO ATTENTION TO \"STUPID GIRLS\"","      *goto A22","*label A11","You think of two ways that you can get back at stupid Jill. You can:","","","Select an action:","","*choice","  #RUN BY AND LIFT HER SKIRT UP OVER HER HEAD","    *goto B1","  #RUN BY AND PUSH HER SO SHE FALLS","    *goto B2","*label B1","*set TH%-10","You take a big lead and start running toward her.","*temp randomC","*rand randomC 1 2","*if randomC=1","  *goto C1","*else","  *goto C2","*label C1","*set CA%-30","Just before you get her, she moves away and puts her foot out. She trips you and you go sliding down the school hall, landing at the feet of Mr. Quincy, the meanest teacher in school. Uh, oh...","*finish","*label C2","*set HP%+40","You lift up her skirt and bring it over her head in one neat motion. SHE LOOKS LIKE SUCH A JERK! Your friends start teasing her; \"Nice panties, Jill!\" Revenge is sweet, but watch out. She just might have the last laugh by marrying you one day.","*finish","*label B2","*set GN%-20","*set PH%+5","THAT WAS MEAN! You could have hurt her like that. Fortunately, you didn't. She only bothers you because she has a crush on you. I know that is not important to you now, but later when she turns into a beautiful young woman, you'll be","wishing that she would pay attention by removing more than your shoes.","*finish","*label A22","*set CN%+20","*set SC%+20","*set IN%+30","You have much more important things on your mind, like how to get Mom to let you join football, how to sneak in to see \"Friday the 13th Part 45,\" and why Mr. Johnson, the Biology teacher, is allowed to wear the same suit 10 days in","a row when you can't even wear a stupid pair of socks for two days.","*finish","",""], "labels":{"a11":12,"b1":23,"c1":32,"c2":36,"b2":40,"a22":46}}