{"crc":1771946385, "lines":["*if MS>0","  *goto A.T","*else","  *goto A.F","*label A.T","I'm sorry. This icon is only for those players who have not yet married. Please try another.","*comment @NTQ","*set instantaneous true","*finish","*label A.F","*if ((FD=0) and (MD=0)) and (PDIV=0)","  *goto PARALIVE.T","*else","  *goto PARALIVE.F","*label PARALIVE.F","Sorry.  This scene is only accessible if your parents are still living together.","*finish","*label PARALIVE.T","Because of prior commitments and other factors affecting your life right now, you find that you will not be with your mom and dad during the coming holiday season.","*choice mood action","  #INDIFFERENT","    #CALL HOME","      *goto B11","    *selectable_if (false) #GO ABOUT YOUR LIFE BUSINESS AS USUAL","      *finish","  #SAD","    *selectable_if (false) #CALL HOME","      *finish","    #GO ABOUT YOUR LIFE BUSINESS AS USUAL","      *goto B22","*label B11","*if FM>70","  *goto C.T","*else","  *goto C.F","*label C.T","*set HP%-10","*set FM%+20","You call home and speak to your parents. There is a quiver in your mom's voice as she tells you that everyone is thinking of you and wishes you were there. When you hang up the phone, you reminisce about holidays in your","past -- the presents, the food, and most of all the people. Why is it that all of the good things in life always seem to change?","*finish","*label C.F","*if FM>49","  *goto D.T","*else","  *goto D.F","*label D.T","*set HP%-5","They tell you things at home just aren't the same without you, and you reminisce about past holidays -- the food, the presents and the family. You feel the loss, and convince yourself that next year you may try a bit harder","to be close to the family during holiday time.","*finish","*label D.F","You call and hear the same tensions in your parents' voice that have always been there. You wonder if things will ever change with them. Same old craziness. Still, you felt the need to touch base by calling. Maybe things","will change if you have a family of your own someday.","*finish","*label B22","*if FM>60","  *goto E.T","*else","  *goto E.F","*label E.T","*set TH%-30","How can you be this insensitive, especially around the holidays? Your family experiences have been generally positive. Perhaps you are growing away from them.","*finish","*label E.F","*label A12","*set TH%-10","*set FM%-10","I guess you really don't feel that close to your family. Maybe that's due to some unresolved differences you had with them in the past. Too bad. At this stage in your life families can serve as crucial support systems when life","gets too stressful.","*finish","",""], "labels":{"a.t":4,"a.f":9,"paralive.f":14,"paralive.t":17,"b11":30,"c.t":35,"c.f":41,"d.t":46,"d.f":51,"b22":55,"e.t":60,"e.f":64,"a12":65}}