{"crc":30627800, "lines":["*if (MS<1) and (SR<1)","  *goto A.T","*else","  *goto A.F","*label A.T","This icon represents an experience that one would have in a steady interpersonal relationship. This kind of relationship doesn't exist for you at this time, which is neither good nor bad. Please realize, however, that this condition does","lock you out of a part of human experience at this age and station in life.","*comment @NTQ","*set instantaneous true","*finish","*label A.F","You and the love of your life have been invited to a dinner party. At one point during the night, a man whom you both barely know inappropriately brushes your partner's breast and fails to excuse himself. You get the distinct impression","that it was NOT an accident.","*choice mood action","  #ANGRY","    #GRAB THE MAN PHYSICALLY, AND DEMAND AN APOLOGY","      *goto E11","    #WALK HIM OVER TO THE CORNER OF THE ROOM AND POLITELY ASK HIM TO WATCH HIMSELF","      *goto E12","    *selectable_if (false) #BRUSH IT OFF AS BEING A SILLY JOKE","      *finish","    *selectable_if (false) #LET HER TAKE CARE OF HERSELF","      *finish","  #JOLLY","    *selectable_if (false) #GRAB THE MAN PHYSICALLY, AND DEMAND AN APOLOGY","      *finish","    #WALK HIM OVER TO THE CORNER OF THE ROOM AND POLITELY ASK HIM TO WATCH HIMSELF","      *goto E22","    #BRUSH IT OFF AS BEING A SILLY JOKE","      *goto E23","    *selectable_if (false) #LET HER TAKE CARE OF HERSELF","      *finish","  #NEUTRAL","    *selectable_if (false) #GRAB THE MAN PHYSICALLY, AND DEMAND AN APOLOGY","      *finish","    *selectable_if (false) #WALK HIM OVER TO THE CORNER OF THE ROOM AND POLITELY ASK HIM TO WATCH HIMSELF","      *finish","    *selectable_if (false) #BRUSH IT OFF AS BEING A SILLY JOKE","      *finish","    #LET HER TAKE CARE OF HERSELF","      *goto E34","*label E11","*set GN%-40","Your show of aggression startles the man, and everyone else in the room. There is dead silence. He apologizes but mentions that he has a mild case of cerebral palsy. In crowded rooms such as this, he has difficulty moving around.","*page_break","As a result he sometimes bumps into people. He assures you it wasn't intentional and offers your wife a sincere apology. I hope you take an extra piece of humble pie with your dinner tonight, tiger. Next time, get the facts first.","*finish","*label E12","*label E22","*set EX%+30","As it turns out, the fellow has a perfectly reasonable explanation. He apologizes and mentions that he has a mild case of cerebral palsy. He has difficulty moving around in crowded rooms such as this. As a result, he sometimes bumps into","people.","*page_break","He assures you it wasn't intentional and offers your wife a sincere apology. By not creating a scene you have avoided an embarrassing situation for the three of you.","*finish","*label E23","*set HP%+20","People who are afraid of confrontation often like to assume that life isn't as serious as other people make it. No problem, the guy just wanted to get a little feel in. Your lover doesn't think it's much of a joke.","*page_break","She tells the guy that if he walks within ten yards of her, she is going to kick him in a place that will be nothing to chuckle about. She resents the fact that you didn't give him a piece of your mind as a show of your support.","*finish","*label E34","*set EX%-10","*set SC%-20","You figure that your partner is a grown-up woman. If a guy is giving her a hard time, she should be able to handle it on her own. After all, you're not always going to be there to protect her. If that is what you think, you are right on","all counts.","*page_break","She IS a grown-up woman, and you WON'T always be there for her. The fact is, however, that you ARE there and you COULD have shown a little more support. Even the most liberated woman would be likely to resent the fact that you didn't do","much on her behalf in a situation like this.","*finish","",""], "labels":{"a.t":4,"a.f":10,"e11":41,"e12":47,"e22":48,"e23":55,"e34":61}}