{"crc":-776258720, "lines":["It's a hot, sunny day. You and a friend are sitting around trying to think of something to do. Dad is sitting in the shade, napping on a chair. You get a great idea. \"Let's play a practical joke on Dad!\"","*choice mood action","  #MISCHIEVOUS","    #LET THE AIR OUT OF THE CAR TIRES","      *goto A11","    #SPRAY DAD WITH THE HOSE","      *goto A12","    #GIVE DAD A \"HOT FOOT\" LIKE ON THE CARTOONS","      *goto A13","    *selectable_if (false) #LET DAD SLEEP","      *finish","  #SECOND THOUGHTS","    *selectable_if (false) #LET THE AIR OUT OF THE CAR TIRES","      *finish","    *selectable_if (false) #SPRAY DAD WITH THE HOSE","      *finish","    *selectable_if (false) #GIVE DAD A \"HOT FOOT\" LIKE ON THE CARTOONS","      *finish","    #LET DAD SLEEP","      *goto A24","*label A11","*set GN%-10","That wasn't mischievous, that was hostile. Dad gets very angry and the afternoon takes a definite turn for the worse.","*finish","*label A12","How hard do you want to turn on the water?","","","Select an action:","","*choice","  #A LIGHT SPRAY","    *goto B1","  #A HARD BLAST","    *goto B2","*label B1","*set HP%+10","Dad wakes up and shakes his head. He thinks it's pretty funny and suggests a plan to lure Mom outside so you can spray her, too. He goes into the house and comes out giving you the \"thumbs up\" sign.","*page_break","He tells you to keep an eye out for Mom while he aims the hose. She should be coming around the bend right over there (he points).","How are you feeling now?","","","Select a mood:","","*choice","  #EXCITED","    *goto C1","  #CONFUSED","    *goto C2","*label C1","*set HP%+20","*set FM%+10","Before you know it there is a hose down your pants. WOW, THAT'S COLD.  He fooled you. Mom leans out the window and drops a potful of cold water on your head! Everyone laughs.","*finish","*label C2","*set FM%+10","*set HP%+10","*set IN%+10","You should be confused. Why should Dad be on your side so soon after you just doused him with water? You aren't gullible, but you ARE too late. Before you know it Dad has the hose down your pants and Mom pours a potful of cold water on","your head from the window. Everyone laughs.","*finish","*label B2","*set FM%-10","The hose hits Dad in the face and stings him. He doesn't appreciate the humor in your little prank, but knows you didn't mean anything by it. You can:","","","Select an action:","","*choice","  #APOLOGIZE","    *goto D1","  #LEAVE HIM ALONE","    *goto D2","*label D1","*set FM%+20","He understands and accepts. He once pulled off your grandfather's toupee in front of company because he thought HE was being funny.","*finish","*label D2","You get a stern lecture on the seriousness of certain kinds of pranks.","*finish","*label A13","*if AG<8","  *goto E.T","*else","  *goto E.F","*label E.T","*set FM%-20","Dad wakes up screaming. He looks just like that funny coyote. You think he is fooling around, but he isn't. It really hurts a lot. You get a spanking. You are beginning to realize the difference between cartoons and real life -- the hard","way.","*finish","*label E.F","*set FM%-10","You should know better than that. What's the matter with you? You are old enough to know how dangerous things like that can be. You get a stern lecture and get grounded for a week. Dad gets a \"mummy foot\" and walks around cringing for a","while.","*finish","*label A24","*set TR%+10","You and your friend have even more fun talking about all the things you COULD do to Dad. The fantasies are much more fun and never wind up by having Dad spank you. When Dad wakes up he sees you and your friend giggling and can't","understand why you keep calling him names like \"Ol' Hotfoot.\"","*finish","",""], "labels":{"a11":20,"a12":24,"b1":35,"c1":50,"c2":55,"b2":62,"d1":74,"d2":78,"a13":81,"e.t":86,"e.f":91,"a24":96}}