{"crc":-1651482434, "lines":["*label REWAKE","You have just awakened from a nice, long nap. Your mom comes in the room and wants to hold you.","*choice mood action","  #SLEEPY","    *selectable_if (false) #CRY","      *finish","    #DO NOTHING","      *goto A12","    #SMILE","      *goto A13","  #CRANKY","    #CRY","      *goto A21","    *selectable_if (false) #DO NOTHING","      *finish","    *selectable_if (false) #SMILE","      *finish","  #HAPPY","    *selectable_if (false) #CRY","      *finish","    *selectable_if (false) #DO NOTHING","      *finish","    #SMILE","      *goto A33","*label A21","You must be in a very foul mood today. Mood swings such as these are quite common with babies your age. Unfortunately, when babies are too cranky their parents see this as a sign of rejection. Go back to sleep and wake up later.","*set HP%-20","*page_break","*goto REWAKE","*label A12","*label A13","It's a dog's life, isn't it? Nothing to do all day except eat, sleep and wonder what life will be like when you're older. (Does life really change after 2 ?) Mom is coming closer.","","","Select an action:","","*choice","  #ATTEND TO HER","    *goto B1","  #IGNORE HER","    *goto B2","*label B1","*set FM%+30","*set SC%+20","Very good. Eye contact with your caretakers is very reinforcing to them. Parents often mistakenly think that it is the children who need all the attention. Believe me, parents want it, too. Your eye contact with her makes","her smile. Social and Emotional spheres are increasing.","","","Select an action:","","*choice","  #SMILE BACK","    *goto C1","  #BECOME SLEEPY","    *goto C2","*label C1","*label SMILE","*set SC%+10","Smiling makes your mom feel especially loving towards you. She brings your face close to her face. Your faces touch.","","","Select an action:","","*choice","  #MOVE YOUR MOUTH","    *goto D1","  #BE STILL","    *goto D2","*label D1","*label MOUTH","You just gave your first kiss! This may not seem like a very big deal to you, but it is very important for your mother. The bad part is that now you will have to repeat this act until your entire family becomes aware of your new talent.","*page_break","You can avoid kissing overly-affectionate relatives by dribbling on them at just the right moment.","*set EX%+20","*finish","*label D2","*label STILL","You are probably wondering why your mom is doing this. She wants you to kiss her, but now you've lost the opportunity. You will have many more chances to learn this extremely valuable skill.","*finish","*label C2","*label SLEEP","Too tired to interact now? That's understandable. You did, however, pass up the opportunity for a rewarding social and emotional interaction.","*finish","*label B2","Your mom tries to get your attention by making clicking noises with her mouth and calling your name.","","","Select an action:","","*choice","  #ATTEND TO HER","    *goto E1","  #KEEP IGNORING","    *goto E2","*label E1","*set SC%+20","Your mom has coaxed you into attending to her. This makes her feel like she is being a good mother. She smiles at you.","","","Select an action:","","*choice","  #SMILE BACK","    *goto F1","  #BECOME SLEEPY","    *goto F2","*label F1","*goto SMILE","*label F2","*goto SLEEP","*label E2","*set FM%-20","Fickle child! You have hurt your mother's feelings. You could have given her a smile.","*finish","*label A33","*set HP%+40","*set FM%+30","This is a great way to make a new mom feel good. Your consideration earns you points in many spheres. You will find that as life progresses pleasing mother becomes harder and harder. In a few years, it will take doing chores and","going to the store. Before you know it, she'll want you to become a doctor or a lawyer. Enjoy your infancy while you can. Your mom picks you up so that your face touches her face.","","","Select an action:","","*choice","  #MOVE YOUR MOUTH","    *goto G1","  #BE STILL","    *goto G2","*label G1","*goto MOUTH","*label G2","*goto STILL","",""], "labels":{"rewake":0,"a21":24,"a12":29,"a13":30,"b1":41,"c1":55,"smile":56,"d1":68,"mouth":69,"d2":75,"still":76,"c2":79,"sleep":80,"b2":83,"e1":94,"f1":106,"f2":108,"e2":110,"a33":114,"g1":128,"g2":130}}